Repository: etsraphael/ChainBrary
Catalog: UI/src/locale/messages.*.xlf
Languages: es, fr

source: Please be connected on the <strong>async)?.name }}network network to use this feature.
es: Manténgase conectado en la red <strong>async)?.name }}network para usar esta función.
fr: Veuillez être connecté sur le réseau <strong> async)?.name }} network pour utiliser cette fonctionnalité.

source: Amount (in USD)
es: Cantidad (en USD)
fr: Montant (en USD)

source: Amount
es: Cantidad
fr: Montant

source: - Submissions must include a Proof of Concept (PoC) demonstrating the vulnerability's exploitability. This could be in the form of a smart contract or a transaction. - XSS (Cross-Site Scripting) reports are limited to those that potentially induce users to authorize transactions or cause redirects. - Our team reserves the right to evaluate the impact and authenticity of the reported vulnerability.
es: - Las presentaciones deben incluir una Prueba de Concepto (PoC) que demuestre la explotabilidad de la vulnerabilidad. Esto podría ser en forma de un contrato inteligente o una transacción. - Los informes de XSS (Cross-Site Scripting) están limitados a aquellos que potencialmente inducen a los usuarios a autorizar transacciones o causar redirecciones. - Nuestro equipo se reserva el derecho de evaluar el impacto y autenticidad de la vulnerabilidad reportada.
fr: - Les soumissions doivent inclure une Preuve de Concept (PoC) démontrant l'exploitabilité de la vulnérabilité. Cela pourrait être sous la forme d'un contrat intelligent ou d'une transaction. - Les rapports XSS (Cross-Site Scripting) sont limités à ceux qui pourraient potentiellement amener les utilisateurs à autoriser des transactions ou à provoquer des redirections. - Notre équipe se réserve le droit d'évaluer l'impact et l'authenticité de la vulnérabilité signalée.

source: You're requesting <strong>$USD {{ usdAmount }}</strong >. <br /> Rest assured, the transaction will be initiated to precisely match this amount, irrespective of any token volatility.
es: Estás solicitando <strong>$USD {{ usdAmount }}</strong >. <br /> Ten la seguridad de que la transacción se iniciará para coincidir exactamente con esta cantidad, independientemente de cualquier volatilidad de los tokens.
fr: Vous demandez $USD. Soyez assuré que la transaction sera initiée pour correspondre exactement à ce montant, indépendamment de toute volatilité de jeton. <strong> {{ usdAmount }} </strong > <br />

source: Terms and Conditions
es: Términos y Condiciones
fr: Termes et Conditions

source: At Chainbrary, we're excited about the amazing projects we can accomplish together. Don't miss your chance to be a part of something extraordinary. Join us now!
es: En Chainbrary, estamos entusiasmados por los increíbles proyectos que podemos lograr juntos. No pierdas la oportunidad de ser parte de algo extraordinario. ¡Únete a nosotros ahora!
fr: Chez Chainbrary, nous sommes enthousiastes à l'idée des projets incroyables que nous pouvons réaliser ensemble. Ne manquez pas votre chance de faire partie de quelque chose d'extraordinaire. Rejoignez-nous maintenant!

source: Link images
es: Vincular imágenes
fr: Lier les images

source: You must accept the terms and conditions.
es: Debe aceptar los términos y condiciones.
fr: Vous devez accepter les termes et conditions.

source: This document has already been unlocked by another user. This means that the content of this document is only accessible to the owner of the document and the user who unlocked it first.
es: Este documento ya ha sido desbloqueado por otro usuario. Esto significa que el contenido de este documento solo es accesible para el propietario del documento y el usuario que lo desbloqueó primero.
fr: Ce document a déjà été déverrouillé par un autre utilisateur. Cela signifie que le contenu de ce document n'est accessible qu'au propriétaire du document et à l'utilisateur qui l'a déverrouillé en premier.

source: Refreshing... {{ biddersCountdown }} seconds
es: Refrescando... {{ biddersCountdown }} segundos
fr: Actualisation... {{ biddersCountdown }} secondes

source: Amount (USD)
es: Cantidad (USD)
fr: Montant (USD)

source: Building trust among various crypto users by supporting different tokens
es: Construyendo confianza entre diversos usuarios de criptomonedas al respaldar diferentes tokens
fr: Construire la confiance parmi divers utilisateurs de crypto en soutenant différents tokens

source: The image was found on the blockchain and it's ready to be displayed.
es: La imagen fue encontrada en la blockchain y está lista para ser mostrada.
fr: L'image a été trouvée sur la blockchain et est prête à être affichée.

source: Print
es: Imprimir
fr: Imprimer

source: Network is not supported, please change from wallet
es: La red no es compatible, por favor cambie desde la billetera.
fr: Le réseau n'est pas pris en charge, veuillez changer de portefeuille

source: Add to wallet
es: Agregar a la billetera
fr: Ajouter au portefeuille

source: Withdraw Bid
es: Retirar oferta
fr: Retirer l'enchère

source: Services
es: Servicios

source: <strong>estState$ | async)?.profile?.username }}</strong> is requesting a sum equivalent to <strong>${{ (selectPaymentRequestState$ | async)?.payment?.data?.amount }} USD</strong>. <br /> To ensure accuracy, the transaction will be precisely calculated to match this amount in {{ tokenInfo }} prior to processing the payment.
es: <strong>estState$ | async)?.profile?.username }}</strong> está solicitando una suma equivalente a <strong>${{ (selectPaymentRequestState$ | async)?.payment?.data?.amount }} USD</strong>. <br /> Para asegurar la precisión, la transacción será calculada exactamente para coincidir con esta cantidad en {{ tokenInfo }} antes de procesar el pago.
fr: <strong> estState$ | async)?.profile?.username }} </strong> demande une somme équivalente à <strong> ${{ (selectPaymentRequestState$ | async)?.payment?.data?.amount }} USD</strong> .<br /> Pour garantir la précision, la transaction sera calculée avec précision pour correspondre à ce montant en {{ tokenInfo }} avant de traiter le paiement.

source: Total Bid Amount
es: Monto Total de la Oferta
fr: Montant total de l'enchère

source: Value is required
es: Se requiere un valor
fr: La valeur est requise

source: Bid address
es: Dirección de oferta
fr: Adresse de l'enchère

source: Log out
es: Cerrar sesión
fr: Se déconnecter

source: Are you sure?
es: ¿Estás seguro?
fr: Êtes-vous sûr ?

source: Token is required
es: Se requiere un token
fr: Le jeton est requis

source: Unlocking amount
es: Desbloqueo de cantidad
fr: Déblocage du montant

source: <span>Accept</span><a class="terms-link ps-2" (click)="openTermAndCond($event)">terms and conditions</a>
es: <span>Aceptar </span><a class="terms-link ps-2" (click)="openTermAndCond($event)">términos y condiciones</a>
fr: <span>Accepter </span><a class="terms-link ps-2" (click)="openTermAndCond($event)"> les termes et conditions</a>

source: Value has to be less than current balance
es: El valor debe ser menor que el saldo actual
fr: La valeur doit être inférieure au solde actuel

source: Your current network is not supported. Please switch to a compatible network. For assistance or to share your suggestions with our community, join us on <a href="https://discord.gg/Y3pTujEsMe" target="_blank" rel="noopener noreferrer">Discord</a>.
es: Su red actual no es compatible. Cambie a una red compatible. Para asistencia o para compartir sus sugerencias con nuestra comunidad, únase a nosotros en <a href="https://discord.gg/Y3pTujEsMe" target="_blank" rel="noopener noreferrer">Discord</a>.
fr: Votre réseau actuel n'est pas pris en charge. Veuillez passer à un réseau compatible. Pour obtenir de l'aide ou partager vos suggestions avec notre communauté, rejoignez-nous sur <a href="https://discord.gg/Y3pTujEsMe" target="_blank" rel="noopener noreferrer"> Discord</a> .

source: No transactions found.
es: No se encontraron transacciones.
fr: Aucune transaction trouvée.

source: This address is invalid
es: Esta dirección es inválida
fr: Cette adresse est invalide

source: This description is only visible for the owner of the document and the first buyer. Make sure your screen is not recorded
es: Esta descripción solo es visible para el propietario del documento y el primer comprador. Asegúrate de que tu pantalla no esté siendo grabada.
fr: Cette description n'est visible que pour le propriétaire du document et le premier acheteur. Assurez-vous que votre écran n'est pas enregistré.

source: Withdraw
es: Retirar
fr: Retirer

source: Tailored Solutions at Your Fingertips
es: Soluciones a medida al alcance de tu mano
fr: Des solutions sur-mesure à votre portée

source: Total amount stacked
es: Cantidad total acumulada
fr: Montant total empilé

source: Low
es: Bajo
fr: Faible

source: We are currently approchaing the end of the auction. Please make sure to submit your bid with a higher value of fee to ensure that your transaction will be processed in time.
es: Actualmente nos estamos acercando al final de la subasta. Asegúrese de enviar su oferta con un valor de tarifa más alto para garantizar que su transacción se procese a tiempo.
fr: Nous approchons actuellement de la fin de l'enchère. Veuillez vous assurer de soumettre votre enchère avec une valeur de frais plus élevée pour garantir que votre transaction sera traitée à temps.

source: This action will pause the entire token and stop all current transfers. Please confirm if you want to proceed.
es: Esta acción pausará todo el token y detendrá todas las transferencias actuales. Por favor confirme si desea proceder.
fr: Cette action mettra en pause l'ensemble du token et arrêtera tous les transferts en cours. Veuillez confirmer si vous souhaitez procéder.

source: Bid address must be a valid address
es: La dirección de oferta debe ser una dirección válida
fr: L'adresse de l'enchère doit être une adresse valide

source: Achieving Wide Range Recognition
es: Logrando un Reconocimiento de Amplio Alcance
fr: Atteindre une Reconnaissance à Grande Échelle

source: Learn more
es: Aprende más
fr: En savoir plus

source: Please enter a value higher than the current bid
es: Por favor, introduzca un valor superior al de la oferta actual.
fr: Veuillez saisir une valeur supérieure à l'enchère actuelle

source: Max supply invalid
es: Suministro máximo no válido
fr: Quantité maximale invalide

source: A connected wallet is necessary to see the the progress of the bid.
es: Es necesario tener una cartera conectada para ver el progreso de la oferta.
fr: Un portefeuille connecté est nécessaire pour voir le progrès de l'offre.

source: User Details
es: Detalles del Usuario
fr: Détails de l'Utilisateur

source: Already unlocked by an account
es: Ya desbloqueado por una cuenta
fr: Déjà déverrouillé par un compte

source: Please use a mobile device to scan the QR code.
es: Por favor, use un dispositivo móvil para escanear el código QR.
fr: Veuillez utiliser un appareil mobile pour scanner le code QR.

source: Discover Chainbrary: Your Safe, User-Friendly Blockchain Starter Kit. Begin with ease, backed by our commitment to your security.
es: Descubre Chainbrary: Tu Kit de Inicio a la Blockchain Seguro y Fácil de Usar. Comienza con facilidad, respaldado por nuestro compromiso con tu seguridad.
fr: Découvrez Chainbrary : Votre Kit de Démarrage Blockchain Sûr et Facile à Utiliser. Commencez en toute simplicité, soutenu par notre engagement pour votre sécurité.

source: Recipient
es: Destinatario
fr: Destinataire

source: Term and condition
es: Término y condición
fr: Termes et conditions

source: Be a part of Chainbrary
es: Sé parte de Chainbrary
fr: Soyez une partie de Chainbrary

source: Name must be less than 20 characters
es: El nombre debe tener menos de 20 caracteres
fr: Le nom doit contenir moins de 20 caractères

source: This action will unpause the entire token and allow all transfers to continue. Please confirm if you want to proceed.
es: Esta acción despausará todo el token y permitirá que todas las transferencias continúen. Por favor confirma si deseas proceder.
fr: Cette action va débloquer l'ensemble du jeton et permettre la continuation de tous les transferts. Veuillez confirmer si vous souhaitez procéder.

source: Current balance:
es: Saldo actual:
fr: Solde actuel :

source: Choose token
es: Seleccionar token
fr: Choisir un jeton

source: Submission Process
es: Proceso de envío
fr: Processus de Soumission

source: Withdrawal Details
es: Detalles de retiro
fr: Détails de Retrait

source: Your transaction has been sent and is processing on the blockchain. Thank you for choosing our reliable and secure platform. Check its status by clicking <a class="text-light" (click)="goToHashExplorer()">here</a>
es: Tu transacción ha sido enviada y está procesándose en la blockchain. Gracias por elegir nuestra plataforma segura y confiable. Verifica su estado haciendo clic <a class="text-light" (click)="goToHashKuriExplorer()">aquí</a>
fr: Votre transaction a été envoyée et est en cours de traitement sur la blockchain. Merci d'avoir choisi notre plateforme fiable et sécurisée. Vérifiez son statut en cliquant <a class="text-light" (click)="goToHashExplorer()"> ici</a>

source: Oops!
es: ¡Ups!
fr: Oups!

source: A wallet address must start with 0x
es: Una dirección de billetera debe comenzar con 0x
fr: Une adresse de portefeuille doit commencer par 0x

source: URL invalid
es: URL inválida
fr: URL invalide

source: Scan QR to Pay
es: Escanea el QR para pagar
fr: Scannez le QR pour Payer

source: To participate in the Chainbrary Bug Bounty Program, you must: 1. Identify a previously unreported and non-public vulnerability. The vulnerability should be unknown to our team and fall within the program's defined scope. 2. Be at least 18 years of age. Participants below 18 must have consent from a parent or guardian. 3. Provide comprehensive details to enable our engineering team to reproduce, understand, and address the vulnerability.
es: Para participar en el Programa de Recompensas por Errores de Chainbrary, debes: 1. Identificar una vulnerabilidad previamente no reportada y no pública. La vulnerabilidad debe ser desconocida para nuestro equipo y estar dentro del alcance definido del programa. 2. Tener al menos 18 años de edad. Los participantes menores de 18 deben tener el consentimiento de un padre o tutor. 3. Proporcionar detalles completos para permitir a nuestro equipo de ingeniería reproducir, entender y abordar la vulnerabilidad.
fr: Pour participer au Programme de primes pour la détection de bogues de Chainbrary, vous devez : 1. Identifier une vulnérabilité non signalée auparavant et non publique. La vulnérabilité doit être inconnue de notre équipe et relever du périmètre défini par le programme. 2. Avoir au moins 18 ans. Les participants de moins de 18 ans doivent obtenir le consentement d'un parent ou d'un tuteur. 3. Fournir des détails complets pour permettre à notre équipe d'ingénierie de reproduire, comprendre et traiter la vulnérabilité.

source: Name
es: Nombre
fr: Nom

source: Token Name
es: Nombre del token
fr: Nom du jeton

source: Please be aware that confirmation times for recent bids can vary due to network conditions. For the latest status, kindly refresh this page. If your transaction is still processing, you can track it here: <a target="_blank" [href]="txnLink$ | async">$ | async }}>. Thank you for your patience.
es: Tenga en cuenta que los tiempos de confirmación para las ofertas recientes pueden variar debido a las condiciones de la red. Para ver el estado más reciente, por favor actualice esta página. Si su transacción aún está procesándose, puede seguirla aquí: <a target="_blank" [href]="txnLink$ | async">$ | async }}>. Gracias por su paciencia.
fr: Veuillez noter que les temps de confirmation pour les offres récentes peuvent varier en raison des conditions du réseau. Pour le statut le plus récent, veuillez rafraîchir cette page. Si votre transaction est encore en cours de traitement, vous pouvez la suivre ici : <a target="_blank" [href]="txnLink$ | async"> $ | async }} > . Merci de votre patience.

source: Scan QR code at the vendors and pay with crypto currency.
es: Escanee el código QR en los vendedores y pague con criptomoneda.
fr: Scannez le code QR chez les vendeurs et payez avec de la crypto-monnaie.

source: Token details
es: Detalles del token
fr: Détails du jeton

source: Payment Status
es: Estado de pago
fr: Statut de Paiement

source: Your withdrawal request has been processed successfully. Below are the transaction details:
es: Su solicitud de retiro ha sido procesada con éxito. A continuación se encuentran los detalles de la transacción:
fr: Votre demande de retrait a été traitée avec succès. Voici les détails de la transaction :

source: Amount has to be greater than 0
es: El monto tiene que ser mayor que 0
fr: Le montant doit être supérieur à 0

source: Create Token
es: Crear Token
fr: Créer un jeton

source: Action
es: Acción

source: Add myself as recipient
es: Añadirme como destinatario
fr: Ajouter moi-même comme destinataire

source: Creating your token... Please confirm the request on your wallet.
es: Creando tu token... Por favor confirma la solicitud en tu billetera.
fr: Création de votre jeton... Veuillez confirmer la demande sur votre portefeuille.

# bidCreation.ImageAlreadyAdded
source: Image already added
es: Imagen ya agregada
fr: L'image a déjà été ajoutée

# bidCreation.PleaseAddAtLeastOneImage.
source: Please add at least one image
es: Por favor, agregue al menos una imagen.
fr: Veuillez ajouter au moins une image

# bidCreationHeaderTitle
source: Bid creation
es: Creación de oferta
fr: Création d'enchère

# bidErrorMessage.alreadyHighestBidder
source: You are already the highest bidder
es: Ya eres el postor más alto.
fr: Vous êtes déjà le plus haut enchérisseur

# bidErrorMessage.AnErrorOccuredWhileCreatingYourBid
source: An error has occurred with your wallet. Please ensure that you are using the correct address and network. Additionally, verify that you have sufficient funds available for the bid deployment on the blockchain.
es: Ha ocurrido un error con tu billetera. Por favor asegúrate de que estás usando la dirección y red correctas. Además, verifica que tienes fondos suficientes disponibles para el despliegue de la oferta en la blockchain.
fr: Une erreur s'est produite avec votre portefeuille. Veuillez vous assurer que vous utilisez la bonne adresse et le bon réseau. De plus, vérifiez que vous avez suffisamment de fonds disponibles pour le déploiement de l'enchère sur la blockchain.

# bidErrorMessage.AnErrorOccuredWhilePlacingYourBid
source: An error occured while placing your bid
es: Ocurrió un error al realizar tu oferta
fr: Une erreur s'est produite lors de la soumission de votre enchère

# bidErrorMessage.AnErrorOccuredWhileSearchingForYourBid
source: This address is not associated with any bids that have been created. Please make sure the network is correct and try again.
es: Esta dirección no está asociada con ninguna oferta creada. Por favor, asegúrate de que la red es la correcta e inténtalo de nuevo.
fr: Cette adresse n'est associée à aucune offre qui a été créée. Veuillez vous assurer que le réseau est correct et réessayez.

# bidErrorMessage.auctionNotOngoing
source: This auction is not ongoing
es: Esta subasta no está en curso.
fr: Cette enchère n'est pas en cours

# bidErrorMessage.bidAmountNotHighEnough
source: Your bid amount is not high enough
es: Tu oferta no es lo suficientemente alta.
fr: Votre montant d'offre n'est pas assez élevé.

# bidErrorMessage.PleaseConnectYourWalletToCreateABid
source: Wallet not connected. Please connect your wallet and try again. If you do not have a wallet, please create one.
es: Cartera no conectada. Por favor, conecta tu cartera e inténtalo de nuevo. Si no tienes una cartera, por favor crea una.
fr: Portefeuille non connecté. Veuillez connecter votre portefeuille et réessayer. Si vous n'avez pas de portefeuille, veuillez en créer un.

# BidResponse.BidCreatedSuccessfully
source: Bid created successfully
es: Oferta creada con éxito
fr: Offre créée avec succès

# BidResponse.Success.BidPlacedSuccessfully
source: Bid placed successfully
es: Oferta realizada con éxito
fr: Offre placée avec succès

# BidResponse.WithdrawRequestSentSuccessfully
source: Withdraw request sent successfully
es: Solicitud de retiro enviada con éxito
fr: Demande de retrait envoyée avec succès

# bidResult.AuctionEnded
source: Auction ended
es: Subasta finalizada
fr: Enchère terminée

# bidSearchTitle
source: Join a bid
es: Unirse a una oferta
fr: Rejoindre une enchère
