Repository: etsraphael/ChainBrary
Catalog: UI/src/locale/messages.*.xlf
Languages: es, fr

# tokenManagement.balanceLoadFailure
source: Balance load failed
es: Error al cargar el saldo
fr: Échec du chargement de l'équilibre

# tokenManagement.tokenCreationFailure
source: Token creation failed. Please try again.
es: La creación de tokens ha fallado. Por favor, intenta de nuevo.
fr: La création de jeton a échoué. Veuillez réessayer.

# transaction.payment.title
source: Transaction sent successfully
es: Transacción enviada con éxito
fr: Transaction envoyée avec succès

# transaction.WalletIsNotConnected
source: Wallet is not connected
es: La billetera no está conectada
fr: Le portefeuille n'est pas connecté

# useCases.bid.createBid
source: Create a bid
es: Crear una oferta
fr: Créer une enchère

# useCases.bid.createBidDescription
source: Kickstart your bidding process with 'Create a Bid.' Tailor your bid with ease, ensuring a secure and straightforward setup. Ideal for diverse offerings, this feature simplifies launching bids on our decentralized platform.
es: Inicia tu proceso de licitación con 'Crear una oferta.' Personaliza tu oferta con facilidad, asegurando una configuración segura y sencilla. Ideal para ofertas diversas, esta característica simplifica el lanzamiento de ofertas en nuestra plataforma descentralizada.
fr: Lancez votre processus d'enchères avec 'Créez une offre'. Personnalisez votre offre en toute simplicité, en garantissant une configuration sécurisée et simple. Idéal pour diverses offres, cette fonctionnalité simplifie le lancement des enchères sur notre plateforme décentralisée.

# useCases.bid.description
source: Effortlessly initiate and propagate bids among your peers. This feature has been fine-tuned for the network's native tokens, ensuring seamless integration and reliability. Dive into the bidding process with enhanced transparency and full control, while catering to your specific requirements within the network's ecosystem.
es: Inicia y propaga ofertas entre tus pares sin esfuerzo. Esta característica ha sido afinada para los tokens nativos de la red, asegurando integración impecable y fiabilidad. Sumérgete en el proceso de licitación con mayor transparencia y control total, mientras satisfaces tus requisitos específicos dentro del ecosistema de la red.
fr: Lancez et propagez facilement des enchères parmi vos pairs. Cette fonctionnalité a été optimisée pour les jetons natifs du réseau, garantissant une intégration transparente et fiable. Plongez dans le processus d'enchère avec une transparence accrue et un contrôle total, tout en répondant à vos besoins spécifiques au sein de l'écosystème du réseau.

# useCases.bid.joinBid
source: Join a bid
es: Únete a una oferta
fr: Rejoignez une enchère

# useCases.bid.joinBidDescription
source: Dive into existing bids with 'Join a Bid.' Find and participate in bids that align with your interests. Our platform offers a seamless and secure way to engage with the decentralized bidding community.
es: Sumérgete en las ofertas existentes con 'Unirse a una Oferta.' Encuentra y participa en ofertas que coincidan con tus intereses. Nuestra plataforma ofrece una manera fluida y segura de interactuar con la comunidad de ofertas descentralizadas.
fr: Plongez dans les offres existantes avec 'Rejoindre une offre'. Trouvez et participez aux offres qui correspondent à vos intérêts. Notre plateforme offre un moyen simple et sécurisé pour s'engager avec la communauté d'enchères décentralisée.

# useCases.bid.title
source: Bid
es: Oferta
fr: Enchère

# useCasesDocumentLockerDescription
source: Explore the pinnacle of document security with our Document Locker. Utilizing cutting-edge blockchain technology, we offer an unparalleled level of protection and privacy for your valuable documents. This service is tailored for those who demand the highest standards of security and exclusive access.
es: Explora el punto más alto en seguridad documental con nuestro Document Locker. Utilizando tecnología blockchain de última generación, ofrecemos un nivel de protección y privacidad sin igual para tus documentos valiosos. Este servicio está diseñado para aquellos que exigen los más altos estándares de seguridad y acceso exclusivo.
fr: Explorez le summum de la sécurité des documents avec notre Coffre de Documents. Utilisant une technologie blockchain de pointe, nous offrons un niveau de protection et de confidentialité inégalé pour vos documents précieux. Ce service est adapté pour ceux qui exigent les normes les plus élevées de sécurité et un accès exclusif.

# useCasesSearchTokenTitle
source: Search token
es: Buscar token
fr: Jeton de recherche

# useCasesSetUpTokenDescription
source: Simple, Fast, Convenient to create tokens.Get 100% ownership of generated tokens with Custom token name, symbol and initial supply. Automatic verified and published contract source code.
es: Simple, Fast, Convenient para crear tokens. Obtén el 100% de propiedad de los tokens generados con nombre, símbolo e inventario inicial personalizados. Código fuente del contrato verificado y publicado automáticamente.
fr: Simple, rapide, pratique pour créer des jetons. Obtenez 100% de propriété des jetons générés avec un nom de jeton personnalisé, un symbole et un approvisionnement initial. Code source du contrat automatiquement vérifié et publié.

# useCasesSetUpTokenTitle
source: Set up token
es: Configurar token
fr: Configurer le jeton

# useCasesShopQrCodeDescription
source: By accepting cryptocurrencies, you open doors to a broader customer base. Enhance your business's payment options by printing a QR code, allowing your customers to make seamless cryptocurrency transactions. Embrace the future of finance and offer your clientele the convenience and security of paying with digital currencies.
es: Al aceptar criptomonedas, abres las puertas a una base de clientes más amplia. Mejora las opciones de pago de tu negocio imprimiendo un código QR, permitiendo que tus clientes realicen transacciones de criptomonedas sin inconvenientes. Abraza el futuro de las finanzas y ofrece a tu clientela la comodidad y seguridad de pagar con monedas digitales.
fr: En acceptant les cryptomonnaies, vous ouvrez les portes à une base de clients plus large. Améliorez les options de paiement de votre entreprise en imprimant un code QR, permettant à vos clients d'effectuer des transactions en cryptomonnaie en toute simplicité. Adoptez l'avenir de la finance et offrez à votre clientèle la commodité et la sécurité du paiement avec des monnaies numériques.

# useCasesShopQrCodeTitle
source: My QR Code
es: Mi código QR
fr: Mon Code QR

# vaultTermAndCond
source: # Community Vault Token Addition Terms and Conditions __DOUBLE_NEWLINE__ _Last Updated: 24th March 2024_ __DOUBLE_NEWLINE__ ### Introduction __DOUBLE_NEWLINE__ **Welcome to the Community Vault Token Addition Feature.** This document outlines the Terms and Conditions specifically for adding tokens to the Community Vault via our smart contract. By engaging with this feature, you agree to abide by these terms, ensuring a transparent and responsible token addition process. __DOUBLE_NEWLINE__ ### Acceptance of Terms __DOUBLE_NEWLINE__ 1. **Agreement:** By adding tokens to the Community Vault, you are agreeing to these Terms and Conditions. __DOUBLE_NEWLINE__ 2. **Eligibility:** You must be of legal age and capable of entering into legally binding contracts. By adding tokens, you confirm compliance with this requirement. __DOUBLE_NEWLINE__ ### Process of Token Addition __DOUBLE_NEWLINE__ 1. **Deposit Method:** Tokens are added via a direct transfer to the smart contract. __DOUBLE_NEWLINE__ 2. **Token Types:** Ensure the tokens you are adding are compatible with the smart contract. __DOUBLE_NEWLINE__ 3. **Responsibility for Tokens:** Once added, tokens are under the control of the smart contract, subject to its rules and operations. __DOUBLE_NEWLINE__ ### User Responsibilities __DOUBLE_NEWLINE__ 1. **Compliance:** Adhere to all applicable laws and regulations in your jurisdiction related to cryptocurrency transactions. __DOUBLE_NEWLINE__ 2. **Awareness:** Understand the risks involved in digital token transactions, including potential loss. __DOUBLE_NEWLINE__ 3. **Verification:** Ensure the correctness of the amount and type of tokens added. __DOUBLE_NEWLINE__ ### Security __DOUBLE_NEWLINE__ 1. **Wallet Security:** You are solely responsible for the security of your blockchain wallet. __DOUBLE_NEWLINE__ 2. **Smart Contract Reliance:** Recognize that the token addition is reliant on the security and functionality of the smart contract. __DOUBLE_NEWLINE__ ### Risk Acknowledgement __DOUBLE_NEWLINE__ 1. **Volatility and Risk:** Acknowledge the inherent risks in cryptocurrency transactions, including market volatility and technology risks. __DOUBLE_NEWLINE__ 2. **No Insurance:** Tokens added to the Community Vault are not insured. In the event of loss, there is no recourse for recovery of value. __DOUBLE_NEWLINE__ ### Changes to Terms __DOUBLE_NEWLINE__ 1. **Modification Rights:** These Terms and Conditions may be modified periodically to reflect changes in services, legal requirements, or advancements in technology. __DOUBLE_NEWLINE__ 2. **Continued Use:** Continued use of the token addition feature after changes indicates acceptance of the new terms. __DOUBLE_NEWLINE__ ### Liability Limitations __DOUBLE_NEWLINE__ 1. **Disclaimer:** We are not liable for any direct or indirect losses incurred due to market volatility, technical failures, or other factors beyond our control. __DOUBLE_NEWLINE__ 2. **Indemnification:** You agree to indemnify and hold us harmless against any claims or losses related to the use of the Community Vault token addition feature. __DOUBLE_NEWLINE__ ### Contact and Support __DOUBLE_NEWLINE__ - For inquiries or support, please reach out through our designated channels. __DOUBLE_NEWLINE__ ### Final Acknowledgement __DOUBLE_NEWLINE__ By adding tokens to the Community Vault, you affirm your understanding and agreement to these Terms and Conditions, effective as of 24th March 2024.
es: # Términos y Condiciones para la Adición de Tokens en la Bóveda Comunitaria __DOUBLE_NEWLINE__ _Última actualización: 24 de marzo de 2024_ __DOUBLE_NEWLINE__ ### Introducción __DOUBLE_NEWLINE__ **Bienvenido a la Función de Adición de Tokens en la Bóveda Comunitaria.** Este documento describe los Términos y Condiciones específicamente para agregar tokens a la Bóveda Comunitaria mediante nuestro contrato inteligente. Al interactuar con esta función, aceptas cumplir con estos términos, asegurando un proceso de adición de tokens transparente y responsable. __DOUBLE_NEWLINE__ ### Aceptación de los Términos __DOUBLE_NEWLINE__ 1. **Acuerdo:** Al agregar tokens a la Bóveda Comunitaria, estás aceptando estos Términos y Condiciones. __DOUBLE_NEWLINE__ 2. **Elegibilidad:** Debes ser mayor de edad y capaz de celebrar contratos legalmente vinculantes. Al agregar tokens, confirmas el cumplimiento de este requisito. __DOUBLE_NEWLINE__ ### Proceso de Adición de Tokens __DOUBLE_NEWLINE__ 1. **Método de Depósito:** Los tokens se agregan mediante una transferencia directa al contrato inteligente. __DOUBLE_NEWLINE__ 2. **Tipos de Tokens:** Asegúrate de que los tokens que estás agregando sean compatibles con el contrato inteligente. __DOUBLE_NEWLEFT__ 3. **Responsabilidad sobre los Tokens:** Una vez agregados, los tokens están bajo el control del contrato inteligente, sujetos a sus reglas y operaciones. __DOUBLE_NEWLINE__ ### Responsabilidades del Usuario __DOUBLE_NEWLINE__ 1. **Cumplimiento:** Adhiérete a todas las leyes y regulaciones aplicables en tu jurisdicción relacionadas con las transacciones de criptomonedas. __DOUBLE_NEWLINE__ 2. **Conciencia:** Entiende los riesgos involucrados en las transacciones de tokens digitales, incluida la pérdida potencial. __DOUBLE_NEWLINE__ 3. **Verificación:** Asegúrate de la corrección de la cantidad y tipo de tokens agregados. __DOUBLE_NEWLINE__ ### Seguridad __DOUBLE_NEWLINE__ 1. **Seguridad de la Billetera:** Eres el único responsable de la seguridad de tu billetera blockchain. __DOUBLE_NEWLINE__ 2. **Dependencia del Contrato Inteligente:** Reconoce que la adición de tokens depende de la seguridad y funcionalidad del contrato inteligente. __DOUBLE_NEWLINE__ ### Reconocimiento de Riesgos __DOUBLE_NEWLINE__ 1. **Volatilidad y Riesgo:** Reconoce los riesgos inherentes en las transacciones de criptomonedas, incluyendo la volatilidad del mercado y los riesgos tecnológicos. __DOUBLE_NEWLINE_BLOCK__ 2. **Sin Seguro:** Los tokens agregados a la Bóveda Comunitaria no están asegurados. En caso de pérdida, no hay recurso para la recuperación del valor. __DOUBLE_NEWLINE__ ### Cambios en los Términos __DOUBLE_NEWLINE__ 1. **Derechos de Modificación:** Estos Términos y Condiciones pueden modificarse periódicamente para reflejar cambios en los servicios, requisitos legales o avances tecnológicos. __DOUBLE_NEWLINE__ 2. **Uso Continuado:** El uso continuado de la función de adición de tokens después de los cambios indica la aceptación de los nuevos términos. __DOUBLE_NEWLINE__ ### Limitaciones de Responsabilidad __DOUBLE_NEWLINE__ 1. **Descargo de Responsabilidad:** No somos responsables de ninguna pérdida directa o indirecta incurrida debido a la volatilidad del mercado, fallos técnicos u otros factores fuera de nuestro control. __DOUBLE_NEWLINE__ 2. **Indemnización:** Acuerdas indemnizarnos y exonerarnos de cualquier reclamo o pérdida relacionada con el uso de la función de adición de tokens en la Bóveda Comunitaria. __DOUBLE_NEWLINE__ ### Contacto y Soporte __DOUBLE_NEWLINE__ - Para consultas o soporte, por favor comunícate a través de nuestros canales designados. __DOUBLE_NEWLINE__ ### Reconocimiento Final __DOUBLE_NEWLINE__ Al agregar tokens a la Bóveda Comunitaria, afirmas tu entendimiento y acuerdo con estos Términos y Condiciones, vigentes a partir del 24 de marzo de 2024.
fr: # Conditions d'ajout de jetons au Coffre Communautaire __DOUBLE_NEWLINE__ _Dernière mise à jour : 24 mars 2024_ __DOUBLE_NEWLINE__ ### Introduction __DOUBLE_NEWLINE__ **Bienvenue dans la fonctionnalité d'ajout de jetons au Coffre Communautaire.** Ce document décrit les Conditions Générales spécifiquement pour l'ajout de jetons au Coffre Communautaire via notre contrat intelligent. En utilisant cette fonctionnalité, vous acceptez de respecter ces conditions, garantissant ainsi un processus d'ajout de jetons transparent et responsable. __DOUBLE_NEWLINE__ ### Acceptation des Conditions __DOUBLE_NEWLINE__ 1. **Accord :** En ajoutant des jetons au Coffre Communautaire, vous acceptez ces Conditions Générales. __DOUBLE_NEWLINE__ 2. **Éligibilité :** Vous devez être majeur et capable de conclure des contrats juridiquement contraignants. En ajoutant des jetons, vous confirmez respecter cette exigence. __DOUBLE_NEWLINE__ ### Processus d'ajout de jetons __DOUBLE_NEWLINE__ 1. **Méthode de dépôt :** Les jetons sont ajoutés via un transfert direct au contrat intelligent. __DOUBLE_NEWJOIN__ 2. **Types de jetons :** Assurez-vous que les jetons que vous ajoutez sont compatibles avec le contrat intelligent. __DOUBLE_NEW_JOIN_COOL__ 3. **Responsabilité des jetons :** Une fois ajoutés, les jetons sont sous le contrôle du contrat intelligent, soumis à ses règles et opérations. __DOUBLE_NEWLINE__ ### Responsabilités de l'utilisateur __DOUBLE_NEWLINE__ 1. **Conformité :** Respectez toutes les lois et réglementations applicables dans votre juridiction relative aux transactions de cryptomonnaie. __DOUBLE_NEWLINE__ 2. **Conscience :** Comprenez les risques impliqués dans les transactions de jetons numériques, y compris la perte potentielle. __DOUBLE_NEWLINE__ 3. **Vérification :** Assurez-vous de la correction du montant et du type de jetons ajoutés. __DOUBLE_NEWLINE__ ### Sécurité __DOUBLE_NEWLINE__ 1. **Sécurité du portefeuille :** Vous êtes seul responsable de la sécurité de votre portefeuille blockchain. __DOUBLE_NEWLINE__ 2. **Dépendance au contrat intelligent :** Reconnaître que l'ajout de jetons dépend de la sécurité et de la fonctionnalité du contrat intelligent. __DOUBLE_NEWLINE__ ### Reconnaissance des risques __DOUBLE_NEWLINE__ 1. **Volatilité et risque :** Reconnaître les risques inhérents aux transactions de cryptomonnaie, y compris la volatilité du marché et les risques technologiques. __DOUBLE_NEWLINE__ 2. **Absence d'assurance :** Les jetons ajoutés au Coffre Communautaire ne sont pas assurés. En cas de perte, il n'existe aucun recours pour récupérer la valeur. __DOUBLE_NEWLINE__ ### Modifications des Conditions __DOUBLE_NEWLINE__ 1. **Droits de modification :** Ces Conditions Générales peuvent être modifiées périodiquement pour refléter les changements de services, les exigences légales ou les avancées technologiques. __DOUBLE_NEWLINE__ 2. **Utilisation continue :** L'utilisation continue de la fonctionnalité d'ajout de jetons après les changements indique l'acceptation des nouveaux termes. __DOUBLE_NEWLINE__ ### Limitations de responsabilité __DOUBLE_NEWLINE__ 1. **Avertissement :** Nous ne sommes pas responsables des pertes directes ou indirectes subies en raison de la volatilité du marché, de défaillances techniques ou d'autres facteurs indépendants de notre volonté. __DOUBLE_NEWLINE__ 2. **Indemnisation :** Vous acceptez d'indemniser et de dégager notre responsabilité contre toute réclamation ou perte liée à l'utilisation de la fonctionnalité d'ajout de jetons au Coffre Communautaire. __DOUBLE_NEWLINE__ ### Contact et support __DOUBLE_NEWLINE__ - Pour toute demande ou assistance, veuillez nous contacter via nos canaux désignés. __DOUBLE_NEWLINE__ ### Reconnaissance finale __DOUBLE_NEWLINE__ En ajoutant des jetons au Coffre Communautaire, vous affirmez votre compréhension et votre accord avec ces Conditions Générales, effectif à partir du 24 mars 2024.

# viewTokenTitle
source: View Token
es: Ver Token
fr: Voir le jeton

# withdrawBidText
source: Withdraw bid
es: Retirar oferta
fr: Retirer l'enchère

source: Decimal
fr: Décimal

source: Files aren't stored on the blockchain to avoid high costs and network congestion; they're externally hosted and referenced for efficient, decentralized access.
fr: Les fichiers ne sont pas stockés sur la blockchain pour éviter des coûts élevés et la congestion du réseau ; ils sont hébergés externement et référencés pour un accès efficace et décentralisé.

source: Tokens
fr: Jetons

source: Decimal (1-18)
fr: Décimal (1-18)

source: N/A
fr: S/O

# landingPage.paymentServiceDesc
source: Connect you wallet, Create an ID or QRcode and use it to receive payments.
fr: Connectez votre portefeuille, créez un ID ou un QRcode et utilisez-le pour recevoir des paiements.

# useCasesDocumentLockerTitle
source: Document Locker
fr: Verrou de Document
