Repository: etsraphael/ChainBrary
Catalog: UI/src/locale/messages.*.xlf
Languages: es, fr

source: This description is only visible for the owner of the document and the first buyer. Make sure your screen is not recorded.
es: Esta descripción solo es visible para el propietario del documento y el primer comprador. Asegúrate de que tu pantalla no esté siendo grabada.
fr: Cette description n'est visible que pour le propriétaire du document et le premier acheteur. Assurez-vous que votre écran n'est pas enregistré.

source: Network is not matching with wallet
es: La red no coincide con la billetera
fr: Le réseau ne correspond pas au portefeuille

source: <span class="text-primary">Know us better</span> Got questions? Reach us our social media
es: <span class="text-primary">Conócenos mejor</span> ¿Tienes preguntas? Contacta con nosotros en nuestras redes sociales.
fr: <span class="text-primary"> Apprenez à nous connaître</span> Vous avez des questions? Contactez-nous sur nos réseaux sociaux

source: Link generated
es: Enlace generado
fr: Lien généré

source: Product name is required
es: El nombre del producto es obligatorio
fr: Le nom du produit est requis

source: Protected Document
es: Documento protegido
fr: Document Protégé

source: Token Symbol
es: Símbolo del token
fr: Symbole du jeton

source: Payment Expired
es: Pago vencido
fr: Paiement Expiré

source: Searching token
es: Buscando token
fr: Recherche de jeton

source: Other Configs
es: Otras configuraciones
fr: Autres configurations

source: Bidding has ended without any participation.
es: La subasta ha terminado sin ninguna participación.
fr: L'enchère s'est terminée sans aucune participation.

source: Community Vaults
es: Bóvedas comunitarias
fr: Coffres de la Communauté

source: Duration (minutes)
es: Duración (minutos)
fr: Durée (minutes)

source: To submit a report, please email us at <a href="chainbrary@outlook.com">chainbrary@outlook.com</a>. Ensure your report is detailed and includes the necessary evidence for validation.
es: Para enviar un informe, por favor envíenos un correo electrónico a <a href="chainbrary@outlook.com">chainbrary@outlook.com</a>. Asegúrese de que su informe sea detallado e incluya la evidencia necesaria para su validación.
fr: Pour soumettre un rapport, veuillez nous envoyer un courriel à chainbrary@outlook.com. Assurez-vous que votre rapport est détaillé et comprend les preuves nécessaires pour validation. <x id="START_LINK" ctype="x-a" equiv-text="<a href="chainbrary@outlook.com">"/><x id="CLOSE_LINK" ctype="x-a" equiv-text="</a>"/>

source: Network
es: Red
fr: Réseau

source: Image found!
es: ¡Imagen encontrada!
fr: Image trouvée !

source: Create Token
es: Crear Token
fr: Créer un token

source: ChainBrary is a platform that aims to make blockchain technology more accessible to everyone by providing users with a library of open-source and secure tools for building and interacting with blockchain applications.
es: ChainBrary es una plataforma que tiene como objetivo hacer la tecnología blockchain más accesible para todos al proporcionar a los usuarios una biblioteca de herramientas de código abierto y seguras para construir e interactuar con aplicaciones blockchain.
fr: ChainBrary est une plateforme qui vise à rendre la technologie blockchain plus accessible à tous en fournissant aux utilisateurs une bibliothèque d'outils open-source et sécurisés pour construire et interagir avec des applications blockchain.

source: The current bid is at <strong>{INTERPOLATION} {{ currentNetwork.nativeCurrency.symbol }}{CLOSE_TAG_STRONG}
es: La oferta actual está en <strong>{INTERPOLATION} {{ currentNetwork.nativeCurrency.symbol }}{CLOSE_TAG_STRONG}
fr: L'enchère actuelle est à <strong> {INTERPOLATION} {{ currentNetwork.nativeCurrency.symbol }} {CLOSE_TAG_STRONG}

source: Value has to be greater than 0
es: El valor debe ser mayor que 0
fr: La valeur doit être supérieure à 0

source: The link is broken. Try again or choose a different QR.
es: El enlace está roto. Intenta de nuevo o elige un QR diferente.
fr: Le lien est cassé. Réessayez ou choisissez un autre QR.

source: Withdrawal Successful!
es: ¡Retiro Exitoso!
fr: Retrait Réussi !

source: Hide card
es: Ocultar tarjeta
fr: Masquer la carte

source: Lock in USD value (0.1% fee)
es: Asegura el valor en USD (tarifa del 0.1%)
fr: Verrouiller la valeur en USD (frais de 0,1%)

source: Withdrawal Fee (0.01%)
es: Tarifa de retiro (0.01%)
fr: Frais de retrait (0,01 %)

source: As the owner of this document, this is currently unlocked for you. You can see the full content of this by clicking here. Make sure your screen is not shared with anyone else. <span class="unlock-btn" (click)="unlockDocument.emit({ hasAccess: true })">Unlock here</span>
es: Como propietario de este documento, actualmente está desbloqueado para usted. Puede ver el contenido completo de este haciendo clic aquí. Asegúrese de que su pantalla no esté siendo compartida con nadie más. <span class="unlock-btn" (click)="unlockDocument.emit({ hasAccess: true })">Desbloquear aquí</span>
fr: En tant que propriétaire de ce document, celui-ci est actuellement déverrouillé pour vous. Vous pouvez voir le contenu complet de celui-ci en cliquant ici. Assurez-vous que votre écran n'est partagé avec personne d'autre. <span class="unlock-btn" (click)="unlockDocument.emit({ hasAccess: true })"> Déverrouiller ici</span>

source: Critical
es: Crítico
fr: Critique

source: Price has to be greater than 0
es: El precio debe ser mayor que 0
fr: Le prix doit être supérieur à 0

source: Enter your wallet address to receive funds
es: Ingrese su dirección de billetera para recibir fondos
fr: Entrez votre adresse de portefeuille pour recevoir des fonds

source: Owner address
es: Dirección del propietario
fr: Adresse du propriétaire

source: New owner
es: Nuevo propietario
fr: Nouveau propriétaire

source: Reward Tiers
es: Niveles de recompensa
fr: Niveaux de Récompense

source: Contract address
es: Dirección del contrato
fr: Adresse du contrat

source: Amount to Receive
es: Cantidad a recibir
fr: Montant à recevoir

source: <strong>Receiving Amount</strong>
es: <strong>Cantidad recibida</strong>
fr: <strong> Montant à recevoir</strong>

source: Link an avatar (Optional)
es: Vincular un avatar (Opcional)
fr: Liez un avatar (Facultatif)

source: Bid name is required
es: Se requiere nombre de oferta
fr: Le nom de l'enchère est requis

source: My amount staked
es: Mi cantidad apostada
fr: Ma quantité mise en jeu

source: You must accept the terms and conditions
es: Debe aceptar los términos y condiciones
fr: Vous devez accepter les conditions générales

source: Attention: This is a preview of your request. Avoid the mistake of self-payment.
es: Atención: Esta es una vista previa de su solicitud. Evite el error de auto-pago.
fr: Attention: Ceci est un aperçu de votre demande. Évitez l'erreur de l'auto-paiement.

source: Symbol is required
es: Se requiere un símbolo
fr: Le symbole est requis

source: Protocol Fee (0.1%)
es: Tarifa de Protocolo (0.1%)
fr: Frais de protocole (0,1%)

source: Explore solutions
es: Explorar soluciones
fr: Explorez les solutions

source: Description is required
es: Se requiere descripción
fr: La description est requise

source: An extra of 10 minutes will be added to the auction if a bid is placed within the last 10 minutes of the auction.
es: Se añadirán 10 minutos adicionales a la subasta si se realiza una oferta en los últimos 10 minutos de la subasta.
fr: Un supplément de 10 minutes sera ajouté à l'enchère si une offre est placée dans les 10 dernières minutes de l'enchère.

source: Loading
es: Cargando
fr: Chargement

source: Document unlocked
es: Documento desbloqueado
fr: Document déverrouillé

source: Chainbrary is dedicated to maintaining the highest security standards and protecting our community. We value your contributions and strive to make our platform safe for all users.
es: Chainbrary se dedica a mantener los estándares de seguridad más altos y a proteger a nuestra comunidad. Valoramos tus contribuciones y nos esforzamos por hacer nuestra plataforma segura para todos los usuarios.
fr: Chainbrary se consacre à maintenir les normes de sécurité les plus élevées et à protéger notre communauté. Nous apprécions vos contributions et nous nous efforçons de rendre notre plateforme sûre pour tous les utilisateurs.

source: Scan Again
es: Volver a escanear
fr: Scanner à nouveau

source: Add Tokens
es: Agregar Tokens
fr: Ajouter des jetons

source: Amount in token
es: Cantidad en token
fr: Montant en jeton

source: Wallet Address
es: Dirección de la Cartera
fr: Adresse du Portefeuille

source: Duration is required
es: Se requiere duración
fr: La durée est requise

source: Description
es: Descripción

source: You are about to withdraw your bid. Please review the details below carefully. Note that a withdrawal fee will be deducted from the total amount. This action cannot be undone.
es: Está a punto de retirar su oferta. Por favor, revise detenidamente los detalles a continuación. Tenga en cuenta que se deducirá una tarifa de retiro del monto total. Esta acción no se puede deshacer.
fr: Vous êtes sur le point de retirer votre enchère. Veuillez examiner attentivement les détails ci-dessous. Notez qu'une commission de retrait sera déduite du montant total. Cette action est irréversible.

source: Accept <a (click)="openTermAndCond($event)" class="terms-link">terms and conditions</a>. 0.1% of community fee will be deducted from the final transaction.
es: Acepta <a (click)="openTermAndCond($event)" class="terms-link">terms and conditions</a>. Se deducirá el 0.1% de la tarifa comunitaria del la transacción final.
fr: Accepter les <a (click)="openTermAndCond($event)" class="terms-link"> conditions générales</a> . 0,1% de frais communautaires seront déduits de la transaction finale.

source: The bid you are seeking cannot be found on this network. Please verify that you have entered the correct address and are on the appropriate network. Please check the URL or go back to the <a routerLink="/use-cases/search">search</a> page.
es: La oferta que está buscandando no se puede encontrar en esta red. Por favor, verifique que ha ingresado la dirección correcta y que está en la red adecuada. Verifique la URL o regrese a la página de <a routerLink="/use-cases/search">búsqueda</a>.
fr: L'offre que vous recherchez ne peut pas être trouvée sur ce réseau. Veuillez vérifier que vous avez entré la bonne adresse et que vous êtes sur le réseau approprié. Veuillez vérifier l'URL ou revenir à la page de <a routerLink="/use-cases/search"> recherche</a> .

source: Scope of the Program
es: Ámbito del Programa
fr: Portée du Programme

source: Select Network
es: Seleccionar red
fr: Sélectionner le réseau

source: The image is loading.
es: La imagen está cargando.
fr: L'image est en cours de chargement.

source: Pay Now
es: Pagar ahora
fr: Payer Maintenant

source: Enter Amount
es: Ingrese monto
fr: Entrer le montant

source: Amount:
es: Cantidad:
fr: Montant:

source: {{ vault.data?.network?.networkDetail?.name }} network
es: {{ vault.data?.network?.networkDetail?.name }} red
fr: Réseau de {{ vault.data?.network?.networkDetail?.name }}

source: Searching document locked
es: Buscando documento bloqueado
fr: Recherche de document verrouillé

source: Next
es: Siguiente
fr: Suivant

source: Loading...
es: Cargando...
fr: Chargement...

source: Payment is processing and may take a few minutes. Once confirmed from your wallet, refresh to unlock the document. If there are any issues, the transaction will be reverted.
es: El pago está procesando y puede tardar unos minutos. Una vez confirmado desde tu billetera, actualiza para desbloquear el documento. Si hay algún problema, la transacción será revertida.
fr: Le paiement est en cours de traitement et peut prendre quelques minutes. Une fois confirmé depuis votre portefeuille, actualisez pour déverrouiller le document. Si des problèmes surviennent, la transaction sera annulée.

source: Business Name
es: Nombre del negocio
fr: Nom de l'Entreprise

source: Date
es: Fecha

source: Add To Vault
es: Añadir al Depósito
fr: Ajouter Au Coffre-fort

source: Show QR Code
es: Mostrar código QR
fr: Afficher le Code QR

source: Connect wallet to see Vault balance
es: Conectar cartera para ver el saldo de la bóveda
fr: Connectez le portefeuille pour voir le solde du coffre-fort

source: Network is required
es: Se requiere red
fr: Le réseau est requis

source: Contract address is required
es: Se requiere la dirección del contrato.
fr: L'adresse du contrat est requise.

source: @@CommonErrorMessage.NetworkMismatch:Network mismatch with wallet
es: @@CommonErrorMessage.NetworkMismatch:Incompatibilidad de red con la billetera
fr: @@CommonErrorMessage.NetworkMismatch:Décalage de réseau avec le portefeuille

source: Explorer
es: Explorador
fr: Explorateur

source: Transaction ID: <strong>ss }}<b<a [hr Amount Withdrawn: <strong>{INTERPOLATION_1} {{ currentNetwork.nativeCurrency.symbol }}<b<a [hr<a [href]="explorerLink$ | async" target="_blank" class="btn btn-primary mt-3">View on Etherscan</a>
es: ID de transacción: <strong>ss }}<b<a [hr Monto Retirado: <strong>{INTERPOLATION_1} {{ currentNetwork.nativeCurrency.symbol }}<b<a [hr<a [href]="explorerLink$ | async" target="_blank" class="btn btn-primary mt-3">Ver en Etherscan</a>
fr: ID de transaction : <strong> ss }} <b <a [hr Montant retiré : <strong> {INTERPOLATION_1} {{ currentNetwork.nativeCurrency.symbol }} <b <a [hr <a [href]="explorerLink$ | async" target="_blank" class="btn btn-primary mt-3"> Voir sur Etherscan</a>

source: To retrieve the current conversion rate, ensure the appropriate network is selected in your wallet
es: Para obtener la tasa de conversión actual, asegúrate de que la red adecuada esté seleccionada en tu billetera.
fr: Pour récupérer le taux de conversion actuel, assurez-vous que le réseau approprié est sélectionné dans votre portefeuille

source: Max Supply
es: Suministro máx
fr: Offre max

source: Sorry for the inconvenience.
es: Lamentamos las molestias.
fr: Désolé pour le dérangement.

source: Address invalid
es: Dirección inválida
fr: Adresse invalide

source: Creating your bid... Please confirm the request on your wallet.
es: Creando tu oferta... Por favor confirma la solicitud en tu billetera.
fr: Création de votre enchère... Veuillez confirmer la demande sur votre portefeuille.

source: Recipient is required
es: Se requiere al destinatario.
fr: Le destinataire est requis

source: Owner name is required
es: Se requiere el nombre del propietario
fr: Le nom du propriétaire est requis

source: You've reached ChainBrary's secure payment portal. Fast, secure, and reliable cryptocurrency transactions start here. Verify, confirm, and go!
es: Has llegado al portal de pagos seguro de ChainBrary. Transacciones de criptomonedas rápidas, seguras y confiables comienzan aquí. ¡Verifica, confirma y adelante!
fr: Vous avez atteint le portail de paiement sécurisé de ChainBrary. Les transactions de cryptomonnaie rapides, sécurisées et fiables commencent ici. Vérifiez, confirmez et allez-y!

source: Previous
es: Anterior
fr: Précédent

source: Name required
es: Se requiere nombre
fr: Nom requis

source: Our reward system is categorized based on the severity of the vulnerability discovered:
es: Nuestro sistema de recompensas está categorizado según la gravedad de la vulnerabilidad descubierta:
fr: Notre système de récompense est catégorisé en fonction de la gravité de la vulnérabilité découverte :

source: Join the Chainbrary Team Today!
es: ¡Únete al equipo de Chainbrary hoy!
fr: Rejoignez l'équipe Chainbrary aujourd'hui !

source: A connected wallet is required for conversion rates.
es: Se requiere una billetera conectada para las tasas de conversión.
fr: Un portefeuille connecté est requis pour les taux de conversion.

source: Our Commitment
es: Nuestro Compromiso
fr: Notre Engagement

source: Search
es: Búsqueda
fr: Rechercher

source: Total value locked
es: Valor total bloqueado
fr: Valeur totale verrouillée

source: Document created by
es: Documento creado por
fr: Document créé par

source: Coming soon..
es: Próximamente...
fr: Bientôt disponible..

source: Remove image
es: Eliminar imagen
fr: Supprimer l'image

source: No bids have been placed yet. Be the first!
es: Aún no se han realizado ofertas. ¡Sé el primero!
fr: Aucune offre n'a encore été placée. Soyez le premier !

source: (Login)
es: (Iniciar sesión)
fr: (Connexion)

source: Description
es: Descripción

source: Eligibility Criteria
es: Criterios de Elegibilidad
fr: Critères d'Éligibilité

source: Reward Amount
es: Cantidad de recompensa
fr: Montant de la Récompense

source: Developer Playground: Enter the Matrix of Code!
es: Zona de Desarrollo: ¡Entra en la Matriz del Código!
fr: Aire de Jeux du Développeur: Entrez dans la Matrice du Code !

source: Network is not matching with wallet
es: La red no coincide con la billetera
fr: Le réseau ne correspond pas au portefeuille

source: How can I quickly host my file somewhere?
es: ¿Cómo puedo alojar rápidamente mi archivo en algún lugar?
fr: Comment puis-je rapidement héberger mon fichier quelque part ?

source: The detailed description of this document remains securely locked. Full access to this content will be granted upon completion of the contract payment, ensuring exclusive access for authorized parties.
es: La descripción detallada de este documento permanece seguramente bloqueada. El acceso completo a este contenido se otorgará al completar el pago del contrato, asegurando acceso exclusivo para las partes autorizadas.
fr: La description détaillée de ce document reste sécurisée et verrouillée. L'accès complet à ce contenu sera accordé à la fin du paiement du contrat, garantissant un accès exclusif aux parties autorisées.

source: Owner name
es: Nombre del propietario
fr: Nom du propriétaire

source: Review & Confirm
es: Revisar & Confirmar
fr: Vérifier & Confirmer

source: Creating your bid... Please confirm the request on your wallet. This could take 5 minutes, please stay on this page.
es: Creando tu oferta... Por favor, confirma la solicitud en tu billetera. Esto podría tardar 5 minutos, por favor permanece en esta página.
fr: Création de votre offre... Veuillez confirmer la demande sur votre portefeuille. Cela pourrait prendre 5 minutes, veuillez rester sur cette page.

source: Burning account
es: Cuenta de quema
fr: Compte de gravure

source: Join our platform and get support for your projects with Chainbrary's amazing blockchain services.
es: Únete a nuestra plataforma y recibe apoyo para tus proyectos con los increíbles servicios de blockchain de Chainbrary's.
fr: Rejoignez notre plateforme et obtenez du soutien pour vos projets avec les incroyables services blockchain de Chainbrary.

source: Network is required
es: Se requiere red
fr: Le réseau est requis

source: This program is specifically designed for our websites and applications. We prioritize the detection and prevention of incidents that may lead to: - Direct unauthorized access to or draining of locked user funds. - Social engineering attacks that could result in users inadvertently authorizing transactions or being redirected to malicious sites.
es: Este programa está específicamente diseñado para nuestros sitios web y aplicaciones. Priorizamos la detección y prevención de incidentes que podrían llevar a: - Acceso no autorizado directo o extracción de fondos bloqueados de usuarios. - Ataques de ingeniería social que podrían resultar en que los usuarios autoricen transacciones inadvertidamente o sean redirigidos a sitios maliciosos.
fr: Ce programme est spécifiquement conçu pour nos sites Web et applications. Nous priorisons la détection et la prévention des incidents qui pourraient conduire à : - Un accès non autorisé direct ou à un épuisement des fonds d'utilisateurs verrouillés. - Des attaques d'ingénierie sociale qui pourraient amener les utilisateurs à autoriser involontairement des transactions ou à être redirigés vers des sites malveillants.

source: Copyright © 2023 All Rights Reserved
es: Derechos de autor © 2023 Todos los derechos reservados
fr: Droit d'auteur © 2023 Tous droits réservés

source: New owner is required
es: Se requiere un nuevo propietario
fr: Un nouveau propriétaire est requis

source: Wrong network found in the wallet. Please switch to the right network.
es: Se encontró una red incorrecta en la billetera. Por favor, cambie a la red correcta.
fr: Réseau incorrect trouvé dans le portefeuille. Veuillez passer au bon réseau.

source: Powered by <a [routerLink]="['/']">ChainBrary</a>
es: Impulsado por <a [routerLink]="['/']">ChainBrary</a>
fr: Propulsé par <a [routerLink]="['/']"> ChainBrary</a>

source: Document name
es: Nombre del documento
fr: Nom du document

source: Receiver Name
es: Nombre del receptor
fr: Nom du destinataire

source: Total Supply
es: Suministro Total
fr: Offre Totale

source: Product name
es: Nombre del producto
fr: Nom du produit

source: How to show a picture on the blockchain?
es: ¿Cómo mostrar una imagen en la blockchain?
fr: Comment afficher une image sur la blockchain ?

source: We Offer
es: Ofrecemos
fr: Nous Offrons

source: Medium
es: Medio
fr: Moyen

source: Severity Level
es: Nivel de gravedad
fr: Niveau de Gravité

source: Network reward
es: Recompensa de red
fr: Récompense du réseau

source: <span class="text-primary">Trust, Secure, Safe</span><br /> Committing to Reliability.
es: <span class="text-primary">Confianza, Seguridad, Protección</span><br /> Comprometidos con la Fiabilidad.
fr: <span class="text-primary">Confiance, Sécurité, </span><br />Engagement envers la Fiabilité.

source: Document name is required
es: Se requiere el nombre del documento
fr: Le nom du document est requis

source: Payment Request
es: Solicitud de pago
fr: Demande de Paiement

source: Price is required
es: Se requiere el precio
fr: Le prix est requis

source: Join Our Community
es: Únete a nuestra comunidad
fr: Rejoignez Notre Communauté

source: Network share
es: Cuota de red
fr: Part de réseau

source: This document is securely locked and stored using advanced blockchain technology, ensuring unmatched security and integrity. Access to its content is exclusively reserved for the document's owner and the initial purchaser, reflecting a new standard in document privacy and ownership.
es: Este documento está bloqueado y almacenado de forma segura utilizando tecnología blockchain avanzada, asegurando una seguridad e integridad incomparables. El acceso a su contenido está exclusivamente reservado para el propietario del documento y el comprador inicial, reflejando un nuevo estándar en privacidad y propiedad de documentos.
fr: Ce document est verrouillé de manière sécurisée et stocké en utilisant une technologie blockchain avancée, garantissant une sécurité et une intégrité inégalées. L'accès à son contenu est exclusivement réservé au propriétaire du document et à l'acheteur initial, reflétant une nouvelle norme en matière de confidentialité et de propriété des documents.

source: This action cannot be undone. Are you sure you want to renounce ownership?
es: Esta acción no se puede deshacer. ¿Estás seguro de que quieres renunciar a la propiedad?
fr: Cette action ne peut pas être annulée. Êtes-vous sûr de vouloir renoncer à la propriété ?

source: Creating your token... Stay on this page or refresh it later when the blockchain will validate your transaction
es: Creando tu token... Permanece en esta página o actualízala más tarde cuando la blockchain valide tu transacción.
fr: Création de votre jeton... Restez sur cette page ou rafraîchissez-la plus tard lorsque la blockchain aura validé votre transaction.
