Repository: etsraphael/ChainBrary
Catalog: UI/src/locale/messages.*.xlf
Languages: es, fr

# recentTransactions.Desc
source: Quickly view your recent transactions on your wallet. This is working only for the native tokens of the network currently.
es: Visualiza rápidamente tus transacciones recientes en tu billetera. Esto funciona únicamente para los tokens nativos de la red actualmente.
fr: Visualisez rapidement vos transactions récentes sur votre portefeuille. Ceci ne fonctionne actuellement que pour les jetons natifs du réseau.

# recentTransactions.Title
source: Recent Transactions
es: Transacciones Recientes
fr: Transactions Récentes

# ResponseMessage.AnUnexpectedErrorOccurred
source: An unexpected error occurred
es: Ocurrió un error inesperado
fr: Une erreur inattendue s'est produite

# ResponseMessage.ErrorApprovingToken
source: Error approving token
es: Error al aprobar el token
fr: Erreur d'approbation de jeton

# ResponseMessage.ErrorDecodingPaymentRequest
source: Error decoding payment request
es: Error al decodificar la solicitud de pago
fr: Erreur lors du décodage de la demande de paiement

# ResponseMessage.ErrorRetreivingDataFromTheBlockchain
source: Error retreiving data from the blockchain
es: Error al recuperar datos de la blockchain
fr: Erreur lors de la récupération des données de la blockchain

# ResponseMessage.NetworkIsUpdated
source: Network is updated
es: La red está actualizada
fr: Le réseau est mis à jour

# ResponseMessage.TokenAddressNotFound
source: Token address not found!
es: ¡Dirección de token no encontrada!
fr: Adresse du jeton introuvable !

# ResponseMessage.TransactionIsProcessing
source: Transaction is processing
es: La transacción está procesando
fr: La transaction est en cours de traitement

# scanManageTokenDescription
source: Manage your token by minting, burning, transferring and more.
es: Administra tu token minteando, quemando, transfiriendo y más.
fr: Gérez votre jeton en le frappant, en le brûlant, en le transférant et plus encore.

# scanManageTokenTitle
source: Manage Token
es: Administrar Token
fr: Gérer le jeton

# scanQRToPayDescription
source: Scan QR code at the vendors and pay with crypto currency
es: Escanea el código QR en los vendedores y paga con criptomoneda
fr: Scannez le code QR chez les vendeurs et payez avec de la crypto-monnaie

# scanQRToPayTitle
source: Scan QR to Pay
es: Escanear QR para Pagar
fr: Scannez le QR pour payer

# servicePage.anonymousVoteServiceDesc
source: Create a vote and share it with your friends to vote anonymously
es: Crea una votación y compártela con tus amigos para votar de forma anónima
fr: Créez un vote et partagez-le avec vos amis pour voter anonymement

# servicePage.anonymousVoteServiceTitle
source: Anonymous Vote
es: Voto Anónimo
fr: Vote Anonyme

# servicePage.networkBridgeServiceDesc
source: Connect two different networks and transfer tokens between them.
es: Conecta dos redes diferentes y transfiere tokens entre ellas.
fr: Connectez deux réseaux différents et transférez des tokens entre eux.

# servicePage.networkBridgeServiceTitle
source: Network Bridge
es: Puente de red
fr: Pont Réseau

# servicePage.payTogetherServiceDesc
source: Create a payment link and share it with your friends to pay together.
es: Crea un enlace de pago y compártelo con tus amigos para pagar juntos.
fr: Créez un lien de paiement et partagez-le avec vos amis pour payer ensemble.

# servicePage.payTogetherServiceTitle
source: Pay Together
es: Pagar Juntos
fr: Payer Ensemble

# servicePage.tokenSetupServiceDesc
source: Create and manage your token, then share it with your friends to use as a currency.
es: Crea y administra tu token, luego compártelo con tus amigos para usarlo como moneda.
fr: Créez et gérez votre jeton, puis partagez-le avec vos amis pour l'utiliser comme monnaie.

# servicePage.tokenSetupServiceTitle
source: Token Setup
es: Configuración de Token
fr: Configuration du jeton

# servicePage.tokenSwapServiceDesc
source: Swap tokens for another token on the same network.
es: Intercambia tokens por otro token en la misma red.
fr: Échangez des tokens entre eux dans le même réseau.

# servicePage.tokenSwapServiceTitle
source: Token Swap
es: Intercambio de Tokens
fr: Échange de Tokens
