Repository: etsraphael/ChainBrary
Catalog: UI/src/locale/messages.*.xlf
Languages: es, fr

# privacyAndPolicy.File
source: # Chainbrary Privacy Policy _Last Updated: 21st Feb 2024_ ### Introduction **Welcome to Chainbrary**. As a pioneering decentralized autonomous organization (DAO), we are deeply committed to upholding the privacy and security of our community. In the evolving landscape of blockchain technology, the sanctity of personal data has never been more paramount. This Privacy Policy serves as a testament to our dedication, outlining our practices and principles in handling and protecting the information collected through our operations and website. Chainbrary stands at the forefront of integrating blockchain technology within a framework that respects and preserves user privacy. As a DAO, we operate with a unique governance structure, one that is decentralized and controlled by our community members. This structure not only empowers our users but also shapes our approach to data management and privacy. In this document, we aim to transparently convey our methods of data collection, usage, and protection. We understand the importance of your privacy and are committed to maintaining the trust you place in us as you navigate through the realms of blockchain technology. ### Expanded Information Collection Section Chainbrary's Approach to Information Collection. In alignment with our core principle of minimal data collection, our platform is designed to gather only the essential data required for effective operation and user experience. This approach is reflective of our commitment to privacy and transparency. Below, we detail the categories of information we collect: 1. **Blockchain-Based Data:** Our operations are deeply rooted in blockchain technology. As such, the primary data we collect revolves around blockchain transactions. This includes public transaction IDs, wallet addresses, and smart contract interactions. It's crucial to understand that this information is inherently public due to the nature of blockchain technology and is not confidential. 2. **Aggregate Usage Data:** For the purpose of enhancing our platform, we utilize web analytics tools. These tools provide us with aggregate data concerning site usage and visitor behavior. Such data includes page views, session duration, and general traffic patterns. Importantly, this information is collected in aggregate form and does not allow us to identify individual users. 3. **Voluntary User-Provided Data:** In certain scenarios, users may choose to provide us with additional information. This could include feedback through community channels, participation in surveys, or other forms of direct communication with Chainbrary. This information is provided voluntarily and is used to further improve our services. Our commitment to minimal data collection is not just a policy but a reflection of our respect for your privacy. We ensure that any information collected is treated with the utmost care and is used solely for the stated purposes. ### Revised Data Storage and Security Section Ensuring Data Integrity and Security in the Blockchain Framework. At Chainbrary, our commitment to data security is seamlessly integrated with our blockchain-based operations. Understanding the unique characteristics of blockchain technology guides our approach to data storage and security. 1. **Exclusive Blockchain Data Storage:** - **All Data on Blockchain:** Chainbrary exclusively uses blockchain technology for all data storage. This means every piece of data, including transactional records, wallet addresses, and any other user-related information, is stored on the blockchain. - **No Off-Chain Data Storage:** We do not store any user data off-chain. This approach aligns with our commitment to transparency and security inherent in blockchain technology, ensuring that all user-related information is maintained in a decentralized and secure environment. 2. **Blockchain Security Measures:** - **Inherent Security of Blockchain:** The decentralized nature of blockchain provides a high level of security. The data on the blockchain is encrypted and distributed across multiple nodes, making it resilient to cyber-attacks and unauthorized access. - **User-Controlled Privacy:** Users have control over their data on the blockchain. While the data is publicly visible, users maintain control over their private keys, which are essential for any transaction or access to their information on the blockchain. 3. **Public Nature of Blockchain Data:** - **Transparency and Visibility:** It's important for users to understand that data stored on the blockchain is publicly visible. This includes transaction histories and wallet addresses. Anonymity and Identification: While blockchain data does not directly disclose personal identities, the public nature of the data means that users should be mindful of their privacy and the information they choose to transact on the blockchain. - **Adapting to the Blockchain Paradigm.** Our approach to data storage and security is continuously evolving with the advancements in blockchain technology. We recognize the importance of staying at the forefront of security practices in the blockchain domain and are committed to adapting our strategies to ensure the highest level of data integrity and security for our users. **Adapting to the Blockchain Paradigm**. Our approach to data storage and security is continuously evolving with the advancements in blockchain technology. We recognize the importance of staying at the forefront of security practices in the blockchain domain and are committed to adapting our strategies to ensure the highest level of data integrity and security for our users. ### Communication Policy Enhancement Section **Fostering Open and Transparent Communication.** At Chainbrary, we believe in maintaining a transparent and open line of communication with our community. Our communication policy is designed to reflect our values of transparency and user empowerment within the blockchain space. 1. **Community-Driven Communication:** - **Initiation by Community:** Our communication with the community is primarily initiated by the community members themselves. This approach is consistent with our decentralized ethos, where the community plays a pivotal role. - **Platforms for Engagement:** We engage with our community through various social media channels and group discussions. These platforms are chosen for their accessibility and effectiveness in facilitating open dialogue. 2. **No Unsolicited Contact:** - **Respecting User Preferences:** Chainbrary adheres to a strict policy of not engaging in unsolicited contact. We do not send emails or direct messages unless responding to user-initiated inquiries or providing important updates as part of our service. - **User Consent:** Any direct communication from Chainbrary is based on explicit consent from the users. We ensure that our users have complete control over the type and frequency of communication they receive from us. 3. **Transparency in Communication:** - **Clear and Honest Information:** All communication from Chainbrary is designed to be clear, honest, and straightforward. We avoid technical jargon where possible and aim to provide information that is easily understandable. - **Feedback and Response:** We encourage and value feedback from our community. Our channels are always open for suggestions, concerns, and questions, with a commitment to responding in a timely and respectful manner. **Commitment to Effective Communication.** Our communication policy is a reflection of our dedication to building a strong, informed, and engaged community. We understand the importance of effective communication in the decentralized world and are committed to upholding these standards in all our interactions with our users. ### Age Restriction and Compliance Section **Promoting Responsible Use and Regulatory Adherence.** Chainbrary is committed to the responsible use of blockchain technology and adheres strictly to regulatory compliance. Our age restriction policy and compliance measures are fundamental aspects of this commitment. 1. **Age Restriction Policy:** - **Minimum Age Requirement:** Chainbrary's services are available exclusively to individuals who are 21 years of age or older. This age restriction is in place to ensure responsible usage of our services and compliance with legal standards. - **Verification Process:** We employ necessary measures to verify the age of our users. Users are required to confirm their age during the registration process, ensuring that minors do not access our services. 2. **Compliance with Regulatory Standards:** - **Global Standards Adherence:** Chainbrary complies with international and local laws and regulations related to blockchain technology and online platforms. This includes data protection laws, financial regulations, and any other relevant legal requirements. - **Regular Compliance Review:** We conduct regular reviews of our policies and operations to ensure ongoing compliance with legal standards. This proactive approach allows us to adapt to evolving regulatory landscapes. 3. **User Responsibility:** - **Awareness and Adherence:** Users are expected to be aware of and adhere to the age restriction policy. It is the responsibility of each user to ensure they meet the age requirement for using our services. - **Legal and Ethical Use:** Users are also responsible for ensuring that their use of Chainbrary's services is legal and ethical, in accordance with the laws of their respective jurisdictions. **Our Dedication to Responsible and Compliant Operations.** Chainbrary takes its responsibility towards legal compliance and ethical operations seriously. Our age restriction policy and adherence to regulatory standards are not just legal obligations but also reflect our commitment to fostering a safe, responsible, and compliant online environment. ### Revised Policy Updates and Revision Notifications Section **Adapting to the Evolving Blockchain Landscape.** Chainbrary understands the dynamic nature of the blockchain industry and the importance of maintaining an up-to-date Privacy Policy that aligns with these changes. 1. **Procedure for Policy Updates:** - **Continuous Monitoring:** Our team consistently monitors and reviews the Privacy Policy to ensure its alignment with our current operations, evolving technologies, and legal frameworks. - **Criteria for Updates:** Changes to the policy may stem from new service offerings, legal and regulatory updates, user feedback, or technological advancements in the blockchain sector. - **Change Documentation:** All updates to the Privacy Policy will be clearly documented, providing transparency about the modifications and their rationales. 2. **Notification of Policy Changes:** - **Announcement on Public Channels:** In line with our digital-first approach, significant updates to the Privacy Policy will be announced on our public Discord channel. This method ensures all users have equal and immediate access to the latest information. - **Effective Date Clarification:** Each announcement will specify the effective date of the revised policy, allowing users to understand when the new terms will be in effect. - **Engagement and Consent:** While formal consent may not be sought for every update, we encourage active engagement from our users in reviewing and understanding the changes. User feedback on the updates is always welcomed. 3. **Encouraging Proactive User Participation:** - **Regular Review Recommendation:** We advocate for our users to regularly visit our Discord channel and review the Privacy Policy periodically to stay informed. - **Feedback Channels:** Users are encouraged to share their feedback and inquiries regarding the Privacy Policy directly through our Discord channel. This facilitates a dynamic and responsive dialogue between Chainbrary and its community. **Our Dedication to Transparency and User Empowerment.** Chainbrary's policy updates and notification procedures reflect our commitment to transparency and ensuring our users are well-informed. By utilizing our public Discord channel for announcements, we maintain open, accessible, and timely communication with our community. ### Contact and Queries Section **Open Channels for Communication and Support.** Chainbrary is dedicated to maintaining an environment where open communication and user support are paramount. We understand that queries, concerns, and feedback are integral to the continuous improvement of our platform and community relations. 1. **Primary Contact Method:** - **Community Channels:** For any questions, concerns, or feedback regarding our privacy practices or any aspect of our services, users are encouraged to reach out through our community channels, primarily on Discord. This platform allows for real-time interaction and ensures prompt attention from our team. 2. **Support and Response:** - **Dedicated Support Team:** Our support team is actively present on Discord to address user inquiries. We strive to provide timely and helpful responses to all questions, ensuring that users feel heard and supported. - **Community Engagement:** We also foster an environment where community members can assist each other, leveraging the collective knowledge and experiences of our user base. 3. **Feedback and Suggestions:** - **Open to User Input:** Chainbrary values the input and suggestions from our community. Users are encouraged to share their ideas and feedback, which play a crucial role in shaping our policies and platform developments. - **Transparent Consideration Process:** All user feedback is carefully considered by our team. While we may not be able to implement every suggestion, we ensure that each idea is given due consideration and response. 4. **Issues and Concerns:** - **Resolution Process:** For issues or concerns, especially those related to privacy or data usage, users can reach out directly on our Discord channel. We have protocols in place to escalate and address such matters with the seriousness and discretion they deserve. - **Continuous Improvement:** User-reported issues are not only addressed but also analyzed for potential improvements in our policies and practices. **Your Voice Matters.** At Chainbrary, we believe in the power of community-driven growth and improvement. Our channels are always open for your voices, ensuring that your experience with Chainbrary is not only secure and private but also collaborative and responsive. ### Final Summary and Effective Date **Chainbrary Privacy Policy: A Commitment to Our Community.** This Privacy Policy represents Chainbrary's unwavering commitment to the privacy and security of our community members. As a decentralized autonomous organization leveraging blockchain technology, we recognize the critical importance of handling and protecting user data with the utmost care and transparency. **Key Highlights of Our Policy:** - **Minimal Data Collection:** Our operations are guided by the principle of minimal data collection, ensuring only necessary data is collected for the functioning and improvement of our services. - **Blockchain-Based Data Storage:** All user data is stored on the blockchain, emphasizing security, transparency, and integrity. - **Open and Transparent Communication:** Our communication with the community is driven by user engagement and transparency, primarily facilitated through our public channel on Discord. - **Age Restriction and Compliance:** We enforce a strict age restriction policy, allowing only individuals aged 21 or older to use our services, ensuring responsible use and adherence to legal standards. - **Responsive to Community Input:** We value and encourage user feedback, which is integral to the evolution of our policies and services. **Effective Date:** This Privacy Policy is effective as of 21st February 2024. We encourage our users to review this policy periodically to stay informed about how we protect their information and to understand their rights and responsibilities as valued members of Chainbrary. **Our Promise to You:** Chainbrary is dedicated to maintaining a secure, private, and user-centric platform. We pledge to continuously evolve and adapt our practices in line with technological advancements and community needs. Your trust in us is paramount, and we are committed to honoring that trust through our actions and policies.
es: # Política de Privacidad de Chainbrary _Última actualización: 21 de febrero de 2024_ ### Introducción **Bienvenido a Chainbrary**. Como una organización autónoma descentralizada (DAO) pionera, estamos profundamente comprometidos con la protección de la privacidad y la seguridad de nuestra comunidad. En el panorama evolutivo de la tecnología blockchain, la integridad de los datos personales nunca ha sido más importante. Esta Política de Privacidad sirve como testimonio de nuestra dedicación, delineando nuestras prácticas y principios en el manejo y protección de la información recopilada a través de nuestras operaciones y sitio web. Chainbrary está a la vanguardia de la integración de la tecnología blockchain dentro de un marco que respeta y preserva la privacidad del usuario. Como DAO, operamos con una estructura de gobierno única, descentralizada y controlada por los miembros de nuestra comunidad. Esta estructura no solo empodera a nuestros usuarios, sino que también moldea nuestro enfoque hacia la gestión de datos y la privacidad. En este documento, pretendemos transmitir de manera transparente nuestros métodos de recolección, uso y protección de datos. Entendemos la importancia de su privacidad y estamos comprometidos a mantener la confianza que deposita en nosotros mientras navega por los dominios de la tecnología blockchain. ### Sección Ampliada de Recolección de Información Enfoque de Chainbrary en la Recolección de Información. En consonancia con nuestro principio fundamental de recolección mínima de datos, nuestra plataforma está diseñada para recopilar solo los datos esenciales necesarios para una operación efectiva y una experiencia del usuario. Este enfoque refleja nuestro compromiso con la privacidad y la transparencia. A continuación, detallamos las categorías de información que recopilamos: 1. **Datos Basados en Blockchain:** Nuestras operaciones están profundamente arraigadas en la tecnología blockchain. Como tal, los datos primarios que recopilamos giran en torno a las transacciones blockchain. Esto incluye IDs de transacciones públicas, direcciones de billeteras e interacciones con contratos inteligentes. Es crucial entender que esta información es inherentemente pública debido a la naturaleza de la tecnología blockchain y no es confidencial. 2. **Datos de Uso Agregado:** Con el propósito de mejorar nuestra plataforma, utilizamos herramientas de análisis web. Estas herramientas nos proporcionan datos agregados sobre el uso del sitio y el comportamiento de los visitantes. Estos datos incluyen vistas de páginas, duración de las sesiones y patrones generales de tráfico. Es importante destacar que esta información se recopila en forma agregada y no nos permite identificar a usuarios individuales. 3. **Datos Proporcionados Voluntariamente por el Usuario:** En ciertos escenarios, los usuarios pueden elegir proporcionarnos información adicional. Esto podría incluir comentarios a través de canales comunitarios, participación en encuestas u otras formas de comunicación directa con Chainbrary. Esta información se proporciona voluntariamente y se utiliza para mejorar aún más nuestros servicios. Nuestro compromiso con la recolección mínima de datos no es solo una política, sino un reflejo de nuestro respeto por su privacidad. Aseguramos que cualquier información recopilada sea tratada con el máximo cuidado y se utilice únicamente para los fines declarados. ### Sección Revisada de Almacenamiento de Datos y Seguridad Asegurando la Integridad y Seguridad de los Datos en el Marco de Blockchain. En Chainbrary, nuestro compromiso con la seguridad de datos está integrado de manera fluida con nuestras operaciones basadas en blockchain. Comprender las características únicas de la tecnología blockchain guía nuestro enfoque hacia el almacenamiento y la seguridad de los datos. 1. **Almacenamiento Exclusivo de Datos en Blockchain:** - **Todos los Datos en Blockchain:** Chainbrary usa exclusivamente la tecnología blockchain para todo el almacenamiento de datos. Esto significa que cada pieza de datos, incluyendo registros de transacciones, direcciones de billeteras y cualquier otra información relacionada con el usuario, está almacenada en el blockchain. - **Sin Almacenamiento de Datos Fuera de la Cadena:** No almacenamos ningún dato de usuario fuera de la cadena. Este enfoque se alinea con nuestro compromiso con la transparencia y seguridad inherente en la tecnología blockchain, asegurando que toda la información relacionada con el usuario se mantenga en un entorno descentralizado y seguro. 2. **Medidas de Seguridad Blockchain:** - **Seguridad Intrínseca de Blockchain:** La naturaleza descentralizada del blockchain proporciona un alto nivel de seguridad. Los datos en el blockchain están cifrados y distribuidos a través de múltiples nodos, haciéndolos resilientes a ataques cibernéticos y accesos no autorizados. - **Privacidad Controlada por el Usuario:** Los usuarios tienen control sobre sus datos en el blockchain. Si bien los datos son públicamente visibles, los usuarios mantienen el control sobre sus llaves privadas, que son esenciales para cualquier transacción o acceso a su información en el blockchain. 3. **Naturaleza Pública de los Datos en Blockchain:** - **Transparencia y Visibilidad:** Es importante que los usuarios comprendan que los datos almacenados en el blockchain son visiblement públicos. Esto incluye historiales de transacciones y direcciones de billeteras. Anonimato e Identificación: Si bien los datos de blockchain no revelan directamente identidades personales, la naturaleza pública de los datos significa que los usuarios deben ser conscientes de su privacidad y la información que eligen transar en el blockchain. - **Adaptándose al Paradigma de Blockchain.** Nuestro enfoque hacia el almacenamiento y seguridad de datos está continuamente evolucionando con los avances en la tecnología blockchain. Reconocemos la importancia de estar a la vanguardia de las prácticas de seguridad en el dominio blockchain y estamos comprometidos a adaptar nuestras estrategias para asegurar el más alto nivel de integridad y seguridad de los datos para nuestros usuarios. **Adaptándose al Paradigma de Blockchain.** Nuestro enfoque hacia el almacenamiento y seguridad de datos está continuamente evolucionando con los avances en la tecnología blockchain. Reconocemos la importancia de estar a la vanguardia de las prácticas de seguridad en el dominio blockchain y estamos comprometidos a adaptar nuestras estrategias para asegurar el más alto nivel de integridad y seguridad de los datos para nuestros usuarios. ### Sección Mejorada de Política de Comunicación **Fomentando la Comunicación Abierta y Transparente.** En Chainbrary, creemos en mantener una línea de comunicación transparente y abierta con nuestra comunidad. Nuestra política de comunicación está diseñada para reflejar nuestros valores de transparencia y empoderamiento del usuario dentro del espacio blockchain. 1. **Comunicación Impulsada por la Comunidad:** - **Iniciación por la Comunidad:** Nuestra comunicación con la comunidad es iniciada principalmente por los mismos miembros de la comunidad. Este enfoque es consistente con nuestro ethos descentralizado, donde la comunidad juega un papel fundamental. - **Plataformas para el Compromiso:** Nos relacionamos con nuestra comunidad a través de varios canales de redes sociales y discusiones grupales. Estas plataformas son elegidas por su accesibilidad y eficacia en facilitar un diálogo abierto. 2. **Sin Contacto No Solicitado:** - **Respetando las Preferencias del Usuario:** Chainbrary se adhiere a una política estricta de no participar en contacto no solicitado. No enviamos correos electrónicos ni mensajes directos a menos que respondamos a consultas iniciadas por el usuario o proporcionemos actualizaciones importantes como parte de nuestro servicio. - **Consentimiento del Usuario:** Toda comunicación directa desde Chainbrary se basa en el consentimiento explícito de los usuarios. Aseguramos que nuestros usuarios tengan control completo sobre el tipo y la frecuencia de la comunicación que reciben de nosotros. 3. **Transparencia en la Comunicación:** - **Información Clara y Honesta:** Toda comunicación desde Chainbrary está diseñada para ser clara, honesta y directa. Evitamos el argot técnico cuando es posible y apuntamos a proporcionar información que sea fácilmente comprensible. - **Retroalimentación y Respuesta:** Alentamos y valoramos la retroalimentación de nuestra comunidad. Nuestros canales siempre están abiertos para sugerencias, inquietudes y preguntas, con el compromiso de responder de manera oportuna y respetuosa. **Compromiso con la Comunicación Efectiva.** Nuestra política de comunicación es un reflejo de nuestra dedicación a construir una comunidad fuerte, informada y comprometida. Entendemos la importancia de la comunicación efectiva en el mundo descentralizado y estamos comprometidos a mantener estos estándares en todas nuestras interacciones con nuestros usuarios. ### Sección de Restricción de Edad y Cumplimiento **Promoviendo el Uso Responsable y la Adherencia Regulatoria.** Chainbrary está comprometido con el uso responsable de la tecnología blockchain y cumple estrictamente con el cumplimiento regulatorio. Nuestra política de restricción de edad y las medidas de cumplimiento son aspectos fundamentales de este compromiso. 1. **Política de Restricción de Edad:** - **Requisito de Edad Mínima:** Los servicios de Chainbrary están disponibles exclusivamente para individuos que tienen 21 años de edad o más. Esta restricción de edad está en lugar para asegurar el uso responsable de nuestros servicios y cumplimiento con los estándares legales. - **Proceso de Verificación:** Empleamos medidas necesarias para verificar la edad de nuestros usuarios. Los usuarios deben confirmar su edad durante el proceso de registro, asegurando que los menores no accedan a nuestros servicios. 2. **Cumplimiento con los Estándares Regulatorios:** - **Adherencia a Estándares Globales:** Chainbrary cumple con leyes y regulaciones internacionales y locales relacionadas con la tecnología blockchain y plataformas en línea. Esto incluye leyes de protección de datos, regulaciones financieras y cualquier otro requisito legal relevante. - **Revisión Regular de Cumplimiento:** Realizamos revisiones regulares de nuestras políticas y operaciones para garantizar el cumplimiento continuo con los estándares legales. Este enfoque proactivo nos permite adaptarnos a paisajes regulatorios en evolución. 3. **Responsabilidad del Usuario:** - **Conciencia y Adherencia:** Se espera que los usuarios estén conscientes y cumplan con la política de restricción de edad. Es responsabilidad de cada usuario asegurarse de que cumplen con el requisito de edad para usar nuestros servicios. - **Uso Legal y Ético:** Los usuarios también son responsables de garantizar que su uso de los servicios de Chainbrary sea legal y ético, de acuerdo con las leyes de sus respectivas jurisdicciones. **Nuestra Dedicación a las Operaciones Responsables y Conformes.** Chainbraby toma seriamente su responsabilidad hacia el cumplimiento legal y las operaciones éticas. Nuestra política de restricción de edad y adherencia a los estándres regulatorios no son solo obligaciones legales sino también reflejan nuestro compromiso con fomentar un entorno en línea seguro, responsable y conforme. ### Sección Revisada de Actualizaciones de Políticas y Notificaciones de Revisión **Adaptándose al Paisaje Cambiante del Blockchain.** Chainbrary comprende la naturaleza dinámica de la industria del blockchain y la importancia de mantener una Política de Privacidad actualizada que se alinee con estos cambios. 1. **Procedimiento para Actualizaciones de Políticas:** - **Monitoreo Continuo:** Nuestro equipo monitorea y revisa constantemente la Política de Privacidad para asegurar su alineación con nuestras operaciones actuales, tecnologías evolutivas y marcos legales. - **Criterios para las Actualizaciones:** Los cambios en la política pueden surgir de nuevas ofertas de servicios, actualizaciones legales y regulatorias, retroalimentación de los usuarios o avances tecnológicos en el sector blockchain. - **Documentación de Cambios:** Todas las actualizaciones de la Política de Privacidad estarán claramente documentadas, proporcionando transparencia sobre las modificaciones y sus razones. 2. **Notificación de Cambios en la Política:** - **Anuncio en Canales Públicos:** De acuerdo con nuestro enfoque digital primero, las actualizaciones significativas de la Política de Privacidad serán anunciadas en nuestro canal público de Discord. Este método asegura que todos los usuarios tengan acceso igual e inmediato a la información más reciente. - **Clarificación de la Fecha Efectiva:** Cada anuncio especificará la fecha efectiva de la política revisada, permitiendo a los usuarios comprender cuándo los nuevos términos estarán en vigencia. - **Compromiso y Consentimiento:** Si bien es posible que no se busque el consentimiento formal para cada actualización, alentamos la participación activa de nuestros usuarios en revisar y comprender los cambios. La retroalimentación de los usuarios sobre las actualizaciones es siempre bienvenida. 3. **Fomentando la Participación Proactiva del Usuario:** - **Recomendación de Revisión Regular:** Abogamos por que nuestros usuarios visiten regularmente nuestro canal de Discord y revisen periódicamente la Política de Privacidad para mantenerse informados. - **Canales de Retroalimentación:** Se alienta a los usuarios a compartir su retroalimentación e inquietudes con respecto a la Política de Privacidad directamente a través de nuestro canal de Discord. Esto facilita un diáled dinámico y receptivo entre Chainbrary y su comunidad. **Nuestra Dedicación a la Transparencia y el Empoderamiento del Usuario.** Las actualizaciones de políticas de Chainbrary y los procedimientos de notificación reflejan nuestro compromiso con la transparencia y garantizar que nuestros usuarios estén bien informados. Al utilizar nuestro canal público de Discord para los anuncios, mantenemos una comunicación abierta, accesible y oportuna con nuestra comunidad. ### Sección de Contacto y Consultas **Canales Abiertos para Comunicación y Soporte.** Chainbrary está dedicado a mantener un entorno donde la comunicación abierta y el soporte al usuario sean primordiales. Entendemos que las consultas, preocupaciones y retroalimentación son integrales para la mejora continua de nuestra plataforma y las relaciones con la comunidad. 1. **Método de Contacto Primario:** - **Canales Comunitarios:** Para cualquier pregunta, preocupación o comentario sobre nuestras prácticas de privacidad o cualquier aspecto de nuestros servicios, se alienta a los usuarios a comunicarse a través de nuestros canales comunitarios, principalmente en Discord. Esta plataforma permite la interacción en tiempo real y asegura una atención oportuna por parte de nuestro equipo. 2. **Soporte y Respuesta:** - **Equipo de Soporte Dedicado:** Nuestro equipo de soporte está activamente presente en Discord para atender consultas de los usuarios. Nos esforzamos por proporcionar respuestas oportunas y útiles a todas las preguntas, asegurando que los usuarios se sientan escuchados y apoyados. - **Compromiso Comunitario:** También fomentamos un entorno donde los miembros de la comunidad puedan ayudarse mutuamente, aprovechando el conocimiento colectivo y las experiencias de nuestra base de usuarios. 3. **Retroalimentación y Sugerencias:** - **Abierto a la Entrada del Usuario:** Chainbrary valora las ideas y sugerencias de nuestra comunidad. Se alienta a los usuarios a compartir sus ideas y comentarios, que juegan un papel crucial en dar forma a nuestras políticas y desarrollos de la plataforma. - **Proceso de Consideración Transparente:** Toda retroalimentación de los usuarios es cuidadosamente considerada por nuestro equipo. Si bien es posible que no podamos implementar cada sugerencia, nos aseguramos de que cada idea sea debidamente considerada y respondida. 4. **Problemas y Preocupaciones:** - **Proceso de Resolución:** Para problemas o preocupaciones, especialmente aquellos relacionados con la privacidad o el uso de datos, los usuarios pueden comunicarse directamente en nuestro canal de Discord. Tenemos protocolos establecidos para escalar y abordar estos asuntos con la seriedad y discreción que merecen. - **Mejora Continua:** Los problemas reportados por los usuarios no solo se abordan, sino que también se analizan para posibles mejoras en nuestras políticas y prácticas. **Tu Voz Importa.** En Chainbrary, creemos en el poder del crecimiento y la mejora impulsados por la comunidad. Nuestros canales siempre están abiertos para tus voces, asegurando que tu experiencia con Chainbrary no solo sea segura y privada, sino también colaborativa y receptiva. ### Resumen Final y Fecha Efectiva **Política de Privacidad de Chainbrary: Un Compromiso con Nuestra Comunidad.** Esta Política de Privacidad representa el compromiso inquebrantable de Chainbrary con la privacidad y la seguridad de los miembros de nuestra comunidad. Como una organización autónoma descentralizada que aprovecha la tecnología blockchain, reconocemos la importancia crítica de manejar y proteger los datos de los usuarios con el máximo cuidado y transparencia. **Aspectos Destacados de Nuestra Política:** - **Recolección Mínima de Datos:** Nuestras operaciones están guiadas por el principio de recolección mínima de datos, asegur
fr: # Politique de confidentialité de Chainbrary _Dernière mise à jour : 21 février 2024_ ### Introduction **Bienvenue sur Chainbrary**. En tant qu'organisation autonome décentralisée (DAO) pionnière, nous nous engageons fermement à préserver la confidentialité et la sécurité de notre communauté. Dans le paysage en évolution de la technologie de la blockchain, la sacralité des données personnelles n'a jamais été plus primordiale. Cette politique de confidentialité témoigne de notre dévouement, en décrivant nos pratiques et principes dans la gestion et la protection des informations collectées à travers nos opérations et notre site web. Chainbrary se positionne au premier plan de l'intégration de la technologie blockchain au sein d'un cadre qui respecte et préserve la confidentialité des utilisateurs. En tant que DAO, nous fonctionnons avec une structure de gouvernance unique, qui est décentralisée et contrôlée par les membres de notre communauté. Cette structure non seulement donne du pouvoir à nos utilisateurs, mais aussi façonne notre approche de la gestion des données et de la confidentialité. Dans ce document, nous cherchons à transmettre de manière transparente nos méthodes de collecte, d’utilisation et de protection des données. Nous comprenons l'importance de votre confidentialité et nous nous engageons à maintenir la confiance que vous nous accordez lorsque vous naviguez à travers les domaines de la technologie blockchain. ### Section élargie sur la collecte d'informations L'approche de Chainbrary en matière de collecte d'informations. Conformément à notre principe fondamental de collecte minimale de données, notre plateforme est conçue pour recueillir uniquement les données essentielles requises pour un fonctionnement efficace et une expérience utilisateur optimale. Cette approche reflète notre engagement envers la confidentialité et la transparence. Ci-dessous, nous détaillons les catégories d'informations que nous collectons : 1. **Données basées sur la blockchain :** Nos opérations sont profondément ancrées dans la technologie de la blockchain. Par conséquent, les données principales que nous collectons tournent autour des transactions de la blockchain. Ceci comprend les identifiants de transaction publics, les adresses de portefeuille, et les interactions de contrat intelligent. Il est essentiel de comprendre que ces informations sont intrinsèquement publiques en raison de la nature de la technologie de la blockchain et ne sont pas confidentielles. 2. **Données d'utilisation agrégées :** Dans le but d'améliorer notre plate-forme, nous utilisons des outils d'analyse web. Ces outils nous fournissent des données agrégées concernant l'utilisation du site et le comportement des visiteurs. Ces données incluent les pages vues, la durée des sessions, et les modèles généraux de trafic. Notamment, ces informations sont collectées sous forme agrégée et ne nous permettent pas d'identifier les utilisateurs individuels. 3. **Données fournies volontairement par les utilisateurs :** Dans certaines situations, les utilisateurs peuvent choisir de nous fournir des informations supplémentaires. Cela pourrait inclure des commentaires par le biais de canaux communautaires, la participation à des enquêtes, ou d'autres formes de communication directe avec Chainbrary. Ces informations sont fournies volontairement et sont utilisées pour améliorer encore nos services. Notre engagement envers la collecte minimale de données n'est pas seulement une politique, mais aussi le reflet de notre respect pour votre vie privée. Nous veillons à ce que toutes les informations collectées soient traitées avec le plus grand soin et ne soient utilisées qu'aux fins déclarées. ### Section révisée sur le stockage et la sécurité des données Assurer l'intégrité et la sécurité des données dans le cadre de la blockchain. Chez Chainbrary, notre engagement en faveur de la sécurité des données est intégré de manière transparente à nos opérations basées sur la blockchain. La compréhension des caractéristiques uniques de la technologie de la blockchain guide notre approche du stockage et de la sécurité des données. 1. **Stockage exclusif des données sur la blockchain :** - **Toutes les données sur la blockchain :** Chainbrary utilise exclusivement la technologie de la blockchain pour tous les stockages de données. Cela signifie que chaque élément de données, y compris les enregistrements de transactions, les adresses de portefeuille et toute autre information liée à l'utilisateur, est stocké sur la blockchain. - **Pas de stockage de données hors blockchain :** Nous ne stockons aucune donnée d'utilisateur hors blockchain. Cette approche est conforme à notre engagement en faveur de la transparence et de la sécurité inhérente à la technologie de la blockchain qui permet de garantir que toutes les informations relatives à l'utilisateur sont conservées dans un environnement décentralisé et sécurisé. 2. **Mesures de sécurité de la blockchain :** - **Sécurité inhérente de la blockchain :** La nature décentralisée de la blockchain offre un haut niveau de sécurité. Les données sur la blockchain sont cryptées et distribuées sur plusieurs nœuds, ce qui les rend résistantes aux cyber-attaques et aux accès non autorisés. - **Confidentialité contrôlée par l'utilisateur :** Les utilisateurs ont le contrôle de leurs données sur la blockchain. Bien que les données soient publiquement visibles, les utilisateurs ont le contrôle de leurs clés privées qui sont essentielles pour toute transaction ou accès à leurs informations sur la blockchain. 3. **Nature publique des données de la blockchain :** - **Transparence et visibilité :** Il est important pour les utilisateurs de comprendre que les données stockées sur la blockchain sont publiquement visibles. Ceci comprend les historiques de transactions et les adresses de portefeuilles. L'anonymat et l'identification : Bien que les données de la blockchain ne révèlent pas directement les identités personnelles, la nature publique des données signifie que les utilisateurs doivent être conscients de leur confidentialité et des informations qu'ils choisissent d'effectuer des transactions sur la blockchain. - **Adapter au paradigme de la blockchain.** Notre approche du stockage et de la sécurité des données évolue constamment avec les avancées de la technologie de la blockchain. Nous reconnaissons l'importance de rester à la pointe des pratiques de sécurité dans le domaine de la blockchain et nous nous engageons à adapter nos stratégies pour garantir le plus haut niveau d'intégrité et de sécurité des données pour nos utilisateurs. ### Section d'amélioration de la politique de communication **Favoriser une communication ouverte et transparente.** Chez Chainbrary, nous croyons à l'importance de maintenir une ligne de communication transparente et ouverte avec notre communauté. Notre politique de communication est conçue pour refléter nos valeurs de transparence et d'empowerment des utilisateurs dans l'espace de la blockchain. 1. **Communication pilotée par la communauté :** - **Initiée par la communauté :** Notre communication avec la communauté est principalement initiée par les membres de la communauté eux-mêmes. Cette approche est cohérente avec notre éthique décentralisée, où la communauté joue un rôle pivot. - **Plateformes d'engagement :** Nous dialoguons avec notre communauté à travers divers canaux de réseaux sociaux et de discussions de groupes. Ces plateformes sont choisies pour leur accessibilité et leur efficacité à faciliter le dialogue ouvert. 2. **Pas de contact non sollicité :** - **Respect des préférences des utilisateurs :** Chainbrary adhère à une politique stricte de non-engagement dans les contacts non sollicités. Nous n'envoyons pas d'e-mails ou de messages directs à moins de répondre à des demandes d'informations initiées par les utilisateurs ou de fournir des mises à jour importantes dans le cadre de notre service. - **Consentement de l'utilisateur :** Toute communication directe de la part de Chainbrary est basée sur le consentement explicite des utilisateurs. Nous veillons à ce que nos utilisateurs aient un contrôle total sur le type et la fréquence des communications qu'ils reçoivent de notre part. 3. **Transparence dans la communication :** - **Information claire et honnête :** Toute communication provenant de Chainbrary est conçue pour être claire, honnête et directe. Nous évitons le jargon technique autant que possible et visons à fournir des informations facilement compréhensibles. - **Retour d'information et réponse :** Nous encourageons et valorisons les commentaires de notre communauté. Nos canaux sont toujours ouverts aux suggestions, aux préoccupations et aux questions, avec un engagement à répondre de manière opportune et respectueuse. ### Section sur la restriction d'âge et la conformité **Promouvoir une utilisation responsable et l'adhésion aux règlementations.** Chainbrary est engagé envers une utilisation responsable de la technologie blockchain et respecte strictement la conformité règlementaire. Notre politique de restriction d'âge et les mesures de conformité sont des aspects fondamentaux de cet engagement. 1. **Politique de restriction d'âge :** - **Exigence d'âge minimum :** Les services de Chainbrary sont disponibles exclusivement aux personnes de 21 ans ou plus. Cette restriction d'âge est en place pour assurer une utilisation responsable de nos services et le respect des normes légales. - **Processus de vérification :** Nous mettons en place les mesures nécessaires pour vérifier l'âge de nos utilisateurs. Les utilisateurs sont tenus de confirmer leur âge lors du processus d'inscription, ce qui garantit que les mineurs n'accèdent pas à nos services. 2. **Conformité aux normes réglementaires :** - **Adhérence aux normes mondiales :** Chainbrary respecte les lois et règlements internationaux et locaux liés à la technologie de la blockchain et aux plateformes en ligne. Cela comprend les lois sur la protection des données, les réglementations financières et toutes autres exigences juridiques pertinentes. - **Examen régulier de la conformité :** Nous effectuons des examens réguliers de nos politiques et opérations pour garantir une conformité permanente aux normes juridiques. Cette approche proactive nous permet de nous adapter aux paysages réglementaires en constante évolution. 3. **Responsabilité de l'utilisateur :** - **Connaissance et adhésion :** Les utilisateurs sont censés être conscients et respecter la politique de restriction d'âge. Il est de la responsabilité de chaque utilisateur de s'assurer qu'il répond à l'exigence d'âge pour utiliser nos services. - **Usage légal et éthique :** Les utilisateurs sont également responsables de s'assurer que leur utilisation des services de Chainbrary est légale et éthique, en accord avec les lois de leurs juridictions respectives. **Notre dévouement à des opérations responsables et conformes.** Chainbrary prend au sérieux sa responsabilité en matière de conformité légale et d'opérations éthiques. Notre politique de restriction d'âge et notre adhérence aux normes réglementaires ne sont pas seulement des obligations légales, mais reflètent également notre engagement à promouvoir un environnement en ligne sûr, responsable et conforme. ### Section révisée sur les mises à jour de la politique et les notifications de révision **S'adapter au paysage évolutif de la blockchain.** Chainbrary comprend la nature dynamique de l'industrie de la blockchain et l'importance de maintenir une politique de confidentialité à jour qui se conforme à ces changements. 1. **Procédure de mise à jour de la politique :** - **Surveillance continue :** Notre équipe surveille constamment et examine la politique de confidentialité pour assurer son alignement avec nos opérations actuelles, les technologies en évolution, et les cadres juridiques. - **Critères de mise à jour :** Les changements de la politique peuvent découler de nouvelles offres de service, de mises à jour légales et réglementaires, de retours d'informations des utilisateurs, ou de progrès technologiques dans le secteur de la blockchain. - **Documentation des changements :** Toutes les mises à jour de la politique de confidentialité seront clairement documentées, offrant une transparence sur les modifications et leurs justifications. 2. **Notification des changements de politique :** - **Annonce sur les canaux publics :** En accord avec notre approche numérique, les mises à jour importantes de la politique de confidentialité seront annoncées sur notre canal Discord public. Cette méthode garantit que tous les utilisateurs ont un accès égal et immédiat à l'information la plus récente. - **Clarification de la date d'entrée en vigueur :** Chaque annonce précisera la date d'entrée en vigueur de la politique révisée, permettant aux utilisateurs de comprendre quand les nouvelles conditions seront en vigueur. - **Engagement et consentement :** Bien que le consentement formel puisse ne pas être demandé pour chaque mise à jour, nous encourageons l'engagement actif de nos utilisateurs dans la révision et la compréhension des changements. Les commentaires des utilisateurs sur les mises à jour sont toujours les bienvenus. 3. **Encourager la participation proactive des utilisateurs :** - **Recommandation d'examen régulier :** Nous préconisons que nos utilisateurs visitent régulièrement notre canal Discord et examinent périodiquement la politique de confidentialité pour rester informés. - **Canaux de feedback :** Les utilisateurs sont encouragés à partager leurs commentaires et questions concernant la politique de confidentialité directement sur notre canal Discord. Cela facilite un dialogue dynamique et réactif entre Chainbrary et sa communauté. ### Section Contact et Questions **Canaux ouverts pour la communication et le soutien.** Chainbrary est dédié à maintenir un environnement où la communication ouverte et le support aux utilisateurs sont primordiaux. Nous comprenons que les questions, les préoccupations et les commentaires sont essentiels à l'amélioration continue de notre plateforme et de nos relations avec la communauté. 1. **Méthode de contact principale :** - **Canaux communautaires :** Pour toutes les questions, préoccupations ou commentaires concernant nos pratiques de confidentialité ou tout aspect de nos services, les utilisateurs sont encouragés à prendre contact par le biais de nos canaux communautaires, principalement sur Discord. Cette plateforme permet une interaction en temps réel et assure une attention rapide de la part de notre équipe. 2. **Support et réponse :** - **Equipe de soutien dédiée :** Notre équipe de support est activement présente sur Discord pour répondre aux demandes des utilisateurs. Nous nous efforçons de fournir des réponses opportunes et utiles à toutes les questions, en veillant à ce que les utilisateurs se sentent entendus et soutenus. - **Engagement communautaire :** Nous favorisons également un environnement où les membres de la communauté peuvent s'entraider, en tirant parti des connaissances et des expériences collectives de notre base d'utilisateurs. 3. **Commentaires et suggestions :** - **Ouverts aux contributions des utilisateurs :** Chainbrary apprécie les contributions et les suggestions de notre communauté. Les utilisateurs sont encouragés à partager leurs idées et leurs commentaires, qui jouent un rôle crucial dans l'évolution de nos politiques et du développement de notre plateforme. - **Processus de considération transparent :** Tous les commentaires des utilisateurs sont soigneusement considérés par notre équipe. Bien que nous ne puissions pas mettre en œuvre chaque suggestion, nous veillons à ce que chaque idée reçoive une considération et une réponse appropriée. 4. **Problèmes et préoccupations :** - **Processus de résolution :** Pour les problèmes ou préoccupations, en particulier ceux liés à la confidentialité ou à l'utilisation des données, les utilisateurs peuvent s'adresser directement sur notre chaîne Discord. Nous avons mis en place des protocoles pour escalader et résoudre de tels problèmes avec le sérieux et la discrétion qu'ils méritent. - **Amélioration continue :** Les problèmes signalés par les utilisateurs ne sont pas seulement résolus, mais sont également analysés pour des améliorations potentielles de nos politiques et pratiques. **Votre voix compte.** Chez Chainbrary, nous croyons en la force de la croissance et de l'amélioration pilotées par la communauté. Nos canaux sont toujours ouverts pour vos voix, en veillant à ce que votre expérience avec Chainbrary ne soit pas seulement sécurisée et privée, mais aussi collaborative et réactive. ### Résumé final et date d'entrée en vigueur **Politique de confidentialité de Chainbrary : Un engagement envers notre communauté.** Cette politique de confidentialité représente l'engagement indéfectible de Chainbrary envers la confidentialité et la sécurité des membres de notre communauté. En tant qu'organisation autonome décentralisée exploitant la technologie de la blockchain, nous reconnaissons l'importance critique de la gestion et de la protection des données des utilisateurs avec le plus grand soin et la plus grande transparence. **Points clés de notre politique :** - **Collecte minimale de données :** Nos opérations sont guidées par le principe de la collecte minimale de données, nous ne collectons que les données nécessaires pour le fonctionnement et l'amélioration de nos services. - **Stockage des données sur la blockchain :** Toutes les données des utilisateurs sont stockées sur la blockchain, ce qui met l'accent sur la sécurité, la transparence et l'intégrité. - **Communication ouverte et transparente :** Notre communication avec la communauté est pilotée par l'engagement des utilisateurs et la transparence, principalement facilitée par notre canal public sur Discord. - **Restriction d'âge et conformité :** Nous appliquons une politique de restriction d'âge stricte, n'autorisant que les personnes âgées de 21 ans et plus à utiliser nos services, assurant une utilisation responsable et le respect des normes légales. - **Réactif aux contributions de la communauté :** Nous valorisons et encourageons les feedbacks des utilisateurs, qui sont intégrales à l'évolution de nos politiques et de nos services. **Date d'entrée en vigueur :** Cette politique de confidentialité entre en vigueur le 21 février 2024. Nous encourageons nos utilisateurs à examiner régulièrement cette politique pour rester informés de la manière dont nous protégeons leurs informations et pour comprendre leurs droits et responsabilités en tant que membres appréciés de Chainbrary. **Notre promesse envers vous :** Chainbrary s'engage à maintenir une plateforme sécurisée, privée et centrée sur l'utilisateur. Nous nous engageons à faire évoluer et à adapter en permanence nos pratiques en fonction des avancées technologiques et des besoins de la communauté. Votre confiance en nous est primordiale, et nous nous engageons à respecter cette confiance par nos actions et nos politiques.
