Repository: etsraphael/ChainBrary
Catalog: UI/src/locale/messages.*.xlf
Languages: es, fr

# documentLockerTermAndCond
source: Before utilizing our Document Locker, please carefully read the following terms and conditions: __DOUBLE_NEWLINE__ ## 1. Agreement to Terms __DOUBLE_NEWLINE__ By using the Document Locker, you agree to be bound by these Terms. All users are subject to these terms, and usage signifies acceptance. __DOUBLE_NEWLINE__ ## 2. Eligibility __DOUBLE_NEWLINE__ Participants must be of legal age and capable of entering into legally binding contracts. By using this service, you confirm that you meet these requirements. __DOUBLE_NEWLINE__ ## 3. Usage Process __DOUBLE_NEWLINE__ - Documents are encrypted and stored upon upload. __DOUBLE_NEWLINE__ - Access to documents is exclusively granted to the buyer and the owner of the smart contract. __DOUBLE_NEWLINE__ - Once a document is unlocked, it is permanently encrypted on the blockchain, ensuring it cannot be shared or accessed by any other parties. __DOUBLE_NEWLINE__ ## 4. Document Submissions __DOUBLE_NEWLINE__ - All documents uploaded remain the intellectual property of the original owner. __DOUBLE_NEWLINE__ - Users must have the right or authority to secure documents uploaded. __DOUBLE_NEWLINE__ - The platform may not be used for illegal activities or storing prohibited content. __DOUBLE_NEWLINE__ ## 5. Confidentiality and Security __DOUBLE_NEWLINE__ - We employ robust encryption and security measures to protect the documents. __DOUBLE_NEWLINE__ - Once unlocked, the document is solely accessible to the owner and the buyer and cannot be shared or accessed by others, ensuring exclusive and private use. __DOUBLE_NEWLINE__ ## 6. Transaction and Payments __DOUBLE_NEWLINE__ - Upon purchase, 99.9% of the funds are transferred directly to the document's owner, and 0.1% is contributed to the community. __DOUBLE_NEWLINE__ - There are no withdrawals or refunds once a purchase is made. The transaction is final and binding. __DOUBLE_NEWLINE__ ## 7. Role of Platform __DOUBLE_NEWLINE__ We provide a secure environment for document storage but are not responsible for the contents of the documents or the actions of users. __DOUBLE_NEWLINE__ ## 8. Liability __DOUBLE_NEWLINE__ The platform is not liable for issues like unauthorized access due to user negligence or unforeseen security breaches. __DOUBLE_NEWLINE__ ## 9. Amendments __DOUBLE_NEWLINE__ Terms may be modified without notice. Continued use implies agreement to new terms. __DOUBLE_NEWLINE__ ## 10. Contact Us __DOUBLE_NEWLINE__ For inquiries or assistance, reach out through our support channel. __DOUBLE_NEWLINE__ By using the Document Locker, you affirm understanding and agreement with these Terms and Conditions.
es: Antes de utilizar nuestro Document Locker, por favor lea detenidamente los siguientes términos y condiciones: __DOUBLE_NEWLINE__ ## 1. Acuerdo de Condiciones __DOUBLE_NEWLINE__ Al utilizar el Document Locker, usted acepta estar sujeto a estos Términos. Todos los usuarios están sujetos a estos términos, y el uso significa la aceptación. __DOUBLE_NEWLINE__ ## 2. Elegibilidad __DOUBLE_NEWLINE__ Los participantes deben ser mayores de edad y capaces de celebrar contratos legalmente vinculantes. Al utilizar este servicio, usted confirma que cumple con estos requisitos. __DOUBLE_NEWLINE__ ## 3. Proceso de Uso __DOUBLE_NEWLINE__ - Los documentos se cifran y almacenan al ser subidos. __DOUBLE_NEWLINE__ - El acceso a los documentos se otorga exclusivamente al comprador y al propietario del contrato inteligente. __DOUBLE_NEWLINE__ - Una vez que un documento se desbloquea, queda cifrado de manera permanente en la cadena de bloques, asegurando que no pueda ser compartido o accedido por otras partes. __DOUBLE_NEWLINE__ ## 4. Envío de Documentos __DOUBLE_NEWLINE__ - Todos los documentos subidos siguen siendo propiedad intelectual del dueño original. __DOUBLE_NEWLINE__ - Los usuarios deben tener el derecho o la autoridad para asegurar los documentos subidos. __DOUBLE_NEWLINE__ - La plataforma no puede ser utilizada para actividades ilegales ni para almacenar contenido prohibido. __DOUBLE_NEWLINE__ ## 5. Confidencialidad y Seguridad __DOUBLE_NEWLINE__ - Empleamos medidas de cifrado y seguridad robustas para proteger los documentos. __DOUBLE_NEWLINE__ - Una vez desbloqueado, el documento es accesible únicamente para el dueño y el comprador y no puede ser compartido ni accedido por otros, asegurando un uso exclusivo y privado. __DOUBLE_NEWLINE__ ## 6. Transacciones y Pagos __DOUBLE_NEWLINE__ - Al realizar una compra, el 99.9% de los fondos se transfieren directamente al dueño del documento, y el 0.1% se contribuye a la comunidad. __DOUBLE_NEWLINE__ - No hay retiros ni reembolsos una vez que se realiza una compra. La transacción es definitiva y vinculante. __DOUBLE_NEWLINE__ ## 7. Papel de la Plataforma __DOUBLE_NEWLINE__ Proporcionamos un entorno seguro para el almacenamiento de documentos, pero no somos responsables de los contenidos de los documentos ni de las acciones de los usuarios. __DOUBLE_NEWLINE__ ## 8. Responsabilidad __DOUBLE_NEWLINE__ La plataforma no es responsable de problemas como acceso no autorizado debido a negligencia del usuario o violaciones de seguridad imprevistas. __DOUBLE_NEWLINE__ ## 9. Enmiendas __DOUBLE_NEWLINE__ Los términos pueden modificarse sin previo aviso. El uso continuado implica la aceptación de los nuevos términos. __DOUBLE_NEWLINE__ ## 10. Contáctenos __DOUBLE_NEWLINE__ Para consultas o asistencia, comuníquese a través de nuestro canal de soporte. __DOUBLE_NEWLINE__ Al utilizar el Document Locker, usted afirma entender y estar de acuerdo con estos Términos y Condiciones.
fr: Avant d'utiliser notre Coffre à Documents, veuillez lire attentivement les termes et conditions suivants : __DOUBLE_NEWLINE__ ## 1. Accord avec les Termes __DOUBLE_NEWLINE__ En utilisant le Coffre à Documents, vous acceptez d'être lié par ces Termes. Tous les utilisateurs sont soumis à ces termes, et l'utilisation signifie l'acceptation. __DOUBLE_NEWLINE__ ## 2. Éligibilité __DOUBLE_NEWLINE__ Les participants doivent être majeurs et capables de conclure des contrats juridiquement contraignants. En utilisant ce service, vous confirmez répondre à ces exigences. __DOUBLE_NEWLINE__ ## 3. Processus d'Utilisation __DOUBLE_NEWLINE__ - Les documents sont cryptés et stockés lors du téléchargement. __DOUBLE_NEWLINE__ - L'accès aux documents est exclusivement accordé à l'acheteur et au propriétaire du contrat intelligent. __DOUBLE_NEWLINE__ - Une fois un document déverrouillé, il est définitivement crypté sur la blockchain, garantissant qu'il ne peut être partagé ou accessible par d'autres parties. __DOUBLE_NEWLINE__ ## 4. Soumissions de Documents __DOUBLE_NEWLINE__ - Tous les documents téléchargés restent la propriété intellectuelle du propriétaire original. __DOUBLE_NEWLINE__ - Les utilisateurs doivent avoir le droit ou l'autorité de sécuriser les documents téléchargés. __DOUBLE_NEWLINE__ - La plateforme ne peut pas être utilisée pour des activités illégales ou pour stocker du contenu interdit. __DOUBLE_NEWLINE__ ## 5. Confidentialité et Sécurité __DOUBLE_NEWLINE__ - Nous employons des mesures de cryptage et de sécurité robustes pour protéger les documents. __DOUBLE_NEWLINE__ - Une fois déverrouillé, le document est uniquement accessible au propriétaire et à l'acheteur et ne peut être partagé ou accessible par d'autres, garantissant une utilisation exclusive et privée. __DOUBLE_NEWLINE__ ## 6. Transactions et Paiements __DOUBLE_NEWLINE__ - Lors de l'achat, 99,9% des fonds sont transférés directement au propriétaire du document, et 0,1% est versé à la communauté. __DOUBLE_NEWLINE__ - Il n'y a pas de retraits ni de remboursements une fois un achat effectué. La transaction est définitive et obligatoire. __DOUBLE_NEWLINE__ ## 7. Rôle de la Plateforme __DOUBLE_NEWLINE__ Nous fournissons un environnement sécurisé pour le stockage de documents mais ne sommes pas responsables du contenu des documents ni des actions des utilisateurs. __DOUBLE_NEWLINE__ ## 8. Responsabilité __DOUBLE_NEWLINE__ La plateforme n'est pas responsable de problèmes tels que l'accès non autorisé dû à la négligence des utilisateurs ou à des violations de sécurité imprévues. __DOUBLE_NEWLINE__ ## 9. Modifications __DOUBLE_NEWLINE__ Les termes peuvent être modifiés sans préavis. L'utilisation continue implique l'accord avec les nouveaux termes. __DOUBLE_NEWLINE__ ## 10. Contactez-Nous __DOUBLE_NEWLINE__ Pour toute demande ou assistance, contactez-nous via notre canal de support. __DOUBLE_NEWLINE__ En utilisant le Coffre à Documents, vous affirmez comprendre et accepter ces Termes et Conditions.

# DocumentResponse.ContractUnlockingInProcess
source: Contract unlocking in process
es: Proceso de desbloqueo de contrato en curso
fr: Processus de déverrouillage du contrat en cours

# DocumentResponse.LockingDocumentCreatedSuccessfully
source: Locking document created successfully
es: Documento bloqueado creado con éxito
fr: Document verrouillé créé avec succès

# ErrorMessage.Insufficient-balance
source: Insufficient balance
es: Saldo insuficiente
fr: Solde insuffisant

# ErrorMessage.TransactionError
source: An error occurred while sending the transaction on the wallet
es: Ocurrió un error al enviar la transacción en la billetera

# ErrorMessage.TransactionRejected
source: Transaction rejected by wallet
es: Transacción rechazada por la cartera

# ErrorMessage.WalletAlreadyProcessing
source: Wallet is already processing another request
es: La cartera ya está procesando otra solicitud.

# ErrorMessage.WalletNotEnoughBalance
source: Wallet connect has not enough balance to pay for the transaction
es: Wallet connect no tiene suficiente saldo para pagar la transacción.

# ErrorMessagePictureNotAttached
source: The URL provided does not have any pictures attached
es: La URL proporcionada no tiene ninguna imagen adjunta.
fr: L'URL fournie ne contient aucune image attachée

# ErrorMessageRetrievePrice.Desc
source: Failed to get the current price of the native network token. Please try again later.
es: No se pudo obtener el precio actual del token nativo de la red. Por favor, inténtelo de nuevo más tarde.
fr: Échec de l'obtention du prix actuel du jeton natif du réseau. Veuillez réessayer plus tard.

# footerBtn.Title.BountyProgram
source: Bounty Program
es: Programa de Recompensas
fr: Programme de Récompense

# footerBtn.Title.PrivacyPolicy
source: Privacy Policy
es: Política de Privacidad
fr: Politique de Confidentialité

# footerBtn.Title.TermAndCond
source: Terms and Conditions
es: Términos y Condiciones
fr: Conditions Générales

# footerBtn.Title.WhitePaper
source: White Paper
es: Papel Blanco
fr: Livre Blanc

# googleDriveText
source: 1. Go to <a href="https://drive.google.com/drive/my-drive" target="_blank">Google Drive</a> 2. Click on "+ New" > Then "New File" 3. Upload your file 4. Right click on the file > "Get shareable link" 5. Copy the link and paste it here 6. Make sure the image will be accessible at anytime
es: 1. Ve a <a href="https://drive.google.com/drive/my-drive" target="_blank">Google Drive</a> 2. Haz clic en "+ Nuevo" > Luego en "Archivo nuevo" 3. Sube tu archivo 4. Haz clic derecho en el archivo > "Obtener enlace compartible" 5. Copia el enlace y pégalo aquí 6. Asegúrate de que la imagen esté accesible en cualquier momento
fr: 1. Allez sur <a href="https://drive.google.com/drive/my-drive" target="_blank">Google Drive</a> 2. Cliquez sur "+ Nouveau" > Puis "Nouveau Fichier" 3. Téléchargez votre fichier 4. Faites un clic droit sur le fichier > "Obtenir un lien partageable" 5. Copiez le lien et collez-le ici 6. Assurez-vous que l'image sera accessible à tout moment

# headerBtn.Title.Home
source: Home
es: Inicio
fr: Accueil

# headerBtn.Title.Partnership
source: Partnership
es: Asociación
fr: Partenariat

# headerBtn.Title.Services
source: Services
es: Servicios

# landingPage.bidServiceDesc
source: Upload an item, set time limit and start bidding with tokens.
es: Sube un artículo, establece un límite de tiempo y comienza a pujar con tokens.
fr: Téléchargez un article, définissez une limite de temps et commencez à enchérir avec des jetons.

# landingPage.bidServiceTitle
source: Start a Bid
es: Iniciar una oferta
fr: Commencer une Offre

# landingPage.documentLockerDesc
source: Lock confidential information and open only with tokens.
es: Bloquee información confidencial y ábrala solo con tokens.
fr: Verrouillez les informations confidentielles et ouvrez uniquement avec des jetons.

# landingPage.documentLockerTitle
source: Document Locker
es: Caja Fuerte de Documentos
fr: Casier de Documents

# landingPage.myQRCodeDesc
source: Print a QR code for your business and let your customers pay in Cryptos.
es: Imprime un código QR para tu negocio y permite que tus clientes paguen en criptomonedas.
fr: Imprimez un code QR pour votre entreprise et laissez vos clients payer en Cryptos.

# landingPage.myQRCodeTitle
source: My QR Code
es: Mi código QR
fr: Mon Code QR

# landingPage.openSource
source: Open Source
es: Código Abierto

# landingPage.paymentServiceDesc
source: Connect your wallet, Create an ID or QRcode and use it to receive payments.
es: Conecta tu billetera, Crea una ID o QRcode y úsalo para recibir pagos.

# landingPage.paymentServiceTitle
source: Payment Request
es: Solicitud de pago
fr: Demande de Paiement

# lockDocumentDescription
source: Protect your documents with our blockchain-based Document Locker, ensuring exclusive access and utmost privacy.
es: Proteja sus documentos con nuestro Document Locker basado en blockchain, asegurando acceso exclusivo y la máxima privacidad.
fr: Protégez vos documents avec notre Coffre à Documents basé sur la blockchain, garantissant un accès exclusif et une confidentialité maximale.

# lockDocumentTitle
source: Lock a document
es: Bloquear un documento
fr: Verrouiller un document

# ocumentLockerContent.AlreadySoldAt
source: Already sold at priceInfo
es: Ya vendido a priceInfo
fr: Vendu à priceInfo

# PartnershipPage.Desc.Community-Vault
source: Join our Community Vault for mutual benefits. Be among the pioneers in this innovative financial tool.
es: Únete a nuestro Community Vault para beneficios mutuos. Sé uno de los pioneros en esta herramienta financiera innovadora.
fr: Rejoignez notre Coffre Communautaire pour des avantages mutuels. Soyez parmi les pionniers de cet outil financier innovant.

# PartnershipPage.Desc.Easy-Integration
source: Quickly integrate Chainbrary's user-friendly blockchain solutions into your projects.
es: Integra rápidamente las soluciones blockchain amigables para el usuario de Chainbrary en tus proyectos.
fr: Intégrez rapidement les solutions blockchain conviviales de Chainbrary dans vos projets.

# PartnershipPage.Desc.Explore-Chainbrary
source: Learn how Chainbrary demystifies blockchain, making it accessible and relevant for everyday use.
es: Aprende cómo Chainbrary desmitifica la cadena de bloques, haciéndola accesible y relevante para el uso diario.
fr: Apprenez comment Chainbrary démystifie la blockchain, la rendant accessible et pertinente pour une utilisation quotidienne.

# PartnershipPage.Desc.Extend-Community
source: Grow with us by engaging in our token-based ecosystem, fostering continuous exchange and community expansion.
es: Crecer con nosotros participando en nuestro ecosistema basado en tokens, fomentando un intercambio continuo y la expansión de la comunidad.
fr: Développez-vous avec nous en vous engageant dans notre écosystème basé sur des jetons, favorisant un échange continu et l'expansion de la communauté.

# PartnershipPage.Desc.Join-Our-Discord-Hub
source: Discover Chainbrary's blockchain world on Discord. Connect, learn, and share insights in our community.
es: Descubre el mundo blockchain de Chainbrary en Discord. Conéctate, aprende y comparte perspectivas en nuestra comunidad.
fr: Découvrez le monde blockchain de Chainbrary sur Discord. Connectez-vous, apprenez et partagez vos connaissances dans notre communauté.

# PartnershipPage.Desc.Maintenance
source: Benefit from our commitment to regular updates and enhancements, ensuring state-of-the-art features for our users.
es: Benefíciate de nuestro compromiso con actualizaciones y mejoras regulares, asegurando características de última generación para nuestros usuarios.
fr: Bénéficiez de notre engagement à effectuer des mises à jour et des améliorations régulières, garantissant des fonctionnalités à la pointe de la technologie pour nos utilisateurs.

# PartnershipPage.Desc.Open-Source
source: Our platform is transparent and open source, inviting collaboration and trust from our users.
es: Nuestra plataforma es transparente y de código abierto, fomentando la colaboración y la confianza de nuestros usuarios.
fr: Notre plateforme est transparente et open source, invitant à la collaboration et à la confiance de nos utilisateurs.

# PartnershipPage.Desc.Security
source: Security is our priority. Rely on our advanced measures to safeguard your blockchain interactions.
es: La seguridad es nuestra prioridad. Confía en nuestras medidas avanzadas para proteger tus interacciones con blockchain.
fr: La sécurité est notre priorité. Comptez sur nos mesures avancées pour protéger vos interactions blockchain.

# PartnershipPage.Desc.Services
source: Explore our multifaceted services: process token payments, secure sensitive files, and utilize our document locker for enhanced privacy.
es: Explora nuestros servicios multifacéticos: procesa pagos con tokens, asegura archivos sensibles y utiliza nuestro casillero de documentos para una mayor privacidad.
fr: Explorez nos services multifacettes : traitez les paiements de jetons, sécurisez les fichiers sensibles et utilisez notre casier de documents pour une confidentialité accrue.

# PartnershipPage.Title.Community-Vault
source: Community Vault
es: Cámara Comunitaria
fr: Coffre de la Communauté

# PartnershipPage.Title.Easy-Integration
source: Easy Integration
es: Fácil integración
fr: Intégration Facile

# PartnershipPage.Title.Explore-Chainbrary
source: Explore Chainbrary
es: Explora Chainbrary
fr: Explorez Chainbrary

# PartnershipPage.Title.Extend-Community
source: Extend Community
es: Extender Comunidad
fr: Étendre la Communauté

# PartnershipPage.Title.Join-Our-Discord-Hub
source: Join Our Discord Hub
es: Únete a nuestro centro de Discord
fr: Rejoignez Notre Hub Discord

# PartnershipPage.Title.Maintenance
source: Maintenance
es: Mantenimiento
fr: Entretien

# PartnershipPage.Title.Security
source: Security
es: Seguridad
fr: Sécurité

# PartnershipPage.Title.Services
source: Services
es: Servicios

# PayButton.ConnectWallet
source: Connect Wallet
es: Conectar billetera
fr: Connecter le portefeuille

# PayButton.PayNow
source: Pay Now
es: Paga ahora
fr: Payer maintenant

# paymentRequestDescription
source: Easily generate and share payment requests via URL or QR code. This feature primarily focuses on creating payment requests, allowing users to lock in prices in USD, ensuring accuracy despite token value fluctuations. A variety of tokens are available to accommodate diverse needs.
es: Genere y comparta fácilmente solicitudes de pago vía URL o código QR. Esta funcionalidad se enfoca principalmente en crear solicitudes de pago, permitiendo a los usuarios fijar precios en USD, asegurando precisión a pesar de las fluctuaciones en el valor del token. Una variedad de tokens están disponibles para satisfacer diversas necesidades.
fr: Générez et partagez facilement des demandes de paiement via URL ou code QR. Cette fonctionnalité se concentre principalement sur la création de demandes de paiement, permettant aux utilisateurs de verrouiller les prix en USD, garantissant ainsi l'exactitude malgré les fluctuations de la valeur des tokens. Une variété de tokens est disponible pour répondre à divers besoins.

# paymentRequestTitle
source: Payment Request
es: Solicitud de pago
fr: Demande de Paiement

# postImgText
source: 1. Go to <a href="https://postimages.org/" target="_blank">Post Image</a> 2. Click on "Choose images" 3. Upload your file 4. Copy the "Direct link" and paste it here 5. Make sure the image will be accessible at anytime
es: 1. Ve a <a href="https://postimages.org/" target="_blank">Post Image</a> 2. Haz clic en "Elegir imágenes" 3. Sube tu archivo 4. Copia el "Enlace directo" y pégalo aquí 5. Asegúrate de que la imagen esté accesible en cualquier momento
fr: 1. Allez sur <a href="https://postimages.org/" target="_blank">Post Image</a> 2. Cliquez sur "Choisir des images" 3. Téléchargez votre fichier 4. Copiez le "Lien direct" et collez-le ici 5. Assurez-vous que l'image sera accessible à tout moment

# printCreateTokenDescription
source: Create your own token with custom name, symbol and initial supply.
es: Crea tu propio token con nombre personalizado, símbolo y suministro inicial.
fr: Créez votre propre jeton avec un nom personnalisé, un symbole et une offre initiale.

# printCreateTokenHeaderDescription
source: Simple, Fast, Convenient to create tokens. Get 100% ownership of generated tokens with Custom token name, symbol and initial supply. Automatic verified and published contract source code.
es: Sencillo, Rápido, Conveniente para crear tokens. Obtén el 100% de la propiedad de los tokens generados con nombre de token personalizado, símbolo y suministro inicial. Código fuente del contrato verificado y publicado automáticamente.
fr: Simple, Rapide, Pratique pour créer des jetons. Obtenez 100% de propriété des jetons générés avec nom de jeton personnalisé, symbole et approvisionnement initial. Code source du contrat automatiquement vérifié et publié.

# printQRCodeDescription
source: Enhance your business's payment options by printing a QR code, allowing your customers to make seamless cryptocurrency transactions.
es: Mejore las opciones de pago de su negocio imprimiendo un código QR, permitiendo que sus clientes realicen transacciones de criptomonedas sin interrupciones.
fr: Améliorez les options de paiement de votre entreprise en imprimant un code QR, permettant à vos clients d'effectuer des transactions de cryptomonnaies en toute fluidité.

# printQrCodeMakerDesc
source: By accepting cryptocurrencies, you open doors to a broader customer base. Enhance your business's payment options by printing a QR code, allowing your customers to make seamless cryptocurrency transactions. Embrace the future of finance and offer your clientele the convenience and security of paying with digital currencies.
es: Al aceptar criptomonedas, abres las puertas a una base de clientes más amplia. Mejora las opciones de pago de tu negocio imprimiendo un código QR, permitiendo que tus clientes realicen transacciones de criptomonedas sin inconvenientes. Acepta el futuro de las finanzas y ofrece a tu clientela la comodidad y seguridad de pagar con monedas digitales.
fr: En acceptant les cryptomonnaies, vous ouvrez les portes à une base de clients plus large. Améliorez les options de paiement de votre entreprise en imprimant un code QR, permettant à vos clients d'effectuer des transactions en cryptomonnaie de manière transparente. Adoptez l'avenir de la finance et offrez à votre clientèle la commodité et la sécurité de payer avec des monnaies numériques.

# printQrCodeMakerTitle
source: Print QR Code
es: Imprimir código QR
fr: Imprimer le Code QR

# printQRCodeTitle
source: Print QR code
es: Imprimir código QR
fr: Imprimer le code QR
