Repository: etsraphael/ChainBrary
Catalog: UI/src/locale/messages.*.xlf
Languages: es, fr

# bidTermAndCond
source: Before you proceed with bidding, please carefully read the following terms and conditions: __DOUBLE_NEWLINE__ ## 1. Agreement to Terms __DOUBLE_NEWLINE__ By participating in this auction, you agree to be bound by these Terms. All bidders are subject to these terms, and participation signifies acceptance. __DOUBLE_NEWLINE__ ## 2. Eligibility __DOUBLE_NEWLINE__ Participants must be of legal age and capable of entering into legally binding contracts. By bidding, you confirm that you meet these requirements. __DOUBLE_NEWLINE__ ## 3. Auction Process __DOUBLE_NEWLINE__ - The auction starts with the smart contract's deployment and continues until the end time. __DOUBLE_NEWLINE__ - Bids must be in specified increments. __DOUBLE_NEWLINE__ - The highest bid at the end, meeting any reserve price, is the winning bid. __DOUBLE_NEWLINE__ ## 4. Bid Submissions __DOUBLE_NEWLINE__ - Bids are final and binding. No retraction is permitted. __DOUBLE_NEWLINE__ - Bids within the final 10 minutes extend the auction by 10 minutes. __DOUBLE_NEWLINE__ - The higher bid takes precedence after transaction confirmation. __DOUBLE_NEWLINE__ - Late bids are returned. __DOUBLE_NEWLINE__ - The highest bidder cannot retract or outbid themselves. __DOUBLE_NEWLINE__ - New bids automatically refund the previous highest bidder. __DOUBLE_NEWLINE__ ## 6. Transfer of Ownership __DOUBLE_NEWLINE__ Ownership transfers upon full settlement of the winning bid. __DOUBLE_NEWLINE__ ## 7. Withdrawals __DOUBLE_NEWLINE__ - Withdrawal of the auction amount is permitted post-auction with at least one bidder. __DOUBLE_NEWLINE__ - A 0.1% withdrawal fee applies. __DOUBLE_NEWLINE__ - Withdrawals are allowed only after the auction's official end. __DOUBLE_NEWLINE__ ## 8. Role of Chainbrary __DOUBLE_NEWLINE__ Chainbrary facilitates the auction interface but does not control the smart contract. It's not responsible for any errors or bugs. __DOUBLE_NEWLINE__ ## 9. Liability __DOUBLE_NEWLINE__ The platform is not liable for issues like network downtime or user input errors. __DOUBLE_NEWLINE__ ## 10. Amendments __DOUBLE_NEWLINE__ Terms may be modified without notice. Continued use implies agreement to new terms. __DOUBLE_NEWLINE__ ## 11. Contact Us __DOUBLE_NEWLINE__ For inquiries, reach out on [Discord](https://discord.gg/H3hFVuCrXN). __DOUBLE_NEWLINE__ By bidding, you affirm understanding and agreement with these Terms and Conditions.
es: Antes de proceder con la puja, por favor lea cuidadosamente los siguientes términos y condiciones: __DOUBLE_NEWLINE__ ## 1. Acuerdo con los Términos __DOUBLE_NEWLINE__ Al participar en esta subasta, usted acepta estar sujeto a estos Términos. Todos los postores están sujetos a estos términos, y la participación significa aceptación. __DOUBLE_NEWLINE__ ## 2. Elegibilidad __DOUBLE_NEWLINE__ Los participantes deben ser mayores de edad y capaces de celebrar contratos legalmente vinculantes. Al pujar, usted confirma que cumple con estos requisitos. __DOUBLE_NEWLINE__ ## 3. Proceso de la Subasta __DOUBLE_NEWLINE__ - La subasta comienza con el despliegue del contrato inteligente y continúa hasta la hora de finalización. __DOUBLE_NEWLINE__ - Las pujas deben ser en incrementos especificados. __DOUBLE_NEWLINE__ - La puja más alta al final, que cumpla con cualquier precio de reserva, es la puja ganadora. __DOUBLE_NEWLINE__ ## 4. Envío de Pujas __DOUBLE_NEWLINE__ - Las pujas son definitivas y vinculantes. No se permite la retractación. __DOUBLE_NEWLINE__ - Las pujas dentro de los últimos 10 minutos extienden la subasta por 10 minutos. __DOUBLE_NEWLINE__ - La puja más alta tiene prioridad después de la confirmación de la transacción. __DOUBLE_NEWLINE__ - Las pujas tardías son devueltas. __DOUBLE_NEWLINE__ - El postor más alto no puede retractarse ni superar su propia oferta. __DOUBLE_NEWLINE__ - Las nuevas pujas reembolsan automáticamente al postor más alto anterior. __DOUBLE_NEWLINE__ ## 6. Transferencia de Propiedad __DOUBLE_NEWLINE__ La propiedad se transfiere al completar el pago total de la puja ganadora. __DOUBLE_NEWLINE__ ## 7. Retiros __DOUBLE_NEWLINE__ - Se permite la retirada del monto de la subasta después de la subasta con al menos un postor. __DOUBLE_NEWLINE__ - Se aplica una tarifa de retiro del 0.1%. __DOUBLE_NEWLINE__ - Los retiros están permitidos solo después del final oficial de la subasta. __DOUBLE_NEWLINE__ ## 8. Rol de Chainbrary __DOUBLE_NEWLINE__ Chainbrary facilita la interfaz de la subasta pero no controla el contrato inteligente. No es responsable de errores o fallos. __DOUBLE_NEWLINE__ ## 9. Responsabilidad __DOUBLE_NEWLINE__ La plataforma no es responsable de problemas como la inactividad de la red o errores en la entrada de datos de los usuarios. __DOUBLE_NEWLINE__ ## 10. Modificaciones __DOUBLE_NEWLINE__ Los términos pueden modificarse sin aviso. El uso continuado implica el acuerdo con los nuevos términos. __DOUBLE_NEWLINE__ ## 11. Contáctenos __DOUBLE_NEWLINE__ Para consultas, contáctenos en [Discord](https://discord.gg/H3hFVuCrXN). __DOUBLE_NEWLINE__ Al pujar, usted afirma comprender y estar de acuerdo con estos Términos y Condiciones.
fr: Avant de procéder aux enchères, veuillez lire attentivement les conditions générales suivantes : __DOUBLE_NEWLINE__ ## 1. Accord sur les Conditions __DOUBLE_NEWLINE__ En participant à cette enchère, vous acceptez d'être lié par ces Conditions. Tous les enchérisseurs sont soumis à ces conditions, et la participation signifie l'acceptation. __DOUBLE_NEWLINE__ ## 2. Éligibilité __DOUBLE_NEWLINE__ Les participants doivent être majeurs et capables de conclure des contrats juridiquement contraignants. En enchérissant, vous confirmez répondre à ces exigences. __DOUBLE_NEWLINE__ ## 3. Processus d'enchères __DOUBLE_NEWLINE__ - L'enchère commence avec le déploiement du contrat intelligent et se poursuit jusqu'à l'heure de fin. __DOUBLE_NEWLINE__ - Les offres doivent être faites par incréments spécifiés. __DOUBLE_NEWLINE__ - L'offre la plus élevée à la fin, répondant à un prix de réserve éventuel, est l'offre gagnante. __DOUBLE_NEWLINE__ ## 4. Soumissions d'offres __DOUBLE_NEWLINE__ - Les offres sont définitives et obligatoires. Aucune rétractation n'est permise. __DOUBLE_NEWLINE__ - Les offres faites dans les 10 dernières minutes prolongent l'enchère de 10 minutes. __DOUBLE_NEWLINE__ - L'offre la plus élevée prend le dessus après confirmation de la transaction. __DOUBLE_NEWLINE__ - Les offres tardives sont renvoyées. __DOUBLE_NEWLINE__ - L'enchérisseur le plus élevé ne peut pas se rétracter ou surenchérir sur lui-même. __DOUBLE_NEWLINE__ - Les nouvelles offres remboursent automatiquement le plus haut enchérisseur précédent. __DOUBLE_NEWLINE__ ## 6. Transfert de propriété __DOUBLE_NEWLINE__ La propriété est transférée dès le règlement complet de l'offre gagnante. __DOUBLE_NEWLINE__ ## 7. Retraits __DOUBLE_NEWLINE__ - Le retrait du montant de l'enchère est autorisé après l'enchère avec au moins un enchérisseur. __DOUBLE_NEWLINE__ - Des frais de retrait de 0,1% s'appliquent. __DOUBLE_NEWLINE__ - Les retraits sont autorisés uniquement après la fin officielle de l'enchère. __DOUBLE_NEWLINE__ ## 8. Rôle de Chainbrary __DOUBLE_NEWLINE__ Chainbrary facilite l'interface d'enchère mais ne contrôle pas le contrat intelligent. Il n'est pas responsable des erreurs ou bugs. __DOUBLE_NEWLINE__ ## 9. Responsabilité __DOUBLE_NEWLINE__ La plateforme n'est pas responsable des problèmes tels que l'indisponibilité du réseau ou les erreurs d'entrée des utilisateurs. __DOUBLE_NEWLINE__ ## 10. Amendements __DOUBLE_NEWLINE__ Les conditions peuvent être modifiées sans préavis. L'utilisation continue implique l'acceptation des nouveaux termes. __DOUBLE_NEWLINE__ ## 11. Contactez-nous __DOUBLE_NEWLINE__ Pour toute demande, contactez-nous sur [Discord](https://discord.gg/H3hFVuCrXN). __DOUBLE_NEWLINE__ En enchérissant, vous affirmez comprendre et accepter ces Conditions Générales.

# btnOption.Burn
source: Burn
es: Quemar
fr: Brûler

# btnOption.ChangeOwner
source: Change Owner
es: Cambiar Propietario
fr: Changer de propriétaire

# btnOption.Desc.Burn
source: Destroy tokens to reduce the total supply.
es: Destruir tokens para reducir el suministro total.
fr: Détruisez des jetons pour réduire l'offre totale.

# btnOption.Desc.ChangeOwner
source: Assign token ownership to a different account.
es: Asignar la propiedad del token a una cuenta diferente.
fr: Attribuer la propriété du jeton à un autre compte.

# btnOption.Desc.Mint
source: Create new tokens and add them to the total supply.
es: Cree nuevos tokens y agréguelos al suministro total.
fr: Créez de nouveaux jetons et ajoutez-les à l'offre totale.

# btnOption.Desc.Pause
source: Temporarily halt all token transfers and actions.
es: Detengan temporalmente todas las transferencias de tokens y acciones.
fr: Interrompez temporairement tous les transferts de jetons et actions.

# btnOption.Desc.RenounceOwnership
source: Relinquish control and ownership of the tokens.
es: Renunciar al control y la propiedad de los tokens.
fr: Renoncez au contrôle et à la propriété des jetons.

# btnOption.Desc.Transfer
source: Move tokens from one account to another.
es: Mover tokens de una cuenta a otra.
fr: Déplacer des jetons d'un compte à un autre.

# btnOption.Desc.Unpause
source: Resume token transfers and actions.
es: Reanudar las transferencias de tokens y acciones.
fr: Reprenez les transferts de jetons et les actions.

# btnOption.Mint
source: Mint
es: Acuñar
fr: Frapper

# btnOption.Pause
source: Pause
es: Pausa

# btnOption.RenounceOwnership
source: Renounce Ownership
es: Renuncia a la Propiedad
fr: Renoncer à la propriété

# btnOption.Title.Burn
source: Burn Tokens
es: Quemar Tokens
fr: Brûler des jetons

# btnOption.Title.ChangeOwner
source: Change Owner Tokens
es: Cambiar tokens de propietario
fr: Changer les jetons du propriétaire

# btnOption.Title.Mint
source: Mint Tokens
es: Emitir tokens
fr: Créer des jetons

# btnOption.Title.Pause
source: Pause Tokens
es: Pausar Tokens
fr: Jetons de pause

# btnOption.Title.RenounceOwnership
source: Renounce Ownership
es: Renunciar a la Propiedad
fr: Renoncer à la propriété

# btnOption.Title.Transfer
source: Transfer Tokens
es: Transferir tokens
fr: Transférer des jetons

# btnOption.Title.Unpause
source: Unpause Tokens
es: Despausar Tokens
fr: Reprendre les jetons

# btnOption.Transfer
source: Transfer
es: Transferir
fr: Transférer

# btnOption.Unpause
source: Unpause
es: Reanudar
fr: Reprendre

# BugBountyProgram.Desc
source: Welcome to the Chainbrary Bug Bounty Program. Our commitment is to provide a secure and reliable platform for our users. We encourage responsible disclosure of vulnerabilities and invite security researchers to participate in this program. Our focus is predominantly on safeguarding user funds against unauthorized access and fraudulent activities.
es: Bienvenido al Programa de Recompensas por Errores de Chainbrary. Nuestro compromiso es proporcionar una plataforma segura y confiable para nuestros usuarios. Fomentamos la divulgación responsable de vulnerabilidades e invitamos a los investigadores de seguridad a participar en este programa. Nuestro enfoque está predominantemente en proteger los fondos de los usuarios contra el acceso no autorizado y las actividades fraudulentas.
fr: Bienvenue au Programme de Prime pour les Bogues de Chainbrary. Notre engagement est de fournir une plateforme sûre et fiable pour nos utilisateurs. Nous encourageons la divulgation responsable des vulnérabilités et invitons les chercheurs en sécurité à participer à ce programme. Notre focus est principalement sur la protection des fonds des utilisateurs contre l'accès non autorisé et les activités frauduleuses.

# BugBountyProgram.Title
source: Bug Bounty Program
es: Programa de Recompensas por Errores
fr: Programme de Récompense pour la Découverte de Bugs

source: Can Burn
es: Puede quemar
fr: Peut brûler

# canBurnDescription
source: Allow the contract owner to burn tokens.
es: Permitir al propietario del contrato quemar tokens.
fr: Permettre au propriétaire du contrat de détruire des jetons.

source: Can Mint
es: ¿Puede Acuñar?
fr: Peut frapper

# canMintDescription
source: Allow the contract owner to mint tokens.
es: Permita que el propietario del contrato acuñe tokens.
fr: Permettre au propriétaire du contrat de créer des jetons.

source: Can Pause
es: Puede pausar
fr: Peut mettre en pause

# canPauseDescription
source: Allow the contract owner to pause the contract.
es: Permitir al propietario del contrato pausar el contrato.
fr: Permettre au propriétaire du contrat de mettre le contrat en pause.

# commonButtonTextBack
source: Back
es: Atrás
fr: Retour

# commonButtonTextCancel
source: Cancel
es: Cancelar
fr: Annuler

# commonButtonTextConfirm
source: Confirm
es: Confirmar
fr: Confirmer

# commonButtonTextConnectWallet
source: Connect Wallet
es: Conectar billetera
fr: Connecter le portefeuille

# commonButtonTextNext
source: Next
es: Siguiente
fr: Suivant

# commonButtonTextPreview
source: Preview
es: Vista previa
fr: Aperçu

# commonButtonTextStartCreation
source: Start creation
es: Comenzar creación
fr: Commencer la création

# commonButtonTextStartJoining
source: Start joining
es: Comienza a unirte
fr: Commencez à rejoindre

# commonButtonTextSubmit
source: Submit
es: Enviar
fr: Soumettre

# commonButtonTextWithdraw
source: Withdraw
es: Retirar
fr: Retrait

# CommonErrorMessage.ConnectYourWallet
source: Please connect your wallet
es: Por favor, conecta tu billetera
fr: Veuillez connecter votre portefeuille

# CommonText.LinkCopiedToClipboard
source: Link copied to clipboard
es: Enlace copiado al portapapeles
fr: Lien copié dans le presse-papiers

# commonTextManageNow
source: Manage
es: Gestionar
fr: Gérer

# CommonTextPlaceholder.Title.BusinessName
source: Business Name
es: Nombre de empresa
fr: Nom de l'Entreprise

# CommonTextPlaceholder.Title.ScanPay
source: Scan & Pay with Crypto tokens
es: Escanear y pagar con tokens de criptomonedas
fr: Scannez & payez avec des tokens

# commonTextScanNow
source: Scan Now
es: Escanear ahora
fr: Scanner maintenant

# commonWords
source: Close
es: Cerrar
fr: Fermer

# CommunityVault.Desc
source: Community Vault mechanism, a cornerstone feature of the Chainbrary ecosystem. It intricately details how the Community Vault functions as a dynamic system for distributing rewards, ensuring that each member's contribution to the network is recognized and fairly compensated.
es: Mecanismo de la Bóveda Comunitaria, una característica fundamental del ecosistema Chainbrary. Detalla minuciosamente cómo la Bóveda Comunitaria funciona como un sistema dinámico para distribuir recompensas, asegurando que la contribución de cada miembro a la red sea reconocida y justamente compensada.
fr: Mécanisme du Coffre Communautaire, une caractéristique fondamentale de l'écosystème Chainbrary. Il détaille de manière complexe comment le Coffre Communautaire fonctionne comme un système dynamique pour distribuer les récompenses, garantissant que chaque contribution des membres au réseau est reconnue et compensée équitablement.

# CommunityVault.Title
source: Community Vault
es: Bóveda Comunitaria
fr: Coffre de la Communauté

# CommunityVaultWithdraw.Title
source: Withdraw
es: Retirar
fr: Retrait

source: Copied
es: Copiado
fr: Copié

# createTokenTitle
source: Create Token
es: Crear Token
fr: Créer un jeton

# documentLockerErrors.calculationError
source: Calculation error
es: Error de cálculo
fr: Erreur de calcul

# documentLockerErrors.contractCreationError
source: An error has occurred with your wallet. Please ensure that you are using the correct address and network. Additionally, verify that you have sufficient funds available for the document deployment on the blockchain.
es: Ha ocurrido un error con su billetera. Por favor asegúrese de que está utilizando la dirección y la red correctas. Además, verifique que tiene suficientes fondos disponibles para la implementación del documento en la blockchain.
fr: Une erreur est survenue avec votre portefeuille. Veuillez vous assurer que vous utilisez la bonne adresse et le bon réseau. De plus, vérifiez que vous avez suffisamment de fonds disponibles pour le déploiement du document sur la blockchain.

# documentLockerErrors.noAccess
source: No access
es: No acceso
fr: Aucun accès

# documentLockerErrors.notEnoughFunds
source: Not enough funds
es: Fondos insuficientes
fr: Fonds insuffisants

# documentLockerErrors.notFound
source: Not found
es: No encontrado
fr: Non trouvé

# documentLockerErrors.unknownError
source: An error occured while processing your document. Please try again.
es: Se produjo un error al procesar su documento. Por favor, intente de nuevo.
fr: Une erreur est survenue lors du traitement de votre document. Veuillez réessayer.

# documentLockerErrors.walletNotConnected
source: Wallet not connected. Please connect your wallet and try again. If you do not have a wallet, please create one.
es: Cartera no conectado. Conecte su cartera e intente de nuevo. Si no tiene una cartera, por favor cree una.
fr: Portefeuille non connecté. Veuillez connecter votre portefeuille et réessayer. Si vous n'avez pas de portefeuille, veuillez en créer un.

# documentLockerFoundTitle
source: Document Locked
es: Documento bloqueado
fr: Document Verrouillé

# documentLockerGenerateDocumentBtnText
source: Generate Document
es: Generar Documento
fr: Générer le Document

# documentLockerMakerTitle
source: Create a locked document
es: Crear un documento bloqueado
fr: Créez un document verrouillé
