Repository: etsraphael/ChainBrary
Catalog: UI/src/locale/messages.*.xlf
Languages: es, fr

# termsAndCondGlobal
source: # Chainbrary Terms and Conditions __DOUBLE_NEWLINE__ _Last Updated: 21st Feb 2024_ __DOUBLE_NEWLINE__ ### Introduction to the Terms and Conditions __DOUBLE_NEWLINE__ **Welcome to Chainbrary.** As an innovative platform at the intersection of blockchain technology and everyday utility, we are committed to ensuring a secure, transparent, and reliable experience for all our users. This document outlines the Terms and Conditions for the use of Chainbrary's services and platform. __DOUBLE_NEWLINE__ Chainbrary, functioning as a decentralized autonomous organization (DAO), places a high emphasis on user empowerment and community-driven governance. Our platform leverages blockchain technology not just for its technical benefits but also to foster a sense of ownership and involvement among our users. This Terms and Conditions document is a testament to our commitment to maintaining an environment that is safe, respectful, and conducive to positive interactions in the digital space. __DOUBLE_NEWLINE__ Through this document, we aim to clearly articulate the guidelines, rules, and expectations that govern the use of our platform. We believe in transparency and open communication and are dedicated to ensuring that our users are well-informed about their rights and responsibilities when engaging with Chainbrary. As you navigate the blockchain-based services and tools that we offer, this document will serve as a guiding framework, helping you understand how to effectively and responsibly use our platform. __DOUBLE_NEWLINE__ ### Acceptance of Terms __DOUBLE_NEWLINE__ **Interaction with Chainbrary via Blockchain Wallets:** Chainbrary's innovative approach allows users to interact with our smart contract directly using their blockchain wallets. This method eliminates the need for traditional account registration, aligning with our ethos of decentralization and user empowerment. By interacting with Chainbrary's smart contracts through a blockchain wallet, users inherently agree to abide by these Terms and Conditions. __DOUBLE_NEWLINE__ **No Formal Sign-Up Process:** As Chainbrary does not require a formal account sign-up process, the act of using our services through a blockchain wallet is considered an implicit agreement to these Terms and Conditions. Users are responsible for understanding and complying with these terms as part of their interaction with Chainbrary. __DOUBLE_NEWLINE__ **Public Announcements and Communication:** Chainbrary values open and transparent communication with our community. We do not engage in direct email communication. Instead, all significant announcements and updates regarding Chainbrary, including changes to these Terms and Conditions, will be made through our official social media channels and community groups. Users are encouraged to follow these channels to stay informed about any updates or changes. __DOUBLE_NEWLINE__ **Continuous Engagement and Agreement:** By continuing to use Chainbrary's services, users reaffirm their agreement to the current version of the Terms and Conditions. It is the responsibility of the users to remain informed about any changes to these terms, which will be communicated as stated above. __DOUBLE_NEWLINE__ ### Modifications to Terms __DOUBLE_NEWLINE__ **Adaptability and Revision of Terms:** Chainbrary acknowledges the dynamic nature of the blockchain industry and the need for our Terms and Conditions to evolve alongside technological and legal developments. Therefore, we reserve the right to modify these terms periodically to reflect changes in our services, legal requirements, user feedback, or advancements in blockchain technology. __DOUBLE_NEWLINE__ **Notification of Changes:** In keeping with our commitment to transparency and open communication, any significant modifications to these Terms and Conditions will be announced through our official social media channels and community groups. This approach ensures that all users have equal and immediate access to the latest information regarding our terms. __DOUBLE_NEWLINE__ **Effective Date of Revised Terms:** Each announcement regarding changes to the Terms and Conditions will clearly specify the effective date of the revised terms. This information helps users understand when the new terms will come into effect, allowing them to review and adapt to the changes. __DOUBLE_NEWLINE__ **Engagement and User Feedback:** While formal consent for each update may not be sought, we encourage active engagement from our users in reviewing and understanding the changes. Feedback on the updates is always welcomed, and we value user participation in the ongoing development of our platform. __DOUBLE_NEWLINE__ **User Responsibility for Regular Review:** Users are advised to periodically review the Terms and Conditions, particularly when notified of modifications. Staying informed about the terms of use is crucial for a seamless and compliant experience on Chainbrary. __DOUBLE_NEWLINE__ ### User Registration and Accounts __DOUBLE_NEWLINE__ **Wallet-Based Interaction:** At Chainbrary, we embrace the decentralized nature of blockchain technology. Consequently, our platform does not require traditional account registration. Instead, users interact with Chainbrary's services directly through their blockchain wallets. This wallet-based interaction simplifies the process and aligns with our commitment to user privacy and security. __DOUBLE_NEWLINE__ **Implicit Agreement to Terms:** By choosing to engage with Chainbrary through a blockchain wallet, users implicitly agree to our Terms and Conditions. This agreement is established at the point of interaction with the smart contract, without the need for a separate acceptance process. __DOUBLE_NEWLINE__ **Anonymity and Security:** Chainbrary does not collect personal information as part of this interaction. Users maintain their anonymity, with only their public wallet addresses being involved in transactions. This approach ensures a high level of security and privacy, as inherent to blockchain technology. __DOUBLE_NEWLINE__ **User Responsibility:** Users are responsible for managing their blockchain wallets and ensuring the security of their private keys. Chainbrary is not liable for any loss or compromise arising from the user's management of their blockchain wallet. __DOUBLE_NEWLINE__ **No Email Communications:** Consistent with our decentralized and privacy-focused approach, Chainbrary does not engage in direct email communications with users. All public announcements, including changes to these Terms and Conditions, will be communicated through our official social media channels and community groups. __DOUBLE_NEWLINE__ **Continued Use as Agreement:** The ongoing use of Chainbrary's services via a blockchain wallet reaffirms the user's acceptance of the current Terms and Conditions. Users are encouraged to stay informed about any changes to these terms through our designated communication channels. __DOUBLE_NEWLINE__ ### Use of Chainbrary Services __DOUBLE_NEWLINE__ **Limitations of Use:** __DOUBLE_NEWLINE__ While Chainbrary is committed to providing a broad range of services, there are certain limitations to what we offer: __DOUBLE_NEWLINE__ - **No Creation of Proprietary Tokens:** Chainbrary is designed as a versatile hub for various blockchain communities and does not intend to create proprietary tokens. __DOUBLE_NEWLINE__ - **Neutrality Across Networks and Projects:** Chainbrary maintains a neutral stance, not favoring any specific blockchain network, project, or wallet, thereby ensuring inclusivity and freedom of choice for users. __DOUBLE_NEWLINE__ **User Responsibilities:** __DOUBLE_NEWLINE__ Users engaging with Chainbrary's services are expected to: __DOUBLE_NEWLINE__ - **Adhere to Legal and Ethical Standards:** Ensure that their use of Chainbrary's services complies with the laws and regulations of their respective jurisdictions. __DOUBLE_NEWLINE__ - **Respect the Integrity of the Platform:** Avoid any activities that could harm the functionality or reputation of Chainbrary. __DOUBLE_NEWLINE__ - **Maintain the Security of Their Wallets:** As interactions are wallet-based, users must ensure the security of their private keys and wallet information. __DOUBLE_NEWLINE__ **Service Updates and Improvements:** __DOUBLE_NEWLINE__ Chainbrary is committed to the continuous enhancement of its services. Users should be aware that: __DOUBLE_NEWLINE__ - **Updates to Services:** Chainbrary may update or modify its services to improve functionality, user experience, or compliance with regulatory standards. __DOUBLE_NEWLINE__ - **Notification of Changes:** Any significant changes to the services will be communicated through Chainbrary's official social media channels and community groups. __DOUBLE_NEWLINE__ ### Intellectual Property Rights __DOUBLE_NEWLINE__ **Ownership of Chainbrary Content:** All content and material available on Chainbrary, including but not limited to text, graphics, logos, icons, images, and software, are the property of Chainbrary or its content suppliers and protected by intellectual property laws. The compilation of this content on the platform constitutes the exclusive property of Chainbrary and is similarly protected. __DOUBLE_NEWLINE__ **User-Generated Content:** Users may contribute content in various forms (e.g., feedback, suggestions) through community channels. However, it's important to note that such contributions do not confer any ownership rights to the users on Chainbrary's platform or its intellectual property. __DOUBLE_NEWLINE__ **License to Use Chainbrary Services:** Chainbrary grants users a limited, non-exclusive, non-transferable license to access and use the services offered by Chainbrary for personal, non-commercial purposes as per these Terms and Conditions. This license does not include any rights to resell or commercially use the Chainbrary content; collect and use any product listings, descriptions, or prices; any derivative use of Chainbrary's services or its contents; or any use of data mining, robots, or similar data gathering and extraction tools. __DOUBLE_NEWLINE__ **Prohibition of Infringement:** Users must respect the intellectual property rights of Chainbrary and others. Any unauthorized use or reproduction of the material provided on the Chainbrary platform, or any infringement of intellectual property rights, could subject the user to legal action. __DOUBLE_NEWLINE__ **Trademark Information:** The Chainbrary name and logo, and all related product and service names, design marks, and slogans are the trademarks or service marks of Chainbrary. Users are not allowed to use any of these marks without the prior written consent of Chainbrary. __DOUBLE_NEWLINE__ **No Transfer of Intellectual Property:** Engagement with Chainbrary's services or platform does not constitute a transfer or granting of any intellectual property rights to the users, either explicitly or implicitly. __DOUBLE_NEWLINE__ ### User Responsibilities and Conduct __DOUBLE_NEWLINE__ **Compliance with Laws and Regulations:** Users of Chainbrary are required to comply with all applicable laws and regulations in their respective jurisdictions. This includes, but is not limited to, regulations pertaining to blockchain technology, financial transactions, and online conduct. __DOUBLE_NEWLINE__ **Ethical Use of Services:** Users must use Chainbrary's services ethically and responsibly. This includes refraining from any form of misuse or malicious activities that could harm the platform, other users, or the wider blockchain community. __DOUBLE_NEWLINE__ **Respect for Intellectual Property:** Users should respect the intellectual property rights of Chainbrary and third parties. Any unauthorized use of Chainbrary's content or infringement of intellectual property rights is strictly prohibited. __DOUBLE_NEWLINE__ **Security of Blockchain Wallets:** Given that Chainbrary operates on a wallet-based interaction system, users are responsible for the security of their blockchain wallets. This includes safeguarding private keys and ensuring secure transactions. __DOUBLE_NEWLINE__ **No Unauthorized Access or Interference:** Users must not attempt to gain unauthorized access to Chainbrary's systems or engage in activities that could interfere with the operation of the platform. This includes avoiding any actions that could overload or damage Chainbrary's infrastructure. __DOUBLE_NEWLINE__ **Reporting Misuse and Vulnerabilities:** Users are encouraged to report any misuse of the platform or vulnerabilities they discover. This cooperation is vital for maintaining the security and integrity of Chainbrary. __DOUBLE_NEWLINE__ **Prohibited Activities:** Chainbrary prohibits activities such as fraud, money laundering, and other illegal transactions. Users engaging in such activities will face appropriate legal action and may be barred from using the platform. __DOUBLE_NEWLINE__ **Community Engagement and Feedback:** Users are encouraged to actively participate in Chainbrary's community channels, providing feedback and suggestions for improvements. Constructive engagement helps in fostering a vibrant and collaborative ecosystem. __DOUBLE_NEWLINE__ **Limitations on Liability:** Users should understand that interactions with smart contracts and blockchain technologies carry inherent risks. Chainbrary is not liable for any losses incurred due to vulnerabilities in smart contract code or blockchain technology. __DOUBLE_NEWLINE__ ### Privacy and Data Protection __DOUBLE_NEWLINE__ **Commitment to Privacy:** At Chainbrary, we place a high value on privacy and the security of user data. Our approach to data protection is deeply integrated with the inherent security features of blockchain technology, ensuring that user privacy is respected and maintained. __DOUBLE_NEWLINE__ **Data Collection and Usage:** __DOUBLE_NEWLINE__ 1. **Blockchain-Based Data:** Our primary data collection revolves around blockchain transactions. This includes public transaction IDs, wallet addresses, and smart contract interactions. Due to the nature of blockchain technology, this information is inherently public and not confidential. __DOUBLE_NEWLINE__ 2. **Minimal Personal Data Collection:** Chainbrary's operations are designed to collect minimal personal data. We only gather essential information required for effective operation and user experience, adhering to our principle of privacy and transparency. __DOUBLE_NEWLINE__ 3. **Use of Aggregate Data:** For platform enhancement purposes, we may use web analytics tools to gather aggregate data about site usage and visitor behavior. This data is collected in an aggregated form and does not allow for individual user identification. __DOUBLE_NEWLINE__ **Data Storage and Security:** __DOUBLE_NEWLINE__ - **Blockchain Data Storage:** All user-related data, including transactional records and wallet addresses, is stored exclusively on the blockchain, ensuring a high level of security and transparency. __DOUBLE_NEWLINE__ - **No Off-Chain Data Storage:** Chainbrary does not store any user data off-chain, aligning with our commitment to the security and transparency inherent in blockchain technology. __DOUBLE_NEWLINE__ **User Consent and Control:** __DOUBLE_NEWLINE__ - **Voluntary Data Sharing:** Users may choose to provide additional information voluntarily, such as feedback through community channels or participation in surveys. This information is used solely to enhance our services. __DOUBLE_NEWLINE__ - **Control Over Personal Data:** Users have control over their data on the blockchain, maintaining privacy through their private keys. __DOUBLE_NEWLINE__ **Public Nature of Blockchain Data:** __DOUBLE_NEWLINE__ - Users should be aware that data stored on the blockchain, including transaction histories and wallet addresses, is publicly visible. While blockchain data does not directly disclose personal identities, users should be mindful of the information they transact on the blockchain. __DOUBLE_NEWLINE__ **Adaptation to Blockchain Advancements:** __DOUBLE_NEWLINE__ - Our approach to data storage and security evolves with advancements in blockchain technology. We are committed to adapting our strategies to ensure the highest level of data integrity and security for our users. __DOUBLE_NEWLINE__ **Communication and Transparency:** __DOUBLE_NEWLINE__ - Chainbrary maintains open and transparent communication regarding our privacy practices. We encourage users to regularly review our Privacy Policy for updates and to understand their rights and responsibilities. __DOUBLE_NEWLINE__ ### Blockchain-Specific Terms __DOUBLE_NEWLINE__ **Integration of Blockchain Technology:** Chainbrary leverages blockchain technology to provide innovative and secure services. The use of blockchain technology is fundamental to the operation of Chainbrary, offering advantages such as decentralized control, increased security, and transparency. __DOUBLE_NEWLINE__ **Smart Contract Interactions:** Users interact with Chainbrary's services via smart contracts. These contracts are self-executing with the terms of the agreement between buyer and seller directly written into lines of code. The code and the agreements contained therein exist across a distributed, decentralized blockchain network. __DOUBLE_NEWLINE__ **Wallet-Based Transactions:** Transactions on Chainbrary are conducted using blockchain wallets. Users must have a compatible blockchain wallet to interact with our services. The wallet acts as a user's identity and transaction mechanism on the platform. __DOUBLE_NEWLINE__ **Blockchain Data Publicity:** Users should understand that due to the nature of blockchain technology, certain transaction details such as wallet addresses and transaction hashes are publicly visible on the blockchain. Chainbrary does not have control over the visibility of this data. __DOUBLE_NEWLINE__ **User Responsibility in Blockchain Transactions:** Users are responsible for the security and management of their own blockchain wallets, including keeping their private keys confidential. Chainbrary is not responsible for any loss or compromise of blockchain wallet data. __DOUBLE_NEWLINE__ **Decentralization and Autonomy:** Chainbrary operates as a decentralized platform, which means that it is not controlled by any single entity. This decentralization is a core aspect of our platform and influences how services are delivered and governed. __DOUBLE_NEWLINE__ **Compliance with Blockchain Regulations:** Chainbrary adheres to all applicable laws and regulations governing blockchain technology and digital assets. Users are responsible for ensuring that their use of Chainbrary's services complies with the laws and regulations in their jurisdiction. __DOUBLE_NEWLINE__ **Adaptation to Technological Changes:** The blockchain landscape is continually evolving. Chainbrary reserves the right to adapt and update its services in response to technological advancements in blockchain technology. __DOUBLE_NEWLINE__ ### Limitations of Liability __DOUBLE_NEWLINE__ **Scope of Liability:** __DOUBLE_NEWLINE__ - **General Disclaimer:** Chainbrary provides its services on an "as is" and "as available" basis without any warranties, either express or implied, including but not limited to the implied warranties of merchantability, fitness for a particular purpose, or non-infringement. Chainbrary does not guarantee the continuous, uninterrupted, error-free, or secure access to its services or that any defects in the service will be corrected. __DOUBLE_NEWLINE__ **User Responsibility:** __DOUBLE_NEWLINE__ - **Risk in Blockchain Transactions:** Users acknowledge that engaging in blockchain transactions involves risks. Chainbrary is not responsible for any loss or damage incurred as a result of such transactions or the inherent risks of blockchain technology. __DOUBLE_NEWLINE__ - **Security of Wallet:** Users are solely responsible for the security and management of their own blockchain wallets. Chainbrary is not liable for any loss or compromise arising from unauthorized access to or use of user wallets. __DOUBLE_NEWLINE__ **Limitation on Damages:** __DOUBLE_NEWLINE__ - **Cap on Liability:** To the fullest extent permitted by applicable law, Chainbrary shall not be liable for any indirect, incidental, special, consequential, or punitive damages, or any loss of profits or revenues, whether incurred directly or indirectly, or any loss of data, use, goodwill, or other intangible losses. __DOUBLE_NEWLINE__ - **Transaction Issues:** Chainbrary is not responsible for any issues related to the execution of blockchain transactions, including but not limited to failed transactions, high transaction fees, or delayed transaction processing. __DOUBLE_NEWLINE__ **Indemnification:** __DOUBLE_NEWLINE__ - **User Indemnification:** Users agree to indemnify and hold harmless Chainbrary and its officers, directors, employees, and agents from any claims, damages, losses, liabilities, and expenses, including attorneys' fees, arising out of or in connection with their use of Chainbrary's services, violation of these Terms, or violation of any rights of a third party. __DOUBLE_NEWLINE__ **External Links:** __DOUBLE_NEWLINE__ - **Third-Party Sites:** Chainbrary may contain links to third-party websites or resources. Chainbrary is not responsible for the availability, accuracy, content, products, or services of such external sites. __DOUBLE_NEWLINE__ ### Dispute Resolution and Governing Law __DOUBLE_NEWLINE__ **Governing Law:** __DOUBLE_NEWLINE__ - **Jurisdiction:** The Terms and Conditions of Chainbrary are governed by and construed in accordance with the laws of the jurisdiction where Chainbrary is headquartered. This choice of jurisdiction is intended to provide clarity and predictability in the interpretation and enforcement of these terms. __DOUBLE_NEWLINE__ **Dispute Resolution:** __DOUBLE_NEWLINE__ - **Negotiation and Mediation:** In the event of any dispute, claim, or controversy arising out of or relating to these Terms and Conditions, or the breach, termination, enforcement, interpretation, or validity thereof, the parties shall first seek to resolve the dispute through amicable negotiation. If the dispute cannot be resolved by negotiation, the parties agree to attempt to resolve the dispute through mediation before resorting to litigation. __DOUBLE_NEWLINE__ - **Litigation:** If negotiation and mediation do not resolve the dispute, the parties agree that any legal action or proceeding arising under these Terms and Conditions shall be brought exclusively in the courts located in the jurisdiction as mentioned above. By agreeing to these terms, users consent to the jurisdiction and venue in such courts. __DOUBLE_NEWLINE__ **No Class Actions:** __DOUBLE_NEWLINE__ - **Individual Basis:** Users agree that any disputes will be resolved on an individual basis and not in a class, consolidated, or representative action. If for any reason a claim proceeds in court rather than in arbitration, both parties waive any right to a jury trial. __DOUBLE_NEWLINE__ **Limitation on Time to File Claims:** __DOUBLE_NEWLINE__ - **Time Constraint:** Any cause of action or claim a user may have arising out of or relating to these Terms and Conditions must be commenced within one year after the cause of action accrues; otherwise, such cause of action or claim is permanently barred. __DOUBLE_NEWLINE__ **Changes to Dispute Resolution Terms:** __DOUBLE_NEWLINE__ - **Updates and Modifications:** Chainbrary reserves the right to modify this Dispute Resolution and Governing Law section at any time. All changes will be effective immediately upon posting to the website and will apply to all disputes arising under the Terms and Conditions from the date of posting forward. Continued use of Chainbrary's services constitutes agreement to the modified terms. __DOUBLE_NEWLINE__ ### Termination and Suspension of Services __DOUBLE_NEWLINE__ **Circumstances Affecting Service Access:** __DOUBLE_NEWLINE__ - **External Factors:** While Chainbrary operates as a decentralized platform and does not have the capability to suspend individual user accounts, external factors may affect a user's access to Chainbrary's services. This includes situations where tokens or protocols centralized in the Chainbrary ecosystem might be affected by actions from third-party entities, such as freezing of addresses. __DOUBLE_NEWLINE__ **Responsibility for External Account Actions:** __DOUBLE_NEWLINE__ - **Third-Party Control:** Users should be aware that certain aspects of their interaction with Chainbrary, particularly those involving external tokens or protocols, might be subject to control by third-party entities. Chainbrary has no control over these external actions and cannot be held responsible for any resulting limitations, suspensions, or changes in service availability. __DOUBLE_NEWLINE__ - **User Awareness:** Users are responsible for staying informed about the status and terms of third-party tokens and protocols integrated with Chainbrary and understanding how these might impact their access and use of Chainbrary's services. __DOUBLE_NEWLINE__ **Continuity of Services:** __DOUBLE_NEWLINE__ - **Chainbrary's Commitment:** Chainbrary is dedicated to providing continuous, uninterrupted service to its users. However, it must be acknowledged that the decentralized nature of blockchain technology and reliance on external protocols and tokens means that certain aspects of service availability may be beyond Chainbrary's direct control. __DOUBLE_NEWLINE__ **User Recourse:** __DOUBLE_NEWLINE__ - **Community Support:** In the event of disruptions caused by external factors, users are encouraged to seek guidance and support through Chainbrary's community channels. These platforms serve as a resource for information sharing and community assistance. __DOUBLE_NEWLINE__ ### Contact and Queries Section __DOUBLE_NEWLINE__ **Open Channels for Communication and Support:** Chainbrary is committed to providing a supportive environment where open communication is prioritized. We understand the importance of addressing queries, concerns, and feedback as they are crucial for the continuous improvement of our platform and community relations. __DOUBLE_NEWLINE__ 1. **Primary Contact Method:** __DOUBLE_NEWLINE__ - **Community Channels:** For any questions, concerns, or feedback regarding our services or any aspect of our platform, users are encouraged to reach out through our community channels, primarily on Discord. This platform facilitates real-time interaction and ensures prompt attention from our team. __DOUBLE_NEWLINE__ 2. **Support and Response:** __DOUBLE_NEWLINE__ - **Dedicated Support Team:** Our support team is actively present on Discord to address user inquiries. We strive to provide timely and helpful responses to all questions, ensuring that users feel heard and supported. __DOUBLE_NEWLINE__ - **Community Engagement:** We also foster an environment where community members can assist each other, leveraging the collective knowledge and experiences of our user base. __DOUBLE_NEWLINE__ 3. **Feedback and Suggestions:** __DOUBLE_NEWLINE__ - **Open to User Input:** Chainbrary values the input and suggestions from our community. Users are encouraged to share their ideas and feedback, which play a crucial role in shaping our policies and platform developments. __DOUBLE_NEWLINE__ - **Transparent Consideration Process:** All user feedback is carefully considered by our team. While we may not be able to implement every suggestion, we ensure that each idea is given due consideration and response. __DOUBLE_NEWLINE__ 4. **Issues and Concerns:** __DOUBLE_NEWLINE__ - **Resolution Process:** For issues or concerns, especially those related to privacy or data usage, users can reach out directly on our Discord channel. We have protocols in place to escalate and address such matters with the seriousness and discretion they deserve. __DOUBLE_NEWLINE__ - **Continuous Improvement:** User-reported issues are not only addressed but also analyzed for potential improvements in our policies and practices. __DOUBLE_NEWLINE__ **Your Voice Matters:** At Chainbrary, we believe in the power of community-driven growth and improvement. Our channels are always open for your voices, ensuring that your experience with Chainbrary is not only secure and private but also collaborative and responsive. __DOUBLE_NEWLINE__ ### Final Summary and Effective Date of Terms and Conditions __DOUBLE_NEWLINE__ **Effective Date:** __DOUBLE_NEWLINE__ - The Terms and Conditions for Chainbrary are effective as of 21st February 2024. This date marks the commencement of the terms that govern the use of Chainbrary's services. __DOUBLE_NEWLINE__ - We encourage all users to regularly review the Terms and Conditions to stay informed about their rights and responsibilities when using Chainbrary. It is essential to understand how these terms affect your interaction with our platform. __DOUBLE_NEWLINE__ **Our Commitment to Users:** __DOUBLE_NEWLINE__ - Chainbrary is steadfast in its commitment to providing a secure, transparent, and user-focused experience. We understand the importance of maintaining a platform that aligns with the evolving nature of blockchain technology and the needs of our community. __DOUBLE_NEWLINE__ - We assure our users that we will continuously refine and update our practices and policies to meet the highest standards of functionality and user protection. Your trust and confidence in Chainbrary are of utmost importance, and we are dedicated to upholding that trust through every action and decision we make. __DOUBLE_NEWLINE__ **Closing Statement:** __DOUBLE_NEWLINE__ - As we navigate the dynamic and innovative realm of blockchain technology, Chainbrary pledges to be a responsible and forward-thinking leader in this space. Our mission is to provide a platform that not only leverages the benefits of blockchain but also ensures a safe, respectful, and empowering environment for all our users.
es: # Términos y Condiciones de Chainbrary __DOUBLE_NEWLINE__ _Última Actualización: 21 de Feb de 2024_ __DOUBLE_NEWLINE__ ### Introducción a los Términos y Condiciones __DOUBLE_NEWLINE__ **Bienvenido a Chainbrary.** Como una plataforma innovadora en la intersección de la tecnología blockchain y la utilidad cotidiana, estamos comprometidos a garantizar una experiencia segura, transparente y confiable para todos nuestros usuarios. Este documento describe los Términos y Condiciones para el uso de los servicios y la plataforma de Chainbrary. __DOUBLE_NEWLINE__ Chainbrary, funcionando como una organización autónoma descentralizada (DAO), pone un gran énfasis en el empoderamiento del usuario y la gobernanza impulsada por la comunidad. Nuestra plataforma aprovecha la tecnología blockchain no solo por sus beneficios técnicos, sino también para fomentar un sentido de propiedad y participación entre nuestros usuarios. Este documento de Términos y Condiciones es un testimonio de nuestro compromiso de mantener un entorno seguro, respetuoso y propicio para interacciones positivas en el espacio digital. __DOUBLE_NEWLINE__ A través de este documento, nuestro objetivo es articular claramente las pautas, reglas y expectativas que rigen el uso de nuestra plataforma. Creemos en la transparencia y la comunicación abierta y estamos dedicados a garantizar que nuestros usuarios estén bien informados sobre sus derechos y responsabilidades al interactuar con Chainbrary. A medida que navega por los servicios y herramientas basados en blockchain que ofrecemos, este documento servirá como un marco guía, ayudándole a comprender cómo usar nuestra plataforma de manera efectiva y responsable. __DOUBLE_NEWLINE__ ### Aceptación de los Términos __DOUBLE_NEWLINE__ **Interacción con Chainbrary a través de Carteras Blockchain:** El enfoque innovador de Chainbrary permite a los usuarios interactuar con nuestro contrato inteligente directamente usando sus carteras blockchain. Este método elimina la necesidad de registro de cuenta tradicional, alineándose con nuestra ética de descentralización y empoderamiento del usuario. Al interactuar con los contratos inteligentes de Chainbrary a través de una cartera blockchain, los usuarios aceptan inherentemente cumplir con estos Términos y Condiciones. __DOUBLE_NEWLINE__ **Sin Proceso Formal de Registro:** Dado que Chainbrary no requiere un proceso formal de registro de cuenta, el acto de usar nuestros servicios a través de una cartera blockchain se considera una aceptación implícita de estos Términos y Condiciones. Los usuarios son responsables de entender y cumplir con estos términos como parte de su interacción con Chainbrary. __DOUBLE_NEWLINE__ **Anuncios Públicos y Comunicación:** Chainbrary valora la comunicación abierta y transparente con nuestra comunidad. No nos comprometemos en comunicaciones directas por correo electrónico. En su lugar, todos los anuncios y actualizaciones significativas sobre Chainbrary, incluyendo cambios en estos Términos y Condiciones, se harán a través de nuestros canales oficiales de redes sociales y grupos comunitarios. Se alienta a los usuarios a seguir estos canales para mantenerse informados sobre cualquier actualización o cambio. __DOUBLE_NEWLINE__ **Compromiso Continuo y Acuerdo:** Al continuar usando los servicios de Chainbrary, los usuarios reafirman su acuerdo con la versión actual de los Términos y Condiciones. Es responsabilidad de los usuarios mantenerse informados sobre cualquier cambio en estos términos, que se comunicarán como se indicó anteriormente. __DOUBLE_NEWLINE__ ### Modificaciones a los Términos __DOUBLE_NEWLINE__ **Adaptabilidad y Revisión de los Términos:** Chainbrary reconoce la naturaleza dinámica de la industria blockchain y la necesidad de que nuestros Términos y Condiciones evolucionen junto con los desarrollos tecnológicos y legales. Por lo tanto, nos reservamos el derecho de modificar estos términos periódicamente para reflejar cambios en nuestros servicios, requisitos legales, comentarios de los usuarios o avances en la tecnología blockchain. __DOUBLE_NEWLINE__ **Notificación de Cambios:** En consonancia con nuestro compromiso con la transparencia y la comunicación abierta, cualquier modificación significativa de estos Términos y Condiciones se anunciará a través de nuestros canales oficiales de redes sociales y grupos comunitarios. Este enfoque garantiza que todos los usuarios tengan acceso igual y inmediato a la información más reciente sobre nuestros términos. __DOUBLE_NEWLINE__ **Fecha de Entrada en Vigor de los Términos Revisados:** Cada anuncio sobre cambios en los Términos y Condiciones especificará claramente la fecha de entrada en vigor de los términos revisados. Esta información ayuda a los usuarios a entender cuándo entrarán en vigor los nuevos términos, permitiéndoles revisar y adaptarse a los cambios. __DOUBLE_NEWLINE__ **Participación y Retroalimentación del Usuario:** Aunque no se buscará el consentimiento formal para cada actualización, alentamos la participación activa de nuestros usuarios en la revisión y comprensión de los cambios. Siempre se recibe con agrado la retroalimentación sobre las actualizaciones, y valoramos la participación de los usuarios en el desarrollo continuo de nuestra plataforma. __DOUBLE_NEWLINE__ **Responsabilidad del Usuario para la Revisión Regular:** Se aconseja a los usuarios que revisen periódicamente los Términos y Condiciones, particularmente cuando se les notifique sobre modificaciones. Mantenerse informado sobre los términos de uso es crucial para una experiencia sin problemas y conforme en Chainbrary. __DOUBLE_NEWLINE__ ### Registro y Cuentas de Usuarios __DOUBLE_NEWLINE__ **Interacción Basada en Carteras:** En Chainbrary, adoptamos la naturaleza descentralizada de la tecnología blockchain. En consecuencia, nuestra plataforma no requiere un registro de cuenta tradicional. En su lugar, los usuarios interactúan con los servicios de Chainbrary directamente a través de sus carteras blockchain. Esta interacción basada en carteras simplifica el proceso y se alinea con nuestro compromiso con la privacidad y seguridad del usuario. __DOUBLE_NEWLINE__ **Acuerdo Implícito con los Términos:** Al elegir interactuar con Chainbrary a través de una cartera blockchain, los usuarios aceptan implícitamente nuestros Términos y Condiciones. Este acuerdo se establece en el punto de interacción con el contrato inteligente, sin necesidad de un proceso de aceptación separado. __DOUBLE_NEWLINE__ **Anonimato y Seguridad:** Chainbrary no recopila información personal como parte de esta interacción. Los usuarios mantienen su anonimato, con solo sus direcciones públicas de cartera involucradas en las transacciones. Este enfoque asegura un alto nivel de seguridad y privacidad, inherente a la tecnología blockchain. __DOUBLE_NEWLINE__ **Responsabilidad del Usuario:** Los usuarios son responsables de gestionar sus carteras blockchain y garantizar la seguridad de sus claves privadas. Chainbrary no es responsable de ninguna pérdida o compromiso que surja de la gestión de la cartera blockchain del usuario. __DOUBLE_NEWLINE__ **Sin Comunicaciones por Correo Electrónico:** Consistente con nuestro enfoque descentralizado y enfocado en la privacidad, Chainbrary no se compromete en comunicaciones directas por correo electrónico con los usuarios. Todos los anuncios públicos, incluidos los cambios en estos Términos y Condiciones, se comunicarán a través de nuestros canales oficiales de redes sociales y grupos comunitarios. __DOUBLE_NEWLINE__ **Uso Continuo como Acuerdo:** El uso continuo de los servicios de Chainbrary a través de una cartera blockchain reafirma la aceptación del usuario de los Términos y Condiciones actuales. Se alienta a los usuarios a mantenerse informados sobre cualquier cambio en estos términos a través de nuestros canales de comunicación designados. __DOUBLE_NEWLINE__ ### Uso de los Servicios de Chainbrary __DOUBLE_NEWLINE__ **Limitaciones de Uso:** __DOUBLE_NEWLINE__ Aunque Chainbrary se compromete a proporcionar una amplia gama de servicios, existen ciertas limitaciones en lo que ofrecemos: __DOUBLE_NEWLINE__ - **No Creación de Tokens Propietarios:** Chainbrary está diseñado como un centro versátil para varias comunidades blockchain y no pretende crear tokens propietarios. __DOUBLE_NEWLINE__ - **Neutralidad en Redes y Proyectos:** Chainbrary mantiene una postura neutral, no favoreciendo ninguna red blockchain, proyecto o cartera específicos, asegurando así la inclusividad y la libertad de elección para los usuarios. __DOUBLE_NEWLINE__ **Responsabilidades del Usuario:** __DOUBLE_NEWLINE__ Se espera que los usuarios que interactúan con los servicios de Chainbrary: __DOUBLE_NEWLINE__ - **Cumplan con Normas Legales y Éticas:** Aseguren que el uso de los servicios de Chainbrary cumpla con las leyes y regulaciones de sus respectivas jurisdicciones. __DOUBLE_NEWLINE__ - **Respeten la Integridad de la Plataforma:** Eviten cualquier actividad que pueda dañar la funcionalidad o la reputación de Chainbrary. __DOUBLE_NEWLINE__ - **Mantengan la Seguridad de sus Carteras:** Dado que las interacciones son basadas en carteras, los usuarios deben garantizar la seguridad de sus claves privadas y la información de sus carteras. __DOUBLE_NEWLINE__ **Actualizaciones y Mejoras del Servicio:** __DOUBLE_NEWLINE__ Chainbrary está comprometido con la mejora continua de sus servicios. Los usuarios deben ser conscientes de que: __DOUBLE_NEWLINE__ - **Actualizaciones de Servicios:** Chainbrary puede actualizar o modificar sus servicios para mejorar la funcionalidad, la experiencia del usuario o el cumplimiento con las normas regulatorias. __DOUBLE_NEWLINE__ - **Notificación de Cambios:** Cualquier cambio significativo en los servicios se comunicará a través de los canales oficiales de redes sociales y grupos comunitarios de Chainbrary. __DOUBLE_NEWLINE__ ### Derechos de Propiedad Intelectual __DOUBLE_NEWLINE__ **Propiedad del Contenido de Chainbrary:** Todo el contenido y material disponible en Chainbrary, incluyendo pero no limitado a textos, gráficos, logotipos, iconos, imágenes y software, son propiedad de Chainbrary o de sus proveedores de contenido y están protegidos por leyes de propiedad intelectual. La compilación de este contenido en la plataforma constituye la propiedad exclusiva de Chainbrary y está igualmente protegida. __DOUBLE_NEWLINE__ **Contenido Generado por los Usuarios:** Los usuarios pueden contribuir con contenido en varias formas (por ejemplo, retroalimentación, sugerencias) a través de los canales comunitarios. Sin embargo, es importante notar que tales contribuciones no confieren ningún derecho de propiedad a los usuarios sobre la plataforma de Chainbrary o su propiedad intelectual. __DOUBLE_NEWLINE__ **Licencia para Usar los Servicios de Chainbrary:** Chainbrary otorga a los usuarios una licencia limitada, no exclusiva y no transferible para acceder y usar los servicios ofrecidos por Chainbrary para fines personales y no comerciales según estos Términos y Condiciones. Esta licencia no incluye ningún derecho de revender o usar comercialmente el contenido de Chainbrary; recopilar y usar cualquier lista de productos, descripciones o precios; cualquier uso derivado de los servicios de Chainbrary o su contenido; o cualquier uso de minería de datos, robots o herramientas similares de recopilación y extracción de datos. __DOUBLE_NEWLINE__ **Prohibición de Infracción:** Los usuarios deben respetar los derechos de propiedad intelectual de Chainbrary y de terceros. Cualquier uso no autorizado o reproducción del material proporcionado en la plataforma de Chainbrary, o cualquier infracción de los derechos de propiedad intelectual, podría someter al usuario a acciones legales. __DOUBLE_NEWLINE__ **Información de Marcas Registradas:** El nombre y el logotipo de Chainbrary, y todos los nombres de productos y servicios relacionados, marcas de diseño y lemas son marcas registradas o marcas de servicio de Chainbrary. Los usuarios no están autorizados a usar ninguna de estas marcas sin el consentimiento previo por escrito de Chainbrary. __DOUBLE_NEWLINE__ **No Transferencia de Propiedad Intelectual:** La interacción con los servicios o la plataforma de Chainbrary no constituye una transferencia ni concesión de ningún derecho de propiedad intelectual a los usuarios, ya sea de manera explícita o implícita. __DOUBLE_NEWLINE__ ### Responsabilidades y Conducta del Usuario __DOUBLE_NEWLINE__ **Cumplimiento con las Leyes y Regulaciones:** Los usuarios de Chainbrary están obligados a cumplir con todas las leyes y regulaciones aplicables en sus respectivas jurisdicciones. Esto incluye, pero no se limita a, regulaciones relacionadas con la tecnología blockchain, transacciones financieras y conducta en línea. __DOUBLE_NEWLINE__ **Uso Ético de los Servicios:** Los usuarios deben utilizar los servicios de Chainbrary de manera ética y responsable. Esto incluye abstenerse de cualquier forma de uso indebido o actividades maliciosas que puedan dañar la plataforma, a otros usuarios o a la comunidad blockchain en general. __DOUBLE_NEWLINE__ **Respeto a la Propiedad Intelectual:** Los usuarios deben respetar los derechos de propiedad intelectual de Chainbrary y de terceros. Cualquier uso no autorizado del contenido de Chainbrary o infracción de los derechos de propiedad intelectual está estrictamente prohibido. __DOUBLE_NEWLINE__ **Seguridad de las Carteras Blockchain:** Dado que Chainbrary opera en un sistema de interacción basado en carteras, los usuarios son responsables de la seguridad de sus carteras blockchain. Esto incluye salvaguardar las claves privadas y asegurar transacciones seguras. __DOUBLE_NEWLINE__ **No Acceso No Autorizado ni Interferencia:** Los usuarios no deben intentar obtener acceso no autorizado a los sistemas de Chainbrary ni participar en actividades que puedan interferir con el funcionamiento de la plataforma. Esto incluye evitar cualquier acción que pueda sobrecargar o dañar la infraestructura de Chainbrary. __DOUBLE_NEWLINE__ **Reporte de Uso Indebido y Vulnerabilidades:** Se alienta a los usuarios a reportar cualquier uso indebido de la plataforma o vulnerabilidades que descubran. Esta cooperación es vital para mantener la seguridad e integridad de Chainbrary. __DOUBLE_NEWLINE__ **Actividades Prohibidas:** Chainbrary prohíbe actividades como el fraude, el lavado de dinero y otras transacciones ilegales. Los usuarios que participen en tales actividades enfrentarán acciones legales apropiadas y pueden ser excluidos de usar la plataforma. __DOUBLE_NEWLINE__ **Participación y Retroalimentación de la Comunidad:** Se alienta a los usuarios a participar activamente en los canales comunitarios de Chainbrary, proporcionando retroalimentación y sugerencias para mejoras. La participación constructiva ayuda a fomentar un ecosistema vibrante y colaborativo. __DOUBLE_NEWLINE__ **Limitaciones de Responsabilidad:** Los usuarios deben entender que las interacciones con contratos inteligentes y tecnologías blockchain conllevan riesgos inherentes. Chainbrary no es responsable por cualquier pérdida incurrida debido a vulnerabilidades en el código de contratos inteligentes o la tecnología blockchain. __DOUBLE_NEWLINE__ ### Privacidad y Protección de Datos __DOUBLE_NEWLINE__ **Compromiso con la Privacidad:** En Chainbrary, valoramos altamente la privacidad y la seguridad de los datos del usuario. Nuestro enfoque a la protección de datos está profundamente integrado con las características de seguridad inherentes a la tecnología blockchain, asegurando que la privacidad del usuario sea respetada y mantenida. __DOUBLE_NEWLINE__ **Recolección y Uso de Datos:** __DOUBLE_NEWLINE__ 1. **Datos Basados en Blockchain:** Nuestra recolección principal de datos gira en torno a transacciones blockchain. Esto incluye IDs de transacciones públicas, direcciones de carteras y interacciones con contratos inteligentes. Debido a la naturaleza de la tecnología blockchain, esta información es inherentemente pública y no confidencial. __DOUBLE_NEWLINE__ 2. **Recolección Mínima de Datos Personales:** Las operaciones de Chainbrary están diseñadas para recolectar datos personales mínimos. Solo recopilamos la información esencial requerida para una operación efectiva y experiencia del usuario, adhiriéndonos a nuestro principio de privacidad y transparencia. __DOUBLE_NEWLINE__ 3. **Uso de Datos Agregados:** Para propósitos de mejora de la plataforma, podemos usar herramientas de análisis web para recolectar datos agregados sobre el uso del sitio y el comportamiento de los visitantes. Estos datos se recopilan en una forma agregada y no permiten la identificación individual del usuario. __DOUBLE_NEWLINE__ **Almacenamiento y Seguridad de Datos:** __DOUBLE_NEWLINE__ - **Almacenamiento de Datos en Blockchain:** Todos los datos relacionados con los usuarios, incluyendo registros transaccionales y direcciones de carteras, se almacenan exclusivamente en la blockchain, asegurando un alto nivel de seguridad y transparencia. __DOUBLE_NEWLINE__ - **Sin Almacenamiento de Datos Fuera de la Cadena:** Chainbrary no almacena ningún dato de usuario fuera de la cadena, alineándose con nuestro compromiso con la seguridad y transparencia inherentes a la tecnología blockchain. __DOUBLE_NEWLINE__ **Consentimiento y Control del Usuario:** __DOUBLE_NEWLINE__ - **Compartición Voluntaria de Datos:** Los usuarios pueden optar por proporcionar información adicional de manera voluntaria, como retroalimentación a través de canales comunitarios o participación en encuestas. Esta información se utiliza únicamente para mejorar nuestros servicios. __DOUBLE_NEWLINE__ - **Control sobre los Datos Personales:** Los usuarios tienen control sobre sus datos en la blockchain, manteniendo la privacidad a través de sus claves privadas. __DOUBLE_NEWLINE__ **Naturaleza Pública de los Datos en Blockchain:** __DOUBLE_NEWLINE__ - Los usuarios deben ser conscientes de que los datos almacenados en la blockchain, incluyendo historiales de transacciones y direcciones de carteras, son públicamente visibles. Aunque los datos de la blockchain no divulgan directamente identidades personales, los usuarios deben ser conscientes de la información que transaccionan en la blockchain. __DOUBLE_NEWLINE__ **Adaptación a los Avances de Blockchain:** __DOUBLE_NEWLINE__ - Nuestro enfoque al almacenamiento y seguridad de datos evoluciona con los avances en la tecnología blockchain. Estamos comprometidos a adaptar nuestras estrategias para asegurar el más alto nivel de integridad y seguridad de datos para nuestros usuarios. __DOUBLE_NEWLINE__ **Comunicación y Transparencia:** __DOUBLE_NEWLINE__ - Chainbrary mantiene una comunicación abierta y transparente sobre nuestras prácticas de privacidad. Animamos a los usuarios a revisar regularmente nuestra Política de Privacidad para conocer las actualizaciones y comprender sus derechos y responsabilidades. __DOUBLE_NEWLINE__ ### Términos Específicos de Blockchain __DOUBLE_NEWLINE__ **Integración de la Tecnología Blockchain:** Chainbrary aprovecha la tecnología blockchain para proporcionar servicios innovadores y seguros. El uso de la tecnología blockchain es fundamental para el funcionamiento de Chainbrary, ofreciendo ventajas como el control descentralizado, mayor seguridad y transparencia. __DOUBLE_NEWLINE__ **Interacciones con Contratos Inteligentes:** Los usuarios interactúan con los servicios de Chainbrary a través de contratos inteligentes. Estos contratos son autoejecutables con los términos del acuerdo entre comprador y vendedor escritos directamente en líneas de código. El código y los acuerdos contenidos en él existen en una red blockchain distribuida y descentralizada. __DOUBLE_NEWLINE__ **Transacciones Basadas en Carteras:** Las transacciones en Chainbrary se realizan utilizando carteras blockchain. Los usuarios deben tener una cartera blockchain compatible para interactuar con nuestros servicios. La cartera actúa como la identidad y el mecanismo de transacción del usuario en la plataforma. __DOUBLE_NEWLINE__ **Publicidad de los Datos en Blockchain:** Los usuarios deben entender que debido a la naturaleza de la tecnología blockchain, ciertos detalles de las transacciones como direcciones de carteras y hashes de transacciones son públicamente visibles en la blockchain. Chainbrary no tiene control sobre la visibilidad de estos datos. __DOUBLE_NEWLINE__ **Responsabilidad del Usuario en las Transacciones Blockchain:** Los usuarios son responsables de la seguridad y gestión de sus propias carteras blockchain, incluyendo mantener sus claves privadas confidenciales. Chainbrary no es responsable de ninguna pérdida o compromiso de los datos de la cartera blockchain. __DOUBLE_NEWLINE__ **Descentralización y Autonomía:** Chainbrary opera como una plataforma descentralizada, lo que significa que no está controlada por una sola entidad. Esta descentralización es un aspecto central de nuestra plataforma e influye en cómo se entregan y gobiernan los servicios. __DOUBLE_NEWLINE__ **Cumplimiento con las Regulaciones de Blockchain:** Chainbrary se adhiere a todas las leyes y regulaciones aplicables que rigen la tecnología blockchain y los activos digitales. Los usuarios son responsables de garantizar que su uso de los servicios de Chainbrary cumpla con las leyes y regulaciones de su jurisdicción. __DOUBLE_NEWLINE__ **Adaptación a los Cambios Tecnológicos:** El panorama blockchain está en constante evolución. Chainbrary se reserva el derecho de adaptar y actualizar sus servicios en respuesta a los avances tecnológicos en la tecnología blockchain. __DOUBLE_NEWLINE__ ### Limitaciones de Responsabilidad __DOUBLE_NEWLINE__ **Alcance de la Responsabilidad:** __DOUBLE_NEWLINE__ - **Descargo de Responsabilidad General:** Chainbrary proporciona sus servicios "tal cual" y "según disponibilidad" sin ninguna garantía, ya sea expresa o implícita, incluyendo pero no limitándose a las garantías implícitas de comerciabilidad, idoneidad para un propósito particular o no infracción. Chainbrary no garantiza el acceso continuo, ininterrumpido, libre de errores o seguro a sus servicios ni que cualquier defecto en el servicio será corregido. __DOUBLE_NEWLINE__ **Responsabilidad del Usuario:** __DOUBLE_NEWLINE__ - **Riesgo en Transacciones Blockchain:** Los usuarios reconocen que participar en transacciones blockchain implica riesgos. Chainbrary no es responsable de ninguna pérdida o daño incurrido como resultado de tales transacciones o de los riesgos inherentes a la tecnología blockchain. __DOUBLE_NEWLINE__ - **Seguridad de la Cartera:** Los usuarios son los únicos responsables de la seguridad y gestión de sus propias carteras blockchain. Chainbrary no es responsable de ninguna pérdida o compromiso que surja del acceso no autorizado o uso de las carteras de los usuarios. __DOUBLE_NEWLINE__ **Limitación de Daños:** __DOUBLE_NEWLINE__ - **Límite de Responsabilidad:** En la máxima medida permitida por la ley aplicable, Chainbrary no será responsable de ningún daño indirecto, incidental, especial, consecuente o punitivo, ni de ninguna pérdida de beneficios o ingresos, ya sea incurrida directa o indirectamente, ni de ninguna pérdida de datos, uso, buena voluntad u otras pérdidas intangibles. __DOUBLE_NEWLINE__ - **Problemas de Transacción:** Chainbrary no es responsable de ningún problema relacionado con la ejecución de transacciones blockchain, incluyendo pero no limitado a transacciones fallidas, altas tarifas de transacción o procesamiento retrasado de transacciones. __DOUBLE_NEWLINE__ **Indemnización:** __DOUBLE_NEWLINE__ - **Indemnización del Usuario:** Los usuarios acuerdan indemnizar y mantener indemne a Chainbrary y a sus oficiales, directores, empleados y agentes de cualquier reclamo, daño, pérdida, responsabilidad y gastos, incluidos los honorarios de abogados, que surjan de o en conexión con su uso de los servicios de Chainbrary, la violación de estos Términos o la violación de cualquier derecho de un tercero. __DOUBLE_NEWLINE__ **Enlaces Externos:** __DOUBLE_NEWLINE__ - **Sitios de Terceros:** Chainbrary puede contener enlaces a sitios web o recursos de terceros. Chainbrary no es responsable de la disponibilidad, precisión, contenido, productos o servicios de dichos sitios externos. __DOUBLE_NEWLINE__ ### Resolución de Disputas y Ley Aplicable __DOUBLE_NEWLINE__ **Ley Aplicable:** __DOUBLE_NEWLINE__ - **Jurisdicción:** Los Términos y Condiciones de Chainbrary se rigen e interpretan de acuerdo con las leyes de la jurisdicción donde Chainbrary tiene su sede. Esta elección de jurisdicción está destinada a proporcionar claridad y previsibilidad en la interpretación y aplicación de estos términos. __DOUBLE_NEWLINE__ **Resolución de Disputas:** __DOUBLE_NEWLINE__ - **Negociación y Mediación:** En caso de cualquier disputa, reclamo o controversia que surja de o esté relacionada con estos Términos y Condiciones, o la violación, terminación, cumplimiento, interpretación o validez de los mismos, las partes buscarán primero resolver la disputa mediante negociación amistosa. Si la disputa no puede resolverse mediante negociación, las partes acuerdan intentar resolver la disputa mediante mediación antes de recurrir a la litigación. __DOUBLE_NEWLINE__ - **Litigación:** Si la negociación y la mediación no resuelven la disputa, las partes acuerdan que cualquier acción legal o procedimiento que surja bajo estos Términos y Condiciones se llevará exclusivamente a los tribunales ubicados en la jurisdicción mencionada anteriormente. Al aceptar estos términos, los usuarios consienten a la jurisdicción y competencia de dichos tribunales. __DOUBLE_NEWLINE__ **No Acciones Colectivas:** __DOUBLE_NEWLINE__ - **Base Individual:** Los usuarios acuerdan que cualquier disputa se resolverá de manera individual y no en una acción colectiva, consolidada o representativa. Si por alguna razón un reclamo procede en el tribunal en lugar de en arbitraje, ambas partes renuncian a cualquier derecho a un juicio con jurado. __DOUBLE_NEWLINE__ **Limitación en el Tiempo para Presentar Reclamaciones:** __DOUBLE_NEWLINE__ - **Restricción Temporal:** Cualquier causa de acción o reclamo que un usuario pueda tener que surja de o esté relacionado con estos Términos y Condiciones debe comenzar dentro de un año después de que la causa de acción ocurra; de lo contrario, dicha causa de acción o reclamo se prohíbe permanentemente. __DOUBLE_NEWLINE__ **Cambios a los Términos de Resolución de Disputas:** __DOUBLE_NEWLINE__ - **Actualizaciones y Modificaciones:** Chainbrary se reserva el derecho de modificar esta sección de Resolución de Disputas y Ley Aplicable en cualquier momento. Todos los cambios serán efectivos inmediatamente después de su publicación en el sitio web y se aplicarán a todas las disputas que surjan bajo los Términos y Condiciones a partir de la fecha de publicación en adelante. El uso continuo de los servicios de Chainbrary constituye el acuerdo a los términos modificados. __DOUBLE_NEWLINE__ ### Terminación y Suspensión de Servicios __DOUBLE_NEWLINE__ **Circunstancias que Afectan el Acceso al Servicio:** __DOUBLE_NEWLINE__ - **Factores Externos:** Aunque Chainbrary opera como una plataforma descentralizada y no tiene la capacidad de suspender cuentas individuales de usuarios, factores externos pueden afectar el acceso de un usuario a los servicios de Chainbrary. Esto incluye situaciones en las que tokens o protocolos centralizados en el ecosistema de Chainbrary pueden verse afectados por acciones de entidades de terceros, como la congelación de direcciones. __DOUBLE_NEWLINE__ **Responsabilidad por Acciones de Cuentas Externas:** __DOUBLE_NEWLINE__ - **Control de Terceros:** Los usuarios deben ser conscientes de que ciertos aspectos de su interacción con Chainbrary, particularmente aquellos que involucran tokens o protocolos externos, pueden estar sujetos al control de entidades de terceros. Chainbrary no tiene control sobre estas acciones externas y no puede ser responsable de ninguna limitación, suspensión o cambios en la disponibilidad del servicio resultantes. __DOUBLE_NEWLINE__ - **Conciencia del Usuario:** Los usuarios son responsables de mantenerse informados sobre el estado y los términos de los tokens y protocolos de terceros integrados con Chainbrary y entender cómo estos pueden impactar su acceso y uso de los servicios de Chainbrary. __DOUBLE_NEWLINE__ **Continuidad de los Servicios:** __DOUBLE_NEWLINE__ - **Compromiso de Chainbrary:** Chainbrary está dedicado a proporcionar un servicio continuo e ininterrumpido a sus usuarios. Sin embargo, se debe reconocer que la naturaleza descentralizada de la tecnología blockchain y la dependencia de protocolos y tokens externos significa que ciertos aspectos de la disponibilidad del servicio pueden estar fuera del control directo de Chainbrary. __DOUBLE_NEWLINE__ **Recursos del Usuario:** __DOUBLE_NEWLINE__ - **Apoyo Comunitario:** En caso de interrupciones causadas por factores externos, se alienta a los usuarios a buscar orientación y apoyo a través de los canales comunitarios de Chainbrary. Estas plataformas sirven como un recurso para compartir información y asistencia comunitaria. __DOUBLE_NEWLINE__ ### Sección de Contacto y Consultas __DOUBLE_NEWLINE__ **Canales Abiertos para Comunicación y Soporte:** Chainbrary está comprometido a proporcionar un entorno de apoyo donde se prioriza la comunicación abierta. Entendemos la importancia de abordar consultas, inquietudes y comentarios, ya que son cruciales para la mejora continua de nuestra plataforma y las relaciones comunitarias. __DOUBLE_NEWLINE__ 1. **Método de Contacto Principal:** __DOUBLE_NEWLINE__ - **Canales Comunitarios:** Para cualquier pregunta, inquietud o comentario sobre nuestros servicios o cualquier aspecto de nuestra plataforma, se anima a los usuarios a comunicarse a través de nuestros canales comunitarios, principalmente en Discord. Esta plataforma facilita la interacción en tiempo real y asegura una atención rápida por parte de nuestro equipo. __DOUBLE_NEWLINE__ 2. **Soporte y Respuesta:** __DOUBLE_NEWLINE__ - **Equipo de Soporte Dedicado:** Nuestro equipo de soporte está activamente presente en Discord para abordar las consultas de los usuarios. Nos esforzamos por proporcionar respuestas oportunas y útiles a todas las preguntas, asegurando que los usuarios se sientan escuchados y apoyados. __DOUBLE_NEWLINE__ - **Participación Comunitaria:** También fomentamos un entorno donde los miembros de la comunidad pueden asistirse mutuamente, aprovechando el conocimiento y las experiencias colectivas de nuestra base de usuarios. __DOUBLE_NEWLINE__ 3. **Comentarios y Sugerencias:** __DOUBLE_NEWLINE__ - **Abiertos a las Sugerencias de los Usuarios:** Chainbrary valora las opiniones y sugerencias de nuestra comunidad. Se anima a los usuarios a compartir sus ideas y comentarios, los cuales juegan un papel crucial en la configuración de nuestras políticas y desarrollos de la plataforma. __DOUBLE_NEWLINE__ - **Proceso de Consideración Transparente:** Todos los comentarios de los usuarios son cuidadosamente considerados por nuestro equipo. Aunque no podamos implementar cada sugerencia, nos aseguramos de que cada idea sea debidamente considerada y respondida. __DOUBLE_NEWLINE__ 4. **Problemas e Inquietudes:** __DOUBLE_NEWLINE__ - **Proceso de Resolución:** Para problemas o inquietudes, especialmente aquellos relacionados con la privacidad o el uso de datos, los usuarios pueden comunicarse directamente en nuestro canal de Discord. Tenemos protocolos establecidos para escalar y abordar tales asuntos con la seriedad y discreción que merecen. __DOUBLE_NEWLINE__ - **Mejora Continua:** Los problemas reportados por los usuarios no solo se abordan, sino que también se analizan para posibles mejoras en nuestras políticas y prácticas. __DOUBLE_NEWLINE__ **Tu Voz Importa:** En Chainbrary, creemos en el poder del crecimiento y la mejora impulsados por la comunidad. Nuestros canales están siempre abiertos para sus voces, asegurando que su experiencia con Chainbrary no solo sea segura y privada, sino también colaborativa y receptiva. __DOUBLE_NEWLINE__ ### Resumen Final y Fecha de Vigencia de los Términos y Condiciones __DOUBLE_NEWLINE__ **Fecha de Vigencia:** __DOUBLE_NEWLINE__ - Los Términos y Condiciones de Chainbrary son efectivos a partir del 21 de febrero de 2024. Esta fecha marca el comienzo de los términos que rigen el uso de los servicios de Chainbrary. __DOUBLE_NEWLINE__ - Animamos a todos los usuarios a revisar regularmente los Términos y Condiciones para mantenerse informados sobre sus derechos y responsabilidades al usar Chainbrary. Es esencial entender cómo estos términos afectan su interacción con nuestra plataforma. __DOUBLE_NEWLINE__ **Nuestro Compromiso con los Usuarios:** __DOUBLE_NEWLINE__ - Chainbrary está firme en su compromiso de proporcionar una experiencia segura, transparente y centrada en el usuario. Entendemos la importancia de mantener una plataforma que se alinee con la naturaleza evolutiva de la tecnología blockchain y las necesidades de nuestra comunidad. __DOUBLE_NEWLINE__ - Aseguramos a nuestros usuarios que refinaremos y actualizaremos continuamente nuestras prácticas y políticas para cumplir con los más altos estándares de funcionalidad y protección del usuario. Su confianza y confianza en Chainbrary son de suma importancia, y estamos dedicados a mantener esa confianza a través de cada acción y decisión que tomamos. __DOUBLE_NEWLINE__ **Declaración Final:** __DOUBLE_NEWLINE__ - A medida que navegamos por el dinámico e innovador ámbito de la tecnología blockchain, Chainbrary se compromete a ser un líder responsable y con visión de futuro en este espacio. Nuestra misión es proporcionar una plataforma que no solo aproveche los beneficios del blockchain, sino que también garantice un entorno seguro, respetuoso y empoderador para todos nuestros usuarios.
fr: # Conditions Générales de Chainbrary __DOUBLE_NEWLINE__ _Dernière mise à jour : 21 février 2024_ __DOUBLE_NEWLINE__ ### Introduction aux Conditions Générales __DOUBLE_NEWLINE__ **Bienvenue sur Chainbrary.** En tant que plateforme innovante à l'intersection de la technologie blockchain et de l'utilité quotidienne, nous nous engageons à assurer une expérience sécurisée, transparente et fiable pour tous nos utilisateurs. Ce document présente les Conditions Générales d'utilisation des services et de la plateforme de Chainbrary. __DOUBLE_NEWLINE__ Chainbrary, fonctionnant comme une organisation autonome décentralisée (DAO), met un accent particulier sur l'autonomisation des utilisateurs et la gouvernance communautaire. Notre plateforme tire parti de la technologie blockchain non seulement pour ses avantages techniques, mais aussi pour favoriser un sentiment d'appartenance et d'implication parmi nos utilisateurs. Ce document sur les Conditions Générales est un témoignage de notre engagement à maintenir un environnement sûr, respectueux et propice à des interactions positives dans l'espace numérique. __DOUBLE_NEWLINE__ À travers ce document, nous visons à articuler clairement les lignes directrices, règles et attentes qui régissent l'utilisation de notre plateforme. Nous croyons en la transparence et la communication ouverte, et nous nous consacrons à garantir que nos utilisateurs soient bien informés de leurs droits et responsabilités lorsqu'ils interagissent avec Chainbrary. Au fur et à mesure que vous naviguez dans les services et outils basés sur la blockchain que nous offrons, ce document servira de cadre de référence, vous aidant à comprendre comment utiliser notre plateforme de manière efficace et responsable. __DOUBLE_NEWLINE__ ### Acceptation des Conditions __DOUBLE_NEWLINE__ **Interaction avec Chainbrary via des portefeuilles blockchain :** L'approche innovante de Chainbrary permet aux utilisateurs d'interagir avec notre smart contract directement en utilisant leurs portefeuilles blockchain. Cette méthode élimine le besoin d'une inscription traditionnelle, en alignement avec notre ethos de décentralisation et d'autonomisation des utilisateurs. En interagissant avec les smart contracts de Chainbrary via un portefeuille blockchain, les utilisateurs acceptent implicitement de se conformer à ces Conditions Générales. __DOUBLE_NEWLINE__ **Pas de processus d'inscription formel :** Comme Chainbrary ne requiert pas de processus d'inscription formel, l'utilisation de nos services via un portefeuille blockchain est considérée comme une acceptation implicite de ces Conditions Générales. Les utilisateurs sont responsables de comprendre et de respecter ces termes dans le cadre de leur interaction avec Chainbrary. __DOUBLE_NEWLINE__ **Annonces publiques et communication :** Chainbrary valorise la communication ouverte et transparente avec notre communauté. Nous n'engageons pas de communication directe par email. Au lieu de cela, toutes les annonces importantes et mises à jour concernant Chainbrary, y compris les modifications apportées à ces Conditions Générales, seront faites via nos canaux de médias sociaux officiels et groupes communautaires. Les utilisateurs sont encouragés à suivre ces canaux pour rester informés de toute mise à jour ou changement. __DOUBLE_NEWLINE__ **Engagement et accord continu :** En continuant d'utiliser les services de Chainbrary, les utilisateurs réaffirment leur accord aux Conditions Générales en vigueur. Il est de la responsabilité des utilisateurs de rester informés de toute modification de ces termes, qui seront communiquées comme indiqué ci-dessus. __DOUBLE_NEWLINE__ ### Modifications des Conditions __DOUBLE_NEWLINE__ **Adaptabilité et révision des termes :** Chainbrary reconnaît la nature dynamique de l'industrie de la blockchain et la nécessité pour nos Conditions Générales d'évoluer en fonction des développements technologiques et juridiques. Par conséquent, nous nous réservons le droit de modifier ces termes périodiquement pour refléter les changements dans nos services, les exigences légales, les retours des utilisateurs ou les avancées de la technologie blockchain. __DOUBLE_NEWLINE__ **Notification des changements :** En accord avec notre engagement envers la transparence et la communication ouverte, toute modification significative de ces Conditions Générales sera annoncée via nos canaux de médias sociaux officiels et groupes communautaires. Cette approche garantit que tous les utilisateurs ont un accès égal et immédiat aux informations les plus récentes concernant nos conditions. __DOUBLE_NEWLINE__ **Date d'entrée en vigueur des termes révisés :** Chaque annonce concernant les changements des Conditions Générales spécifiera clairement la date d'entrée en vigueur des termes révisés. Cette information aide les utilisateurs à comprendre quand les nouveaux termes entreront en vigueur, leur permettant de les examiner et de s'adapter aux changements. __DOUBLE_NEWLINE__ **Engagement et retour des utilisateurs :** Bien que le consentement formel pour chaque mise à jour ne soit pas recherché, nous encourageons un engagement actif de nos utilisateurs dans la revue et la compréhension des changements. Les retours sur les mises à jour sont toujours bienvenus, et nous valorisons la participation des utilisateurs dans le développement continu de notre plateforme. __DOUBLE_NEWLINE__ **Responsabilité de l'utilisateur pour une revue régulière :** Les utilisateurs sont conseillés de revoir périodiquement les Conditions Générales, en particulier lorsqu'ils sont informés de modifications. Rester informé des termes d'utilisation est crucial pour une expérience fluide et conforme sur Chainbrary. __DOUBLE_NEWLINE__ ### Enregistrement et Comptes des Utilisateurs __DOUBLE_NEWLINE__ **Interaction basée sur le portefeuille :** Chez Chainbrary, nous adoptons la nature décentralisée de la technologie blockchain. Par conséquent, notre plateforme ne nécessite pas d'enregistrement de compte traditionnel. Au lieu de cela, les utilisateurs interagissent avec les services de Chainbrary directement via leurs portefeuilles blockchain. Cette interaction basée sur le portefeuille simplifie le processus et s'aligne avec notre engagement en matière de confidentialité et de sécurité des utilisateurs. __DOUBLE_NEWLINE__ **Accord implicite aux Conditions :** En choisissant d'interagir avec Chainbrary via un portefeuille blockchain, les utilisateurs acceptent implicitement nos Conditions Générales. Cet accord est établi au moment de l'interaction avec le smart contract, sans besoin de processus d'acceptation distinct. __DOUBLE_NEWLINE__ **Anonymat et Sécurité :** Chainbrary ne collecte pas d'informations personnelles dans le cadre de cette interaction. Les utilisateurs maintiennent leur anonymat, seules leurs adresses de portefeuilles publics étant impliquées dans les transactions. Cette approche assure un haut niveau de sécurité et de confidentialité, inhérent à la technologie blockchain. __DOUBLE_NEWLINE__ **Responsabilité de l'utilisateur :** Les utilisateurs sont responsables de la gestion de leurs portefeuilles blockchain et de la sécurité de leurs clés privées. Chainbrary n'est pas responsable de toute perte ou compromis résultant de la gestion du portefeuille blockchain par l'utilisateur. __DOUBLE_NEWLINE__ **Pas de communication par email :** En cohérence avec notre approche décentralisée et axée sur la confidentialité, Chainbrary n'engage pas de communications directes par email avec les utilisateurs. Toutes les annonces publiques, y compris les modifications de ces Conditions Générales, seront communiquées via nos canaux de médias sociaux officiels et groupes communautaires. __DOUBLE_NEWLINE__ **Utilisation continue comme accord :** L'utilisation continue des services de Chainbrary via un portefeuille blockchain réaffirme l'acceptation par l'utilisateur des Conditions Générales en vigueur. Les utilisateurs sont encouragés à se tenir informés de toute modification de ces termes par le biais de nos canaux de communication désignés. __DOUBLE_NEWLINE__ ### Utilisation des Services de Chainbrary __DOUBLE_NEWLINE__ **Limitations d'utilisation :** __DOUBLE_NEWLINE__ Bien que Chainbrary s'engage à fournir une large gamme de services, certaines limitations existent quant à ce que nous offrons : __DOUBLE_NEWLINE__ - **Pas de création de jetons propriétaires :** Chainbrary est conçu comme un hub polyvalent pour diverses communautés blockchain et n'a pas l'intention de créer des jetons propriétaires. __DOUBLE_NEWLINE__ - **Neutralité à travers les réseaux et projets :** Chainbrary maintient une position neutre, ne favorisant aucun réseau blockchain, projet ou portefeuille spécifique, assurant ainsi l'inclusivité et la liberté de choix pour les utilisateurs. __DOUBLE_NEWLINE__ **Responsabilités de l'utilisateur :** __DOUBLE_NEWLINE__ Les utilisateurs qui interagissent avec les services de Chainbrary doivent : __DOUBLE_NEWLINE__ - **Respecter les normes légales et éthiques :** S'assurer que leur utilisation des services de Chainbrary est conforme aux lois et réglementations de leurs juridictions respectives. __DOUBLE_NEWLINE__ - **Respecter l'intégrité de la plateforme :** Éviter toute activité pouvant nuire à la fonctionnalité ou à la réputation de Chainbrary. __DOUBLE_NEWLINE__ - **Maintenir la sécurité de leurs portefeuilles :** Étant donné que les interactions sont basées sur les portefeuilles, les utilisateurs doivent garantir la sécurité de leurs clés privées et des informations de leur portefeuille. __DOUBLE_NEWLINE__ **Mises à jour et améliorations des services :** __DOUBLE_NEWLINE__ Chainbrary s'engage à l'amélioration continue de ses services. Les utilisateurs doivent être conscients que : __DOUBLE_NEWLINE__ - **Mises à jour des services :** Chainbrary peut mettre à jour ou modifier ses services pour améliorer la fonctionnalité, l'expérience utilisateur ou la conformité aux normes réglementaires. __DOUBLE_NEWLINE__ - **Notification des changements :** Toute modification significative des services sera communiquée via les canaux de médias sociaux officiels et les groupes communautaires de Chainbrary. __DOUBLE_NEWLINE__ ### Droits de Propriété Intellectuelle __DOUBLE_NEWLINE__ **Propriété du contenu de Chainbrary :** Tout le contenu et le matériel disponibles sur Chainbrary, y compris mais sans s'y limiter aux textes, graphiques, logos, icônes, images et logiciels, sont la propriété de Chainbrary ou de ses fournisseurs de contenu et protégés par les lois sur la propriété intellectuelle. La compilation de ce contenu sur la plateforme constitue la propriété exclusive de Chainbrary et est également protégée. __DOUBLE_NEWLINE__ **Contenu généré par les utilisateurs :** Les utilisateurs peuvent contribuer à du contenu sous diverses formes (par exemple, des commentaires, des suggestions) via les canaux communautaires. Cependant, il est important de noter que ces contributions ne confèrent aucun droit de propriété aux utilisateurs sur la plateforme de Chainbrary ou sa propriété intellectuelle. __DOUBLE_NEWLINE__ **Licence d'utilisation des services de Chainbrary :** Chainbrary accorde aux utilisateurs une licence limitée, non exclusive et non transférable pour accéder et utiliser les services offerts par Chainbrary à des fins personnelles et non commerciales conformément à ces Conditions Générales. Cette licence n'inclut aucun droit de revente ou d'utilisation commerciale du contenu de Chainbrary ; de collecte et d'utilisation de toute liste de produits, descriptions ou prix ; d'utilisation dérivée des services de Chainbrary ou de son contenu ; ou de toute utilisation de l'extraction de données, robots ou outils similaires de collecte et d'extraction de données. __DOUBLE_NEWLINE__ **Interdiction de l'infraction :** Les utilisateurs doivent respecter les droits de propriété intellectuelle de Chainbrary et des tiers. Toute utilisation ou reproduction non autorisée du matériel fourni sur la plateforme de Chainbrary, ou toute violation des droits de propriété intellectuelle, peut exposer l'utilisateur à des actions judiciaires. __DOUBLE_NEWLINE__ **Informations sur les marques :** Le nom et le logo de Chainbrary, ainsi que tous les noms de produits et services connexes, marques de conception et slogans sont des marques de commerce ou des marques de service de Chainbrary. Les utilisateurs ne sont pas autorisés à utiliser ces marques sans le consentement écrit préalable de Chainbrary. __DOUBLE_NEWLINE__ **Pas de transfert de propriété intellectuelle :** L'engagement avec les services ou la plateforme de Chainbrary ne constitue pas un transfert ou une cession de droits de propriété intellectuelle aux utilisateurs, de manière explicite ou implicite. __DOUBLE_NEWLINE__ ### Responsabilités et Conduite des Utilisateurs __DOUBLE_NEWLINE__ **Conformité aux lois et règlements :** Les utilisateurs de Chainbrary sont tenus de se conformer à toutes les lois et réglementations applicables dans leurs juridictions respectives. Cela inclut, mais sans s'y limiter, les réglementations relatives à la technologie blockchain, aux transactions financières et à la conduite en ligne. __DOUBLE_NEWLINE__ **Utilisation éthique des services :** Les utilisateurs doivent utiliser les services de Chainbrary de manière éthique et responsable. Cela inclut de s'abstenir de toute forme d'abus ou d'activités malveillantes pouvant nuire à la plateforme, à d'autres utilisateurs ou à la communauté blockchain au sens large. __DOUBLE_NEWLINE__ **Respect de la propriété intellectuelle :** Les utilisateurs doivent respecter les droits de propriété intellectuelle de Chainbrary et des tiers. Toute utilisation non autorisée du contenu de Chainbrary ou toute violation des droits de propriété intellectuelle est strictement interdite. __DOUBLE_NEWLINE__ **Sécurité des portefeuilles blockchain :** Étant donné que Chainbrary fonctionne sur un système d'interaction basé sur les portefeuilles, les utilisateurs sont responsables de la sécurité de leurs portefeuilles blockchain. Cela inclut la protection des clés privées et l'assurance de transactions sécurisées. __DOUBLE_NEWLINE__ **Pas d'accès non autorisé ou d'interférence :** Les utilisateurs ne doivent pas tenter d'accéder sans autorisation aux systèmes de Chainbrary ou s'engager dans des activités pouvant interférer avec le fonctionnement de la plateforme. Cela inclut l'évitement de toute action pouvant surcharger ou endommager l'infrastructure de Chainbrary. __DOUBLE_NEWLINE__ **Signalement des abus et des vulnérabilités :** Les utilisateurs sont encouragés à signaler tout abus de la plateforme ou toute vulnérabilité qu'ils découvrent. Cette coopération est vitale pour maintenir la sécurité et l'intégrité de Chainbrary. __DOUBLE_NEWLINE__ **Activités interdites :** Chainbrary interdit les activités telles que la fraude, le blanchiment d'argent et d'autres transactions illégales. Les utilisateurs s'engageant dans de telles activités feront l'objet de poursuites judiciaires appropriées et peuvent être interdits d'utiliser la plateforme. __DOUBLE_NEWLINE__ **Engagement communautaire et retour d'information :** Les utilisateurs sont encouragés à participer activement aux canaux communautaires de Chainbrary, en fournissant des retours et des suggestions pour des améliorations. L'engagement constructif aide à favoriser un écosystème vibrant et collaboratif. __DOUBLE_NEWLINE__ **Limitations de responsabilité :** Les utilisateurs doivent comprendre que les interactions avec les smart contracts et les technologies blockchain comportent des risques inhérents. Chainbrary n'est pas responsable des pertes encourues en raison des vulnérabilités du code des smart contracts ou de la technologie blockchain. __DOUBLE_NEWLINE__ ### Confidentialité et Protection des Données __DOUBLE_NEWLINE__ **Engagement envers la confidentialité :** Chez Chainbrary, nous accordons une grande importance à la confidentialité et à la sécurité des données des utilisateurs. Notre approche de la protection des données est profondément intégrée aux fonctionnalités de sécurité inhérentes à la technologie blockchain, garantissant que la confidentialité des utilisateurs est respectée et maintenue. __DOUBLE_NEWLINE__ **Collecte et utilisation des données :** __DOUBLE_NEWLINE__ 1. **Données basées sur la blockchain :** Notre collecte de données principale tourne autour des transactions blockchain. Cela inclut les identifiants de transaction publics, les adresses de portefeuille et les interactions avec les smart contracts. En raison de la nature de la technologie blockchain, ces informations sont intrinsèquement publiques et non confidentielles. __DOUBLE_NEWLINE__ 2. **Collecte minimale de données personnelles :** Les opérations de Chainbrary sont conçues pour collecter un minimum de données personnelles. Nous ne recueillons que les informations essentielles nécessaires au bon fonctionnement et à l'expérience utilisateur, conformément à notre principe de confidentialité et de transparence. __DOUBLE_NEWLINE__ 3. **Utilisation de données agrégées :** Pour des fins d'amélioration de la plateforme, nous pouvons utiliser des outils d'analyse web pour recueillir des données agrégées sur l'utilisation du site et le comportement des visiteurs. Ces données sont collectées sous une forme agrégée et ne permettent pas l'identification individuelle des utilisateurs. __DOUBLE_NEWLINE__ **Stockage et sécurité des données :** __DOUBLE_NEWLINE__ - **Stockage des données sur la blockchain :** Toutes les données relatives aux utilisateurs, y compris les enregistrements de transactions et les adresses de portefeuille, sont stockées exclusivement sur la blockchain, garantissant un haut niveau de sécurité et de transparence. __DOUBLE_NEWLINE__ - **Pas de stockage de données hors chaîne :** Chainbrary ne stocke aucune donnée utilisateur hors chaîne, en alignement avec notre engagement envers la sécurité et la transparence inhérentes à la technologie blockchain. __DOUBLE_NEWLINE__ **Consentement et contrôle des utilisateurs :** __DOUBLE_NEWLINE__ - **Partage volontaire des données :** Les utilisateurs peuvent choisir de fournir des informations supplémentaires volontairement, telles que des retours via les canaux communautaires ou la participation à des enquêtes. Ces informations sont utilisées uniquement pour améliorer nos services. __DOUBLE_NEWLINE__ - **Contrôle des données personnelles :** Les utilisateurs ont le contrôle de leurs données sur la blockchain, maintenant la confidentialité grâce à leurs clés privées. __DOUBLE_NEWLINE__ **Nature publique des données blockchain :** __DOUBLE_NEWLINE__ - Les utilisateurs doivent être conscients que les données stockées sur la blockchain, y compris les historiques de transactions et les adresses de portefeuille, sont visibles publiquement. Bien que les données blockchain ne divulguent pas directement les identités personnelles, les utilisateurs doivent être conscients des informations qu'ils transigent sur la blockchain. __DOUBLE_NEWLINE__ **Adaptation aux avancées de la blockchain :** __DOUBLE_NEWLINE__ - Notre approche du stockage et de la sécurité des données évolue avec les avancées de la technologie blockchain. Nous nous engageons à adapter nos stratégies pour garantir le plus haut niveau d'intégrité et de sécurité des données pour nos utilisateurs. __DOUBLE_NEWLINE__ **Communication et transparence :** __DOUBLE_NEWLINE__ - Chainbrary maintient une communication ouverte et transparente concernant nos pratiques de confidentialité. Nous encourageons les utilisateurs à consulter régulièrement notre Politique de Confidentialité pour se tenir informés des mises à jour et comprendre leurs droits et responsabilités. __DOUBLE_NEWLINE__ ### Termes Spécifiques à la Blockchain __DOUBLE_NEWLINE__ **Intégration de la technologie blockchain :** Chainbrary exploite la technologie blockchain pour fournir des services innovants et sécurisés. L'utilisation de la technologie blockchain est fondamentale pour le fonctionnement de Chainbrary, offrant des avantages tels que le contrôle décentralisé, une sécurité accrue et la transparence. __DOUBLE_NEWLINE__ **Interactions avec les smart contracts :** Les utilisateurs interagissent avec les services de Chainbrary via des smart contracts. Ces contrats sont auto-exécutables avec les termes de l'accord entre acheteur et vendeur directement inscrits dans des lignes de code. Le code et les accords qu'il contient existent sur un réseau blockchain distribué et décentralisé. __DOUBLE_NEWLINE__ **Transactions basées sur les portefeuilles :** Les transactions sur Chainbrary sont effectuées à l'aide de portefeuilles blockchain. Les utilisateurs doivent posséder un portefeuille blockchain compatible pour interagir avec nos services. Le portefeuille agit comme l'identité et le mécanisme de transaction de l'utilisateur sur la plateforme. __DOUBLE_NEWLINE__ **Publicité des données blockchain :** Les utilisateurs doivent comprendre que, en raison de la nature de la technologie blockchain, certains détails de transaction tels que les adresses de portefeuille et les hachages de transaction sont visibles publiquement sur la blockchain. Chainbrary n'a aucun contrôle sur la visibilité de ces données. __DOUBLE_NEWLINE__ **Responsabilité de l'utilisateur dans les transactions blockchain :** Les utilisateurs sont responsables de la sécurité et de la gestion de leurs propres portefeuilles blockchain, y compris la confidentialité de leurs clés privées. Chainbrary n'est pas responsable de toute perte ou compromis des données du portefeuille blockchain. __DOUBLE_NEWLINE__ **Décentralisation et autonomie :** Chainbrary fonctionne comme une plateforme décentralisée, ce qui signifie qu'elle n'est contrôlée par aucune entité unique. Cette décentralisation est un aspect central de notre plateforme et influence la manière dont les services sont fournis et gouvernés. __DOUBLE_NEWLINE__ **Conformité aux réglementations blockchain :** Chainbrary se conforme à toutes les lois et réglementations applicables régissant la technologie blockchain et les actifs numériques. Les utilisateurs sont responsables de s'assurer que leur utilisation des services de Chainbrary est conforme aux lois et réglementations de leur juridiction. __DOUBLE_NEWLINE__ **Adaptation aux changements technologiques :** Le paysage de la blockchain est en constante évolution. Chainbrary se réserve le droit d'adapter et de mettre à jour ses services en réponse aux avancées technologiques dans la technologie blockchain. __DOUBLE_NEWLINE__ ### Limitations de Responsabilité __DOUBLE_NEWLINE__ **Portée de la responsabilité :** __DOUBLE_NEWLINE__ - **Clause de non-responsabilité générale :** Chainbrary fournit ses services sur une base "tel quel" et "tel que disponible" sans aucune garantie, expresse ou implicite, y compris mais sans s'y limiter, les garanties implicites de qualité marchande, d'adéquation à un usage particulier ou de non-violation. Chainbrary ne garantit pas un accès continu, ininterrompu, sans erreur ou sécurisé à ses services ou que tout défaut du service sera corrigé. __DOUBLE_NEWLINE__ **Responsabilité de l'utilisateur :** __DOUBLE_NEWLINE__ - **Risque dans les transactions blockchain :** Les utilisateurs reconnaissent que l'engagement dans des transactions blockchain comporte des risques. Chainbrary n'est pas responsable de toute perte ou dommage encouru en raison de telles transactions ou des risques inhérents à la technologie blockchain. __DOUBLE_NEWLINE__ - **Sécurité du portefeuille :** Les utilisateurs sont seuls responsables de la sécurité et de la gestion de leurs propres portefeuilles blockchain. Chainbrary n'est pas responsable de toute perte ou compromis résultant d'un accès non autorisé à ou de l'utilisation des portefeuilles des utilisateurs. __DOUBLE_NEWLINE__ **Limitation des dommages :** __DOUBLE_NEWLINE__ - **Limitation de responsabilité :** Dans toute la mesure permise par la loi applicable, Chainbrary ne sera pas responsable de tout dommage indirect, incident, spécial, consécutif ou punitif, ou de toute perte de profits ou de revenus, qu'ils soient encourus directement ou indirectement, ou de toute perte de données, d'utilisation, de goodwill ou autres pertes intangibles. __DOUBLE_NEWLINE__ - **Problèmes de transaction :** Chainbrary n'est pas responsable de tout problème lié à l'exécution des transactions blockchain, y compris mais sans s'y limiter aux transactions échouées, aux frais de transaction élevés ou aux retards dans le traitement des transactions. __DOUBLE_NEWLINE__ **Indemnisation :** __DOUBLE_NEWLINE__ - **Indemnisation de l'utilisateur :** Les utilisateurs s'engagent à indemniser et à dégager de toute responsabilité Chainbrary et ses dirigeants, administrateurs, employés et agents de toute réclamation, dommage, perte, responsabilité et dépense, y compris les honoraires d'avocat, résultant de ou en relation avec leur utilisation des services de Chainbrary, violation de ces Conditions ou violation de tout droit d'un tiers. __DOUBLE_NEWLINE__ **Liens externes :** __DOUBLE_NEWLINE__ - **Sites tiers :** Chainbrary peut contenir des liens vers des sites web ou ressources tiers. Chainbrary n'est pas responsable de la disponibilité, de l'exactitude, du contenu, des produits ou des services de ces sites externes. __DOUBLE_NEWLINE__ ### Résolution des Litiges et Droit Applicable __DOUBLE_NEWLINE__ **Droit applicable :** __DOUBLE_NEWLINE__ - **Juridiction :** Les Conditions Générales de Chainbrary sont régies par et interprétées conformément aux lois de la juridiction où Chainbrary a son siège. Ce choix de juridiction vise à fournir une clarté et une prévisibilité dans l'interprétation et l'application de ces termes. __DOUBLE_NEWLINE__ **Résolution des litiges :** __DOUBLE_NEWLINE__ - **Négociation et médiation :** En cas de litige, de réclamation ou de controverse découlant de ou en relation avec ces Conditions Générales, ou leur violation, résiliation, exécution, interprétation ou validité, les parties doivent d'abord tenter de résoudre le litige par une négociation amiable. Si le litige ne peut être résolu par la négociation, les parties conviennent de tenter de résoudre le litige par la médiation avant de recourir à un litige. __DOUBLE_NEWLINE__ - **Contentieux :** Si la négociation et la médiation ne résolvent pas le litige, les parties conviennent que toute action ou procédure judiciaire découlant de ces Conditions Générales sera portée exclusivement devant les tribunaux situés dans la juridiction mentionnée ci-dessus. En acceptant ces termes, les utilisateurs consentent à la juridiction et au lieu de ces tribunaux. __DOUBLE_NEWLINE__ **Pas de recours collectif :** __DOUBLE_NEWLINE__ - **Base individuelle :** Les utilisateurs conviennent que tout litige sera résolu sur une base individuelle et non dans une action collective, consolidée ou représentative. Si, pour une raison quelconque, une réclamation est portée devant un tribunal plutôt qu'en arbitrage, les deux parties renoncent à tout droit à un procès devant jury. __DOUBLE_NEWLINE__ **Limitation du temps pour déposer des réclamations :** __DOUBLE_NEWLINE__ - **Contrainte temporelle :** Toute cause d'action ou réclamation qu'un utilisateur peut avoir découlant de ou en relation avec ces Conditions Générales doit être engagée dans un délai d'un an après que la cause de l'action s'est produite ; sinon, cette cause d'action ou réclamation est définitivement prescrite. __DOUBLE_NEWLINE__ **Modifications des termes de résolution des litiges :** __DOUBLE_NEWLINE__ - **Mises à jour et modifications :** Chainbrary se réserve le droit de modifier cette section Résolution des litiges et Droit applicable à tout moment. Tous les changements prendront effet immédiatement après leur publication sur le site web et s'appliqueront à tous les litiges découlant des Conditions Générales à partir de la date de publication. L'utilisation continue des services de Chainbrary constitue un accord aux termes modifiés. __DOUBLE_NEWLINE__ ### Résiliation et Suspension des Services __DOUBLE_NEWLINE__ **Circonstances affectant l'accès aux services :** __DOUBLE_NEWLINE__ - **Facteurs externes :** Bien que Chainbrary fonctionne comme une plateforme décentralisée et n'ait pas la capacité de suspendre les comptes utilisateurs individuels, des facteurs externes peuvent affecter l'accès des utilisateurs aux services de Chainbrary. Cela inclut des situations où des jetons ou des protocoles centralisés dans l'écosystème Chainbrary pourraient être affectés par des actions d'entités tierces, telles que le gel d'adresses. __DOUBLE_NEWLINE__ **Responsabilité des actions de comptes externes :** __DOUBLE_NEWLINE__ - **Contrôle par des tiers :** Les utilisateurs doivent être conscients que certains aspects de leur interaction avec Chainbrary, en particulier ceux impliquant des jetons ou des protocoles externes, pourraient être soumis à un contrôle par des entités tierces. Chainbrary n'a aucun contrôle sur ces actions externes et ne peut être tenu responsable de toute limitation, suspension ou changement dans la disponibilité des services résultant de ces actions. __DOUBLE_NEWLINE__ - **Sensibilisation des utilisateurs :** Les utilisateurs sont responsables de rester informés sur le statut et les conditions des jetons et protocoles tiers intégrés à Chainbrary et de comprendre comment ceux-ci peuvent impacter leur accès et utilisation des services de Chainbrary. __DOUBLE_NEWLINE__ **Continuité des services :** __DOUBLE_NEWLINE__ - **Engagement de Chainbrary :** Chainbrary est dédié à fournir un service continu et ininterrompu à ses utilisateurs. Cependant, il doit être reconnu que la nature décentralisée de la technologie blockchain et la dépendance à l'égard de protocoles et de jetons externes signifient que certains aspects de la disponibilité des services peuvent être hors du contrôle direct de Chainbrary. __DOUBLE_NEWLINE__ **Recours des utilisateurs :** __DOUBLE_NEWLINE__ - **Soutien communautaire :** En cas de perturbations causées par des facteurs externes, les utilisateurs sont encouragés à rechercher des conseils et un soutien via les canaux communautaires de Chainbrary. Ces plateformes servent de ressources pour le partage d'informations et l'assistance communautaire. __DOUBLE_NEWLINE__ ### Section de Contact et de Questions __DOUBLE_NEWLINE__ **Canaux ouverts pour la communication et le soutien :** Chainbrary s'engage à fournir un environnement de soutien où la communication ouverte est priorisée. Nous comprenons l'importance de répondre aux questions, préoccupations et retours d'information, car ils sont cruciaux pour l'amélioration continue de notre plateforme et des relations avec la communauté. __DOUBLE_NEWLINE__ 1. **Méthode de contact principale :** __DOUBLE_NEWLINE__ - **Canaux communautaires :** Pour toute question, préoccupation ou retour concernant nos services ou tout aspect de notre plateforme, les utilisateurs sont encouragés à nous contacter via nos canaux communautaires, principalement sur Discord. Cette plateforme facilite l'interaction en temps réel et garantit une attention rapide de notre équipe. __DOUBLE_NEWLINE__ 2. **Soutien et réponse :** __DOUBLE_NEWLINE__ - **Équipe de soutien dédiée :** Notre équipe de soutien est activement présente sur Discord pour répondre aux questions des utilisateurs. Nous nous efforçons de fournir des réponses rapides et utiles à toutes les questions, garantissant que les utilisateurs se sentent écoutés et soutenus. __DOUBLE_NEWLINE__ - **Engagement communautaire :** Nous favorisons également un environnement où les membres de la communauté peuvent s'entraider, tirant parti des connaissances et des expériences collectives de notre base d'utilisateurs. __DOUBLE_NEWLINE__ 3. **Retours et suggestions :** __DOUBLE_NEWLINE__ - **Ouverts aux contributions des utilisateurs :** Chainbrary valorise les contributions et suggestions de notre communauté. Les utilisateurs sont encouragés à partager leurs idées et retours, qui jouent un rôle crucial dans l'élaboration de nos politiques et développements de la plateforme. __DOUBLE_NEWLINE__ - **Processus de considération transparent :** Tous les retours des utilisateurs sont soigneusement considérés par notre équipe. Bien que nous ne puissions pas mettre en œuvre chaque suggestion, nous veillons à ce que chaque idée soit examinée et reçoive une réponse appropriée. __DOUBLE_NEWLINE__ 4. **Problèmes et préoccupations :** __DOUBLE_NEWLINE__ - **Processus de résolution :** Pour les problèmes ou préoccupations, en particulier ceux liés à la confidentialité ou à l'utilisation des données, les utilisateurs peuvent nous contacter directement sur notre canal Discord. Nous avons mis en place des protocoles pour escalader et traiter ces questions avec le sérieux et la discrétion qu'elles méritent. __DOUBLE_NEWLINE__ - **Amélioration continue :** Les problèmes signalés par les utilisateurs ne sont pas seulement traités, mais également analysés pour des améliorations potentielles de nos politiques et pratiques. __DOUBLE_NEWLINE__ **Votre voix compte :** Chez Chainbrary, nous croyons en la croissance et l'amélioration pilotées par la communauté. Nos canaux sont toujours ouverts pour vos voix, garantissant que votre expérience avec Chainbrary soit non seulement sécurisée et privée, mais aussi collaborative et réactive. __DOUBLE_NEWLINE__ ### Résumé Final et Date d'Effet des Conditions Générales __DOUBLE_NEWLINE__ **Date d'effet :** __DOUBLE_NEWLINE__ - Les Conditions Générales de Chainbrary sont en vigueur depuis le 21 février 2024. Cette date marque le début des termes qui régissent l'utilisation des services de Chainbrary. __DOUBLE_NEWLINE__ - Nous encourageons tous les utilisateurs à consulter régulièrement les Conditions Générales pour se tenir informés de leurs droits et responsabilités lorsqu'ils utilisent Chainbrary. Il est essentiel de comprendre comment ces termes affectent votre interaction avec notre plateforme. __DOUBLE_NEWLINE__ **Notre engagement envers les utilisateurs :** __DOUBLE_NEWLINE__ - Chainbrary est inébranlable dans son engagement à fournir une expérience sécurisée, transparente et centrée sur l'utilisateur. Nous comprenons l'importance de maintenir une plateforme qui s'aligne sur la nature évolutive de la technologie blockchain et les besoins de notre communauté. __DOUBLE_NEWLINE__ - Nous assurons à nos utilisateurs que nous affinerons et mettrons continuellement à jour nos pratiques et politiques pour répondre aux normes les plus élevées de fonctionnalité et de protection des utilisateurs. Votre confiance et votre confiance en Chainbrary sont de la plus haute importance, et nous nous engageons à maintenir cette confiance à travers chaque action et décision que nous prenons. __DOUBLE_NEWLINE__ **Déclaration de clôture :** __DOUBLE_NEWLINE__ - Alors que nous naviguons dans le domaine dynamique et innovant de la technologie blockchain, Chainbrary s'engage à être un leader responsable et tourné vers l'avenir dans cet espace. Notre mission est de fournir une plateforme qui exploite non seulement les avantages de la blockchain, mais qui assure également un environnement sûr, respectueux et responsabilisant pour tous nos utilisateurs.
